/*======================================================================
хЛЪ ТЮИКЮ:          core_MenuParams.h
юБРНП:
бЕПЯХЪ ТЮИКЮ:
дЮРЮ ХГЛЕМЕМХЪ:
нОХЯЮМХЕ:
хМРЕПТЕИЯМШИ ЛНДСКЭ
======================================================================*/

#ifndef CORE_MENU_PARAMS_
#define CORE_MENU_PARAMS_

#include "core_MenuGlobal.h" 	// тЮИК ЙНМТХЦСПЮЖХХ ОЮПЮЛЕРПНБ 
#include "g_Ram.h" 				// тЮИК ОЮПЮЛЕРПНБ 

#define CREATE_STRUCTS

#define MAX_LEVEL			2 // бКНФЕММНЯРЭ ЛЕМЧ
#define GROUP_COUNT			5 // йНКХВЕЯРБН ЦПСОО

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define PDU_READ_ADR		3
#define PDU_WRITE_ADR		4

#ifdef CREATE_STRUCTS


const struct MENU_PARAM params[] = {

		"ю0.ярюрся пюанрш", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),						//0
		"ю1.дхюц опнжеяяю", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),						//1
		"ю2.дхюцмняр яерх", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),						//2
		"ю3.дхюц мюцпсгйх", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),						//3
		"ю4.дхюцм сярп-бю", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),						//4
		#if BUR_M
		"ю5.пегепб       ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//5
		#else
		" ю5.яняр бунднб ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),						//5
		#endif
		" ю6.яняр бшунднб", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),						//6
		"  ю7.онкнфемхе  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7
		"   ю8.лнлемр    ", "м*л ", 	0,  11000,  	0, M_SHOW|M_RMAX(4),						//8
		"   ю9.яйнпнярэ  ", "на/л",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),					//9
		"ю10.мюоп тюгш R ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//10
		"ю11.мюоп тюгш S ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//11
		"ю12.мюоп тюгш T ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//12
		" ю13.рнй тюгш U ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//13
		" ю14.рнй тюгш V ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//14
		" ю15.рнй тюгш W ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//15
		"ю16.сцнк мюцпсг ", "цпюд", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),					//16
		"ю17.ярюрся йюкха", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),						//17
		"A18.онкнфемхе % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//18
		" ю19.онкмши унд ", "на  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),				//19
		"ю20.рейсыхи унд ", "на  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//20
		"ю21.явер жхйкнб ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//21
		"ю22.релоепюрспю ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//22
		"ю23.релоеп айо  ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//23
		"ю24.бепяхъ он   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),				//24
		"ю25.бепяхъ онайо", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(2),				//25
		"ю26.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//26
		"ю27.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//27
		"ю28.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//28
		"ю29.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//29
		"ю30.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//30
		"ю31.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//31
		"ю32.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//32
		"ю33.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//33
		"ю34.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//34
		"ю35.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//35
		"ю36.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//36
		"ю37.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//37
		"ю38.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//38
		"ю39.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//39
		//-------------------------------------------------------------------------
		"B0.лнлемр гюйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),					//0
		"B1.лнлемр нрйп  ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),					//1
		"B2.лнл сок гюйп ", "м*л ",		0,	   11,		2, M_EDIT|M_KMM|M_RMAX(4),					//2
		"B3.лнл рпнц гюйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),					//3
		"B4.лнл сок нрйп ", "м*л ", 	0,     11,  	2, M_EDIT|M_KMM|M_RMAX(4),					//4
		"B5.лнл рпнц нрйп", "м*л ", 	0,     11,  	4, M_EDIT|M_KMM|M_RMAX(4),					//5
		"B6.рхо гюдбхфйх ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),						//6
		"B7.рхо сокнрмем ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),						//7
		"B8.рхо ьрнйю    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),						//8
		"B9.гнмю гюйпшрн ", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//9
		"B10.гнмю нрйпшрн", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//10
		"B11.гнмю ялеыем ", "на  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),				//11
		"B12.йнд днярсою ", "    ", 	0,  65530,  	0, M_CODE,									//12
		"   B13.бпелъ    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1,							//13
		"   B14.дюрю     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1,							//14
		"B15.йнпп вюянб  ", "я   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),					//15
		"B16.хмдхйюж рнйю", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),						//16
		"B17.пефхл лс/дс ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),						//17
		"B18.хярнв йнл дс", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),						//18
		"B19.акнй гюкхо  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),						//19
		"B20.бпелъ йнлюмд", "я   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),				//20
		"B21.рхо бу яхцм ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),						//21
		"B22.люяй бу яхцм", "    ", 	0,     31,  	0, M_BINE|M_RMAX(2),						//22
		"B23.люяй бшу яхц", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),						//23
		"B24.яйнп ябъгх  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),						//24
		"B25.юдпея ярюмж ", "    ", 	1,     32,  	1, M_EDIT|M_RMAX(1),						//25
		"B26.пефхл ябъгх ", "    ", 	0,      2,  	0, M_LIST|M_SADR(224),						//26
		"B27.пефхл онфюп ", "    ", 	0,      1,  	0, M_EDIT|M_SADR(186),						//27
		"B28.ляй ймно ыяс", "    ", 	0,     7,  		4, M_BINE|M_RMAX(2),						//28
		"   B29.MOD_FAULT", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//29
		"   B30.RES_ERR  ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//30
		"   B31.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//31
		"B32.бп нря дбхф ", "я   ", 	3,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//32
		"B33.осрэ сокнрм ", "на  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),				//33
		"  B34.пефхл рс  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//34
		"B35.дефспм пефхл", "C   ",     0,   6000,      0, M_HIDE|M_RMAX(3),						//35
		"   B36.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//36
		"   B37.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//37
		"   B38.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//38
		"   B39.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//39
		"рс нрйп 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//40
		"рс нрйп 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//41
		"рс нрйп 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//42
		"рс нрйп 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//43
		"рс нрйп йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//44
		"рс нрйп йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//45
		"рс нрйп ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//46
		"рс гюйп 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//47
		"рс гюйп 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//48
		"рс гюйп 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//49
		"рс гюйп 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//50
		"рс гюйп йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//51
		"рс гюйп йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//52
		"рс гюйп ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//53
		"рс ярно 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//54
		"рс ярно 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//55
		"рс ярно 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//56
		"рс ярно 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//57
		"рс ярно йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//58
		"рс ярно йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//59
		"рс ярно ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//60
		"рс лс   220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//61
		"рс лс   220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//62
		"рс лс   24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//63
		"рс лс   24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//64
		"рс лс   йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//65
		"рс лс   йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//66
		"рс лс   ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//67
		"рс яаюб 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//68
		"рс яаюб 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//69
		"рс яаюб 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//70
		"рс яаюб 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//71
		"рс яаюб йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//72
		"рс яаюб йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//73
		"рс яаюб ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//74
		"бйк рс  220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//75
		"бйк рс  220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//76
		"бйк рс  24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//77
		"бйк рс  24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//78
		"бйк рс  йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//79
		"бйк рс  йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//80
		"бйк рс  ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//81
		"рс дс   220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//82
		"рс дс   220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//83
		"рс дс   24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//84
		"рс дс   24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//85
		"рс дс   йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//86
		"рс дс   йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//87
		"рс дс   ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//88
		"   B47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//89
		"   B48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//90
		"   B49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//91
		//------------------------------------------------------------------
		" я0.йнд днярсою ", "    ",     0,  65530,      0, M_CODE,									//0
		"я1.рхо опхбндю  ", "    ",     0,     10,      0, M_FLST|M_SADR(227),						//1
		"я2.цнд хгцнрнбк ", "    ",     0,     99,     14, M_FACT|M_RMAX(1),						//2
		"я3.гюбнд мнлеп  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),						//3
		"я4.люйя лнлемр  ", "йм*л",    10,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(2),				//4
		"я5.мнлхмюкэм рнй", "A   ",     1,    300,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//5
		"я6.йо педсйрнпю ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),				//6
		"я7.йо акнй-пед  ", "    ",     1,  65530,    217, M_FACT|M_RMAX(4),						//7
		"я8.рнвм онкнфем ", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//8
		"я9.пюяяр веп тюг", "    ",     0,     75,     12, M_FACT|M_RMAX(1),						//9
		"я10.пюяяр лстрш ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),						//10
		"C11.рхо дюрв онк", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//11
		"я12.хмдхй йюкхап", "    ",     0,      1,      1, M_FLST|M_SADR(153),						//12
		"C13.бп яап хмдхй", "C   ",     0,     30,      0, M_FACT|M_RMAX(1),						//13
		"я14.сцк соп яхтс", "цпюд",     0,    180,      0, M_SHOW|M_RMAX(2),						//14
		"я15.сцк мюцпсгйх", "цпюд", -180U,    180,      0, M_SHOW|M_SIGN|M_RMAX(2),					//15
		"я16.яберндхндш  ", "    ",     0,     255,     0, M_BINF|M_RMAX(8),						//16
		"я17.дюрв унккю  ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),						//17
		"C18.он слнквюмхч", "    ",     0,      1,      0, M_FCOMM|M_SADR(155),						//18
		"   я19.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//19
		"C20.оепецп дбхц ", "    ", 	0,      1,  	1, M_FLST|M_SADR(153),						//20
		"C21.с люйя U 47%", "B   ",    220,    600,    318, M_FACT|M_RMAX(2),						//21
		"C22.T люйя U 47%", "C   ",      1,    200,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//22
		"я23.йнк.яанеб до", "    ",     0,     50,      0, M_SHOW|M_RMAX(1),						//23
		"я24.спнб яанъ до", "    ",     0,     50,      5, M_FACT|M_RMAX(1),						//24
		"я25.хмремя пюгц ", "    ",     0,    100,     10,  M_FACT|M_RMAX(2),						//25
		"я26.бпелъ оюсгш ", "    ",     6,    500,     50, M_FACT|M_RMAX(2)|M_PREC(2),							//26
		"я27.бпелъ рнплнф", "    ",     0,    500,    100, M_FACT|M_RMAX(2)|M_PREC(2),				//27
		"я28.йнк-бн сдюп ", "    ",     0,     10,      0, M_FACT|M_RMAX(1),						//28
		"я29.спнб люйя U ", "B   ",    220,    335,    285, M_FACT|M_RMAX(2),						//29
		"я30.бпел люйя U ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),				//30
		"я31.спнб лхм U  ", "B   ",     90,    220,    115, M_FACT|M_RMAX(2),						//31
		"я32.бпел лхм U  ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),				//32
		"я33.спнб меа U  ", "%   ",      3,     25,     10, M_FACT|M_RMAX(1),						//33
		"я34.бпел меа U  ", "C   ",      2,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//34
		"я35.спнб слем U ", "б   ",      0,    110,     60, M_FACT|M_RMAX(2),						//35
		"я36.бпел слем U ", "C   ",      1,    250,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//36
		"C37.гюы слем I  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//37
		"C38.спнб слем I ", "%   ",     20,    500,    200, M_FACT|M_RMAX(2)|M_PREC(1),				//38
		"C39.бпел слем I ", "C   ",      1,    100,     10, M_FACT|M_RMAX(1)|M_PREC(1),				//39
		"C40.бп-рнй гюы  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//40
		"C41.спнб лхм I  ", "%   ",   1050,   1400,   1200, M_FACT|M_RMAX(3)|M_PREC(1),				//41
		"C42.спнб япед I ", "%   ",   1500,   1900,   1700, M_FACT|M_RMAX(3)|M_PREC(1),				//42
		"C43.спнб люйя I ", "%   ",   2000,   2250,   2100, M_FACT|M_RMAX(3)|M_PREC(1),				//43
		"C44.бпел лхм I  ", "C   ",      1,   6000,   1800, M_FACT|M_RMAX(3)|M_PREC(1),				//44
		"C45.бпел япед I ", "C   ",      1,   6000,   1200, M_FACT|M_RMAX(3)|M_PREC(1),				//45
		"C46.бпел люйя I ", "C   ",      1,   6000,    600, M_FACT|M_RMAX(3)|M_PREC(1),				//46
		"я47.бп веп тюг  ", "я   ",      1,    600,     10, M_EDIT|M_RMAX(2)|M_PREC(1),				//47
		"C48.сп оепец дб.", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//48
		"C49.бу оепец дб.", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//49
		"C50.гюы люйя U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//50
		"C51.гюы лхм U   ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//51
		"C52.гюы меаюк U ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//52
		"C53.гюы слем U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//53
		"C54.веп тюг дбхц", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//54
		"я55.бп люйя U м ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//55
		"я56.бп лхм U м  ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//56
		"C57.ондбепяхъ он", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//57
		"C58.гюы лхм I   ", "    ",      0,      1,      0, M_FLST|M_SADR(153),						//58
		"C59.сп лхм I    ", "%   ",     20,    500,    300, M_FACT|M_RMAX(2)|M_PREC(1),				//59
		"C60.бпел лхм I  ", "C   ",      1,    600,    300, M_FACT|M_RMAX(2)|M_PREC(1),				//60
		"C61.гюы меа I   ", "    ",      0,      1,      0, M_FLST|M_SADR(153),						//61
		"C62.сп меа I    ", "%   ",      2,     70,     65, M_FACT|M_RMAX(1),						//62
		"C63.бпел меа I  ", "C   ",      2,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(1),				//63
		"C64.гюыхрю нр йг", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//64
		"   C65.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//65 РСР АШКХ ЯРЮПШЕ СПНБМХ йг
		"   C66.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//66
		"   C67.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//67
		"C68.хмд юбю сярп", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//68
		"C69.оепец/оепену", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//69
		" я70.сп оепецп  ", "цпюд",      0,    100,     90, M_FACT|M_SIGN|M_RMAX(2),				//70
		"я71.сп оепенук  ", "цпюд",   -50U,      0,   -37U, M_FACT|M_SIGN|M_RMAX(2),				//71
		"я72.сп бйк ремю ", "цпюд",   -40U,     10,   -10U, M_FACT|M_SIGN|M_RMAX(2),				//72
		"я73.сп бшйк рем ", "цпюд",   -20U,     50,     10, M_FACT|M_SIGN|M_RMAX(2),				//73
		"я74.йнпп релоеп ", "цпюд",  -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),				//74
		"я75.мехяо лс/дс ", "    ",     0,       1,      1, M_FLST|M_SADR(153),						//75
		"я76.рейсы ялеы U", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),				//76
		"я77.рейсы ялеы V", "    ",-32000U,  32000,      0, M_FACT|M_SIGN|M_RMAX(4),				//77
		"я78.рейсы ялеы W", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),				//78
		" я79.йнп рнйю U ", "    ",      0,  65530,    157, M_FACT|M_RMAX(4),						//79
		" я80.йнп рнйю V ", "    ",      0,  65530,    157, M_FACT|M_RMAX(4),						//80
		" я81.йнп рнйю W ", "    ",      0,  65530,    157, M_FACT|M_RMAX(4),						//81
		"я82.ялеы рнйю U ", "    ",      0,  65530,  31700, M_FACT|M_RMAX(4),						//82
		"я83.ялеы рнйю V ", "    ",      0,  65530,  31700, M_FACT|M_RMAX(4),						//83
		"я84.ялеы рнйю W ", "    ",      0,  65530,  31700, M_FACT|M_RMAX(4),						//84
		" я85.йнп мюоп R ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//85
		" я86.йнп мюоп S ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//86
		" я87.йнп мюоп T ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//87
		"я88.ялеы мюоп R ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//88
		"я89.ялеы мюоп S ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//89
		"я90.ялеы мюоп T ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//90
		"я91.оняр.бп.яхм ", "MйC ",      0,    100,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//91
		"я92.оняр.бп.RMS ", "MйC ",      0,    100,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//92
		"я93.йнппейр жюо ", "    ",      0,  65530,   3420, M_FACT|M_RMAX(4),						//93
		"я94.ялеы жюо    ", "    ",      0,  65530,    683, M_FACT|M_RMAX(4),						//94
		"я95.онкнф гюйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//95
		"я96.онкнф нрйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//96
		"я97.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//97
		"я98.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//98
		"я99.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//99
		"я100.бепу сп йг ", "    ",      0,  65530,  45000, M_FACT|M_RMAX(4),						//100
		"я101.мхфм сп йг ", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//101
		"я102.онкнфем    ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//102
		"C103.онмхф U    ", "    ",      0,  65530,   5050, M_FACT|M_RMAX(4),						//103
		"я104.йнщт 25%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//104
		"я105.йнщт 35%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//105
		"я106.йнщт 50%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//106
		"я107.йнщт 75%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//107
		"я108.йнщт 100%  ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//108
		"я109.йнп дн 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//109
		"я110.йнп дн 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//110
		"я111.йнп дн 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//111
		"я112.йнп дн 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//112
		"   я113.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//113
		"   я114.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//114
		"   я115.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//115
		"   я116.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//116
		"   я117.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//117
		"   я118.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//118
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//119
		//------------------------------------------------------------------
		"D0.гюдюмхе гюйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//0
		"D1.гюдюмхе нрйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//1
		"D2.нанп мю нрйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//2
		"D3.нанп мю гюйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//3
		"  D4.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//4
		"D5.яапня йюкхап ", "    ",      0,      1,      0, M_COMM|M_SADR(158),						//5
		"D6.йнлюмд сопюбк", "    ",      0,     19,      0, M_COMM|M_SADR(160),						//6
		" D7.яапня гюыхр ", "    ",      0,      1,      0, M_COMM|M_SADR(160),						//7
		" D8.он слнквюмхч", "    ",      0,      1,      0, M_COMM|M_SADR(155),						//8
		"   D9.пегепб    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),						//9
		"D10.яапня жхйкнб", "    ",      0,      1,     0, M_COMM|M_SADR(160),						//10
		"D11.яапня ябъгх ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),						//11
		"   D12.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//12
		"   D13.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//13
		"   D14.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//14
		"   D15.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//15
		"   D16.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//16
		"   D17.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//17
		"   D18.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//18
		"   D19.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//19
		//-------------------------------------------------------------------
		"G0.пефхл реярю  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),						//0
		"G1.реяр ябернд  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//1
		"G2.реяр дхя бшу ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//2
		"G3.гмювемхе жюо ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),			//3
		"G4.ярюпр дхяок  ", "    ",      0,      1,      0, M_FDCOM,								//4
		"G5.TECT я йюлепш", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),						//5
		"G6.цпсо рхпхяр  ", "    ",      0,      1,      0, M_FDCOM,								//6
		"G7.пюгпеь яхтс  ", "    ",      0,      1,      0, M_FDCOM,								//7
		"   G8.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//8
		"   G9.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//9
		"   G10.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//10
		"   G11.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//11
		"   G12.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//12
		"   G13.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//13
		"   G14.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//14
		"   G15.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//15
		"   G16.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//16
		"   G17.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//17
		"G18.реяр сцнк нр", "    ",      0,    140,      0, M_FDCOM|M_RMAX(2),						//18
		"   G19.пегепб   ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//19
		"   G20.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//20
		"   G21.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//21
		"   G22.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//22
		"   G23.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//23
		"   G24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//24
		"   G25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//25
		"   G26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//26
		"   G27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//27
		"   G28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//28
		"   G29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//29
		//-------------------------------------------------------------------
		"янярнъмхе йюкхап", "    ",      0,      3,      0, M_HIDE,									//0
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//1
		"онкнф гюйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//2
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//3
		"онкнф нрйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//4
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//5
		"    оюпнкэ 1    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//6
		"    оюпнкэ 2    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//7
		"   юбюпхх йг    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//8
		"   рнкэйн сонп  ", "    ", 	 0,      1,  	 0, M_HIDE|M_RMAX(1),						//9
		"м10.явервхй жхйк", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//10
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//11
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//12
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//13
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//14
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//15
		"  рнй оепеундю  ", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//16
		" лнлемр рнй 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//17
		" лнлемр рнй 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//18
		" лнлемр рнй 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//19
		" лнлемр рнй 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//20
		" лнлемр рнй 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//21
		" лнлемр рнй 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//22
		" лнлемр рнй 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//23
		" лнлемр рнй 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//24
		" лнлемр рнй 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//25
		" лнлемр рнй 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//26
		" лнлемр рнй 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//27
		" лнлемр рнй 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//28
		" лнлемр рнй 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//29
		" лнлемр рнй 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//30
		" лнлемр рнй 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//31
		" лнлемр рнй 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//32
		" лнлемр рнй 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//33
		" лнлемр рнй 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//34
		" лнлемр рнй 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//35
		" лнлемр рнй 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//36
		"лнлемр сцнк 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//37
		"лнлемр сцнк 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//38
		"лнлемр сцнк 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//39
		"лнлемр сцнк 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//40
		"лнлемр сцнк 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//41
		"лнлемр сцнк 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//42
		"лнлемр сцнк 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//43
		"лнлемр сцнк 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//44
		"лнлемр сцнк 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//45
		"лнлемр сцнк 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//46
		"лнлемр сцнк 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//47
		"лнлемр сцнк 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//48
		"лнлемр сцнк 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//49
		"лнлемр сцнк 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//50
		"лнлемр сцнк 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//51
		"лнлемр сцнк 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//52
		"лнлемр сцнк 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//53
		"лнлемр сцнк 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//54
		"лнлемр сцнк 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//55
		"лнлемр сцнк 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//56
		" сцнк яхтс 0_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//57
		" сцнк яхтс 0_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//58
		" сцнк яхтс 0_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//59
		" сцнк яхтс 0_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//60
		" сцнк яхтс 0_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//61
		" сцнк яхтс 1_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//62
		" сцнк яхтс 1_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//63
		" сцнк яхтс 1_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//64
		" сцнк яхтс 1_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//65
		" сцнк яхтс 1_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//65
		" сцнк яхтс 2_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//67
		" сцнк яхтс 2_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//68
		" сцнк яхтс 2_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//69
		" сцнк яхтс 2_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//70
		" сцнк яхтс 2_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//71
		" сцнк яхтс 3_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//72
		" сцнк яхтс 3_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//73
		" сцнк яхтс 3_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//74
		" сцнк яхтс 3_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//75
		" сцнк яхтс 3_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//76
		"бп бша гюгнпю   ", "C   ",      0,    100,      0, M_HIDE|M_RMAX(2)|M_PREC(1),				//77
		"йнлюмдш рс      ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//78
		"мюопъф тюгш R   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//79
		"мюопъф тюгш S   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//80
		"мюопъф тюгш T   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//81
		"япедмее мюоп    ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//82
		"меаюк тюг яерх  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//83
		"вепед тюг яерх  ", "    ",      0,      2,      0, M_HIDE|M_SADR(180),						//84
		"мехяопюбм яерх  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),						//85
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//86
		"дхюцм мюцпсгйх  ", "    ",      0,  65530,      0, M_HIDE|M_SADR(52),						//87
		"  рнй тюгш U %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//88
		"  рнй тюгш V %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//89
		"  рнй тюгш W %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//90
		" япедмхи рнй    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//91
		"меаюк рнй мюцп  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//92
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//93
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//94
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//95
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//96
		" рхо пебепяю    ", "    ",      0,      2,      2, M_HIDE|M_SADR(183),						//97
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//98
		" яняр бунднб    ", "    ",      0,  65530,      0, M_HIDE|M_SADR(86),						//99
		" яняр бшунднб   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(103),						//100
		"пекеимши пефхл  ", "    ",      0,      1,      0, M_HIDE|M_SADR(186),						//101
		" бунд нрйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//102
		" бунд гюйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//103
		" бунд ярно      ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//104
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//105
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//106
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//107
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//108
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//109
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//110
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//111
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//112
		"дхюцм сярп-бю   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(69),						//113
		"хмдхй б ярюпре  ", "    ",      0,     29,     18, M_HIDE|M_SADR(190),						//114
		"дефспмши пефхл  ", "C   ",      0,   6000,      0, M_HIDE|M_RMAX(3),						//115
		"опнжемр хяонкм  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//116
		"мюв юдп фспм яна", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//117
		"мюв юдп фспм йнл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//118
		"мюв юдп фспм оюп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//119
		"гюохях фспм яна ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//120
		"гюохях фспм йнл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//121
		"гюохях фспм оюп ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//122
		"    лнлемр      ", "м*л ",      0,  11000,      0, M_HIDE|M_RMAX(4),						//123
		"    яйнпнярэ    ", "на/л", -3600U,   3600,      0, M_HIDE|M_SIGN|M_RMAX(3),				//124
		"    яейсмдш     ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),						//125
		"соп йнмрюйрнпюлх", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//126
		"  йнлюмдш асп   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//127
		" яапня фспмюкнб ", "    ",      0,  1,          0, M_HIDE|M_RMAX(4),						//128
		"м129.хмдхй айо  ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//129
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//130
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//131
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//132
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//133
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//134
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//135
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//136
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//137
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//138
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//139
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//140
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//141
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//142
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//143
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//144
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//145
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//146
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//147
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//148
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//149
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//150
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//151
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//152
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//153
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//154
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//155
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//156
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//157
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//158
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//159
		//-------------------------------------------------------------------
		"     бпелъ      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,							//T
		"      дюрю      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,							//D
		"E0.ярюрся пюанрш", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),						//0
		"E1.дхюцм опнжеяя", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),						//1
		"E2.дхюцмняр яерх", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),						//2
		"E3.дхюцм мюцпсгй", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),						//3
		"E4.дхюцм сярп-бю", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),						//4
		"E5.онкнфемхе %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//5
		"    E6.лнлемр   ", "м*л ",     10,  11000,     10, M_SHOW|M_RMAX(4),						//6
		"E7.мюопъф тюгш R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//7
		"E8.мюопъф тюгш S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//8
		"E9.мюопъф тюгш T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//9
		"E10.рнй тюгш U  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//10
		"E11.рнй тюгш V  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//11
		"E12.рнй тюгш W  ", "ю/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//12
		"E13.релоеп акнй ", "цпюд",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),				//13
		"E14.яняр бунднб ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),						//14
		"E15.яняр бшунднб", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),						//15
		"   E16.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//16
		"   E17.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//17
		"   E18.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//18
		"   E19.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//19
		"   E20.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//20
		"   E21.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//21
		"   E22.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//22
		"   E23.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//23
		"   E24.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//24
		"   E25.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//25
		"   E26.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//26
		"   E27.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//27
		"   E28.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//28
		"   E29.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)						//29
};

const struct MENU_STRING values[] = {
	"    гюохяэ      ",	// 0
//----------------
	"  ме нопедекем  ",	// 1
	"      ярно      ",	// 2
	"     юбюпхъ     ",	// 3
	" хдер гюйпшрхе  ",	// 4
	" хдер нрйпшрхе  ",	// 5
	"   хдер реяр    ",	// 6
	"    гюйпшрн     ",	// 7
	"    нрйпшрн     ",	// 8
	"     лстрю      ",	// 9
	" леярмне сопюбк ",	// 10
	"  бйкчвем рем   ",	// 11
	"BLUETOOTH бйк   ",	// 12
	"юбюпхъ мю акнйе ",	// 13
	"  юбюпхъ мю ря  ",	// 14
	"  мехяопюбмнярэ ",	// 15
	"мехяопюбм мю акй",	// 16
	"мехяопюбм мю ря ",	// 17
//--------------------------
	"   мер юбюпхи   ",	// 18
	"  мер дбхфемхъ  ",	// 19
	"  веп тюг дбхц  ",	// 20
	" ме гюдюмн гюйп ",	// 21
	" ме гюдюмн нрйп ",	// 22
	" мер йюкхапнбйх ",	// 23
	"сокнрм ме днярхц",	// 24
	"     лстрю      ",	// 25
	"  мехяоп лс/дс  ",	// 26
	"     пегепб     ",	// 27
	"     пегепб     ",	// 28
	"     пегепб     ",	// 29
	"     пегепб     ",	// 30
	"     пегепб     ",	// 31
	"     пегепб     ",	// 32
	"     пегепб     ",	// 33
	"     пегепб     ",	// 34
//--------------------------
	"   мер юбюпхи   ",	// 35
	"лхм мюоп тюгш R ",	// 36
	"лхм мюоп тюгш S ",	// 37
	"лхм мюоп тюгш T ",	// 38
	"люйя мюоп тюгш R",	// 39
	"люйя мюоп тюгш S",	// 40
	"люйя мюоп тюгш T",	// 41
	"меноп вепед тюг ",	// 42
	"меаюкюмя/напшб U",	// 43
	"слем мюоп тюгш R",	// 44
	"слем мюоп тюгш S",	// 45
	"слем мюоп тюгш T",	// 46
	"мюоп тюгш R 47% ",	// 47
	"мюоп тюгш S 47% ",	// 48
	"мюоп тюгш T 47% ",	// 49
	"  веп тюг яерх  ",	// 50
	"     пегепб     ",	// 51
//--------------------------
	"   мер юбюпхи   ",	// 52
	"  напшб тюгш U  ",	// 53
	"  напшб тюгш V  ",	// 54
	"  напшб тюгш W  ",	// 55
	"бп-рнй оепецпсгй",	// 56
	"     пегепб     ",	// 57
	"   йг тюгш U    ",	// 58
	"   йг тюгш V    ",	// 59
	"   йг тюгш W    ",	// 60
	"     пегепб     ",	// 61
	"     пегепб     ",	// 62
	" лхмхлюкэм рнй  ",	// 63
	" меаюкюмя рнйю  ",	// 64
	"     пегепб     ",	// 65
	"     пегепб     ",	// 66
	"     пегепб     ",	// 67
	"     пегепб     ",	// 68
	//---------------------------------------------------------------------------
	"   мер юбюпхи   ",	// 69
	"яани дюрв онкнф ",	// 70
	" яани оюлърх 1  ",	// 71
	" яани оюлърх 2  ",	// 72
	"   яани вюянб   ",	// 73
	"яани дюрв релоеп",	// 74
	" оепецпеб айо   ",	// 75
	"оепенукюфд айо  ",	// 76
	"оепецпеб айд    ",	// 77
	"оепенукюфд айд  ",	// 78
	"яани жюо        ",	// 79
	"бшйкчвемхе айд  ",	// 80
	"йпхр оепецпеб ак",	// 81
	"     пегепб     ",	// 82
	"     пегепб     ",	// 83
	"     пегепб     ",	// 84
	"     пегепб     ",	// 85
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 86
	"  бунд нрйпшрэ  ",	// 87
	"  бунд гюйпшрэ  ",	// 88
	"   бунд ярно    ",	// 89
	"    бунд лс     ",	// 90
	"    бунд дс     ",	// 91
	"     пегепб     ",	// 92
	"     пегепб     ",	// 93
	"     пегепб     ",	// 94
	"     пегепб     ",	// 95
	"     пегепб     ",	// 96
	"     пегепб     ",	// 97
	"     пегепб     ",	// 98
	"     пегепб     ",	// 99
	"     пегепб     ",	// 100
	"     пегепб     ",	// 101
	"     пегепб     ",	// 102
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 103
	"    юбюпхъ      ",	// 104
	"    гюйпшрн     ",	// 105
	"    нрйпшрн     ",	// 106
	"     лстрю      ",	// 107
	"  гюйпшбюеряъ   ",	// 108
	"  нрйпшбюеряъ   ",	// 109
	"     лс/дс      ",	// 110
	"  мехяопюбмнярэ ",	// 111
	"     пегепб     ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
	//---------------------------------------------------------------------------
	" мер йюкхапнбйх ",	// 120
	" гюдюмн гюйпшрн ",	// 121
	" гюдюмн нрйпшрн ",	// 122
	"йюкхап бшонкмемю",	// 123
	//---------------------------------------------------------------------------
	"    йкхмнбюъ    ",	// 124
	"    ьхаепмюъ    ",	// 125
	//---------------------------------------------------------------------------
	"  ме нопедекем  ",	// 126
	" аег сокнрмемхъ ",	// 127
	"сокнрмемхе гюйп ",	// 128
	"сокнрмемхе нрйп ",	// 129
	"сок гюйп х нрйп ",	// 130
	//---------------------------------------------------------------------------
	"   мнплюкэмши   ",	// 131
	"    напюрмши    ",	// 132
	//---------------------------------------------------------------------------
	"деиярб гмювемхъ ",	// 133
	"опнжемрш нр мнл ",	// 134
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 135
	"  бшанп пефхлю  ",	// 136
	"    пефхл лс    ",	// 137
	"    пефхл дс    ",	// 138
	//---------------------------------------------------------------------------
	" бяе хмрептеияш ",	// 139
	"рнкэйн дхяйперм ",	// 140
	"рнкэйн онякеднб ",	// 141
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 142
	"    бйкчвемю    ",	// 143
	//---------------------------------------------------------------------------
	"      24б       ",	// 144
	"      220б      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 анд    ",	// 146
	"    4800 анд    ",	// 147
	"    9600 анд    ",	// 147
	"   19200 анд    ",	// 149
	"   38400 анд    ",	// 150
	"   57600 анд    ",	// 151
	"   115200 анд   ",	// 152
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 153
	"хмдхй х нярюмнб ",	// 154
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 155
	"     гюдюрэ     ",	// 156
	"    яапняхрэ    ",	// 157
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 158
	"    яапняхрэ    ",	// 159
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 160
	"      ярно      ",	// 161
	"    гюйпшрэ     ",	// 162
	"    нрйпшрэ     ",	// 163
	"  гюйпшрэ реяр  ",	// 164
	"  нрйпшрэ реяр  ",	// 165
	"     пегепб     ",	// 166
	"     пегепб     ",	// 167
	"     пегепб     ",	// 168
	"     пегепб     ",	// 169
	"     пегепб     ",	// 170
	"     пегепб     ",	// 171
	"     пегепб     ",	// 172
	"     пегепб     ",	// 173
	"     пегепб     ",	// 174
	"     пегепб     ",	// 175
	"     пегепб     ",	// 176
	"     пегепб     ",	// 177
	"     пегепб     ",	// 178
	"     пегепб     ",	// 179
	//---------------------------------------------------------------------------
	" ме нопедекемн  ",	// 180
	"напюрм онякеднб ",	// 181
	"опълюъ онякеднб ",	// 182
	//---------------------------------------------------------------------------
	"    нярюмнб     ",	// 183
	" юбрнлюрхвеяйхи ",	// 184
	"  хцмнпхпнбюмхе ", // 185
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 186
	"    бйкчвем     ",	// 187
	//---------------------------------------------------------------------------
	"мнпл пюгнлймсрши",	// 188
	" мнпл гюлймсрши ",	// 189
	//---------------------------------------------------------------------------
	" ярюрся пюанрш  ",	// 190
	" дхюцм опнжеяяю ",	// 191
	" дхюцмняр яерх  ",	// 192
	" дхюцм мюцпсгйх ",	// 193
	" дхюцм сярп-бю  ",	// 194
	"  яняр бунднб   ",	// 195
	"  яняр бшунднб  ",	// 196
	"     пегепб     ",	// 197
	"     лнлемр     ",	// 198
	"    яйнпнярэ    ",	// 199
	"  япедмее мюоп  ",	// 200
	"  япедмхи рнй   ",	// 201
	" сцнк мюцпсгйх  ",	// 202
	"     пегепб     ",	// 203
	"     пегепб     ",	// 204
	"     пегепб     ",	// 205
	"     пегепб     ",	// 206
	"     пегепб     ",	// 207
	"     пегепб     ",	// 208
	"     пегепб     ",	// 209
	"     пегепб     ",	// 210
	"     пегепб     ",	// 211
	"     пегепб     ",	// 212
	"     пегепб     ",	// 213
	"     пегепб     ",	// 214
	"     пегепб     ",	// 215
	"     пегепб     ",	// 216
	"     пегепб     ",	// 217
	"     пегепб     ",	// 218
	"     пегепб     ",	// 219
	//----------------------------------------------
	"  он сярюбйюл   ",	// 220
	"он сяр я гюдепфй",	// 221
	" бяецдю бйк     ",	// 222
	" псвмне соп     ",	// 223
	//-----------------------------------------------
	"  аег опнбепйх  ",	// 224
	" мю мевермнярэ  ",	// 225
	"  мю вермнярэ   ",	// 226
   //-----------------------------------------------
    "ме нопедекем    ",	// 227
	"щож-100 ю.25    ",	// 228
	"щож-100 ю.50    ",	// 229
	"щож-400 а.20    ",	// 230
	"щож-400 а.40    ",	// 231
	"щож-800 б.40    ",	// 232
	"щож-1000 б.20   ",	// 233
	"щож-4000 ц.9    ",	// 234
	"щож-4000 ц.18   ",	// 235
	"щож-10000 д.6   ",	// 236
	"щож-10000 д.12  "	// 237
};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн",	// 0
	"    йнлюмдю     ",	// 1
	"    нрлемемю    ",	// 2
	"  о 999.99%     ",	// 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?",	// 4	0
	"    дю  мер     ",	// 5
	" гюдюрэ лнлемр  ",	// 6	1
	"йюкхапнбйх  нй  ",	// 7
	" рхо йюкхапнбйх ",	// 8	2
	" псвм  йнк.нанп ",	// 9
	"оепебедх б онкнф",	// 10	3
	" гюйпшрн   нй   ",	// 11
	"оепебедх б онкнф",	// 12	4
	" нрйпшрн   нй   ",	// 13
	"оепебедх б йпюим",	// 14	5
	"онкнфемхе   нй  ",	// 15
	"   онкнфемхе    ",	// 16	6
	"   гюйп  нрйп   ",	// 17
	"опнбепхрэ йюкха?",	// 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ",	// 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ",	// 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ",	// 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ",	// 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ",	// 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ",	// 30	13
	"  лнлемрш   нй  ", // 31
};

#endif

#endif




