/*======================================================================
Èìÿ ôàéëà:          core_MenuParams.h
Àâòîð:
Âåðñèÿ ôàéëà:
Äàòà èçìåíåíèÿ:
Îïèñàíèå:
Èíòåðôåéñíûé ìîäóëü
======================================================================*/

#ifndef CORE_MENU_PARAMS_
#define CORE_MENU_PARAMS_

#include "core_MenuGlobal.h" 	// Ôàéë êîíôèãóðàöèè ïàðàìåòðîâ 
#include "g_Ram.h" 				// Ôàéë ïàðàìåòðîâ 

#define CREATE_STRUCTS

#define MAX_LEVEL			2 // Âëîæåííîñòü ìåíþ
#define GROUP_COUNT			5 // Êîëè÷åñòâî ãðóïï

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define PDU_READ_ADR		3
#define PDU_WRITE_ADR		4

#ifdef CREATE_STRUCTS

const struct ADDR_PARAM_ATS48 addr_params_altistar48[] = {
		400, // ðåãèñòð óïðàâëåíèÿ
		402, // ðàñøèðåííûé ðåãèñòð óïðàâëåíèÿ
		458, // ðåãèñòð ñîñòîÿíèÿ
		459, // ðàñøèðåííûé ðåãèñòð ñîñòîÿíèÿ ¹1
		460, // ðàñøèðåííûé ðåãèñòð ñîñòîÿíèÿ ¹2
		4200,// âðåìÿ ðàçãîíà
		4102,// Çàùèòà îò îáðûâà ôàç
};

const struct MENU_PARAM params[] = {
		"   Ò0.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//0
		"   Ò1.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//1
		"   Ò2.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_SIGN|M_RMAX(4),					//2
		"   Ò3.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, MT_DEC|M_RMAX(4),						//3
		"   Ò4.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//4
		"   Ò5.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//5
		"   Ò6.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//6
		"   Ò7.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//7
		"   Ò8.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//8
		"   Ò9.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//9
		"   Ò10.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//10
		"   Ò11.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//11
		"   Ò12.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//12
		"   Ò13.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//13
		"   Ò14.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//14
		"   Ò15.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//15
		"   Ò16.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//16
		"   Ò17.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//17
		"   Ò18.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//18
		"   Ò19.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//19
		"   Ò20.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//20
		"   Ò21.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//21
		"   Ò22.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//22
		"   Ò23.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//23
		"   Ò24.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//24
		"   Ò25.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//25
		"   Ò26.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//26
		"   Ò27.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//27
		"   Ò28.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//28
		"   Ò29.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//29
		"   Ò30.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//30
		"   Ò31.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//31
		"   Ò32.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//32
		"   Ò33.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//33
		"   Ò34.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//34
		"   Ò35.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//35
		"   Ò36.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//36
		"   Ò37.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//37
		"   Ò38.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//38
		"   Ò39.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//39
		//-------------------------------------------------------------------------
		"B0.ÌÎÌÅÍÒ ÇÀÊÐ  ", "Í*Ì ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//40
		"B1.ÌÎÌÅÍÒ ÎÒÊÐ  ", "Í*Ì ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//41
		"B2.ÌÎÌ ÓÏË ÇÀÊÐ ", "Í*Ì ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//42
		"B3.ÌÎÌ ÒÐÎÃ ÇÀÊÐ", "Í*Ì ", 	0,     60,  	4, M_EDIT|M_KMM|M_RMAX(4),					//43
		"B4.ÌÎÌ ÓÏË ÎÒÊÐ ", "Í*Ì ", 	0,     60,  	2, M_EDIT|M_KMM|M_RMAX(4),					//44
		"B5.ÌÎÌ ÒÐÎÃ ÎÒÊÐ", "Í*Ì ", 	0,     60,  	4, M_EDIT|M_KMM|M_RMAX(4),					//45
		"B6.ÒÈÏ ÇÀÄÂÈÆÊÈ ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),						//46
		"B7.ÒÈÏ ÓÏËÎÒÍÅÍ ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),						//47
		"B8.ÒÈÏ ØÒÎÊÀ    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),						//48
		"B9.ÇÎÍÀ ÇÀÊÐÛÒÎ ", "ÎÁ  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//49
		"B10.ÇÎÍÀ ÎÒÊÐÛÒÎ", "ÎÁ  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//50
		"B11.ÇÎÍÀ ÑÌÅÙÅÍ ", "ÎÁ  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),				//51
		"B12.ÊÎÄ ÄÎÑÒÓÏÀ ", "    ", 	0,  65530,  	0, M_CODE,									//52
		"   B13.ÂÐÅÌß    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1|M_PWP1,					//53
		"   B14.ÄÀÒÀ     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1|M_PWP1,					//54
		"B15.ÊÎÐÐ ×ÀÑÎÂ  ", "Ñ   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),					//55
		"B16.ÈÍÄÈÊÀÖ ÒÎÊÀ", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),						//56
		"B17.ÐÅÆÈÌ ÌÓ/ÄÓ ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),						//57
		"B18.ÈÑÒÎ× ÊÎÌ ÄÓ", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),						//58
		"B19.ÁËÎÊ ÇÀËÈÏ  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),						//59
		"B20.ÂÐÅÌß ÊÎÌÀÍÄ", "Ñ   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),				//60
		"B21.ÒÈÏ ÂÕ ÑÈÃÍ ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),						//61
		"B22.ÌÀÑÊ ÂÕ ÑÈÃÍ", "    ", 	0,    127,     12, M_BINE|M_RMAX(2),						//62
		"B23.ÌÀÑÊ ÂÛÕ ÑÈÃ", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),						//63
		"B24.ÑÊÎÐ ÑÂßÇÈ  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),						//64
		"B25.ÀÄÐÅÑ ÑÒÀÍÖ ", "    ", 	1,    247,  	1, M_EDIT|M_RMAX(1),						//65
		"B26.ÐÅÆÈÌ ÑÂßÇÈ ", "    ", 	0,      2,  	0, M_LIST|M_SADR(224),						//66
		"B27.ÂÐÅ ÑÐÀÁ ÌÓÔ", "Ñ   ", 	2,    100,      3, M_EDIT|M_RMAX(2)|M_PREC(1),				//67
		"B28.ÌÓ/ÄÓ ÙÒÌ   ", "    ", 	0,      1,  	0, M_EDIT|M_RMAX(1),						//68
		"B29.ÌÓÔÒ ÑÒÀÐÒ  ", "    ", 	0,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//69  20.02.2020 ÏÈÀ äîáàâèë ðàçäåëåíèå ìóôòû íà ñòàðò è äâèæåíèå
		"B30.ÂÐÅÌ ÐÀÇÃÎÍÀ", "    ", 	0,    100,     30, M_EDIT|M_RMAX(2)|M_PREC(1),				//70  20,02,2020 ÏÈÀ äîáàâèë îïðåäåëåíèå âðåìåíè ðàçãîíà
		"B31.ÐÅÆ 3 ÑÅÊ   ", "    ", 	0,  	1,  	0, M_EDIT|M_RMAX(4),						//71
		"B32.ÂÐ ÎÒÑ ÄÂÈÆ ", "Ñ   ", 	3,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//72
		"B33.ÏÓÒÜ ÓÏËÎÒÍ ", "ÎÁ  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),				//73
		"B34.ÌÅÑÒÎ ÓÑÒÀÍÎ", "    ", 	0,  	2,  	0, M_EDIT|M_RMAX(4),						//74	// ÏÈÀ 0- îáû÷íàÿ , 1 - àãðåãàòíàÿ, 2 - ïîæàðêà
		"B35.ÐÅÀÊ ÍÀ ÑÒÎÏ", "    ", 	0,      1,  	1, M_EDIT|M_RMAX(4),						//75	 SDV ÖÏÀ
		"B36.ÒÈÏ ÒÎÐÌÎÆÅÍ", "    ", 	0,      2,  	0, M_EDIT|M_RMAX(0),						//76
		"  B37. R ËÈÍÈÈ  ", "ìì2 ", 	0,  65535,  	1, M_EDIT|M_RMAX(4),						//77
		"  B38. L ËÈÍÈÈ  ", "ì   ", 	0,  65535,  	1, M_EDIT|M_RMAX(4),						//78
		"   B39.ÊÎÐ ÍÀÏÐ ", "    ", -32000,  32000,  	0, M_EDIT|M_RMAX(4),						//79
		"B40.ØÀÃÎÂÛÉ ÐÅÆÌ", "    ", 	0,      1,  	0, M_LIST|M_SADR(186),						//80
		"B41.ÊÎË-ÂÎ ØÀÃÎÂ", "    ", 	1,     12,  	4, M_EDIT|M_RMAX(2),						//81
		"B42.ÂÐÅÌß ÏÀÓÇÛ ", "Ñ   ", 	1,     60,     15, M_EDIT|M_RMAX(3),						//82
		"   B43.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//83
		"   B44.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//84
		"   B45.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//85
		"   B46.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//86
		"   B47.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//87
		"   B48.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//88
		"   B49.ÐÅÇÅÐÂ   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//89
		//------------------------------------------------------------------
		" Ñ0.ÊÎÄ ÄÎÑÒÓÏÀ ", "    ",     0,  65530,      0, M_CODE,									//90
		"Ñ1.ÒÈÏ ÏÐÈÂÎÄÀ  ", "    ",     0,     30,      0, M_FLST|M_SADR(227),						//91
		"Ñ2.ÃÎÄ ÈÇÃÎÒÎÂË ", "    ",     0,     99,     16, M_FACT|M_RMAX(1),						//92
		"Ñ3.ÇÀÂÎÄ ÍÎÌÅÐ  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),						//93
		"Ñ4.ÌÀÊÑ ÌÎÌÅÍÒ  ", "ÊÍ*Ì",    10,   6000,     10, M_FACT|M_RMAX(3)|M_PREC(2),				//94
		"Ñ5.ÍÎÌÈÍÀËÜÍ ÒÎÊ", "A   ",     1,   1200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//95
		"Ñ6.ÊÏ ÐÅÄÓÊÒÎÐÀ ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),				//96
		"C7.ÁÊÏ91        ", "    ",     0,      1,      0, M_FACT|M_RMAX(4),						//97
		"C8.ÒÝÊ_ÇÀÙ_ÇÀÙ  ", "    ",     0,  	1,      0, M_FACT|M_RMAX(4),						//98
		"Ñ9.ÄÀÒ× ÕÎËËÀ   ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),						//99
		"C10.ÏÎÄÂÅÐÑÈß ÏÎ", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//100
		"C11.ÖÈÊËÛ ÏÐÎÃÎÍ", "    ",     0,     50,      0, MT_DEC|M_PWP2|M_RMAX(1),					//101
		"   C12.ÐÅÇÅÐÂ   ", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//102
		"Ñ13.ÐÀÑÑÒ ÌÓÔÒÛ ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),						//103
		"C14.ÒÈÏ ÄÀÒ× ÏÎË", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//104
		"   C15.ÐÅÇÅÐÂ   ", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//105
		"C16.ÏÎ ÓÌÎË×ÀÍÈÞ", "    ",     0,      1,      0, M_FCOMM|M_SADR(155),						//106
		"C17.Ï ÑÂßÇ ÁÊÏ  ", "    ",     0,    120,     30, M_FACT|M_RMAX(4),						//107
		"Ñ18.ÌÁ ÏÀÓÇ ÑÒÐ ", "    ", 	0,    100,     30, M_FACT|M_RMAX(2)|M_PREC(1),				//108
		"Ñ19.ÂÐÅÌß ÏÀÓÇÛ ", "    ",     1,    500,      2, M_FACT|M_RMAX(2)|M_PREC(1),				//109
		"Ñ20.ÂÐÅÌß ÒÎÐÌÎÆ", "    ",     0,    500,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//110
		"Ñ21.ÂÐÅÌß Ä ÒÎÐÌ", "    ", 	0,   2000,    100, M_FACT|M_RMAX(2)|M_PREC(2),				//111
		"Ñ22.ÇÎÍÀ ÒÎÐÌÎÆ ", "    ",-32000U,  32000,      0, M_FACT|M_RMAX(4),						//112
		"C24.ÓÏÐ ÒÎÐÌ ÁÊÏ", "    ",      0,  	 1,      0, M_FACT|M_RMAX(4),						//113
		"   C24.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//114
		"   C25.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//115
		"   C26.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//116
		"   C27.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//117
		"   C28.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//118
		"   C29.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//119
		"   C30.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//120
		"   C31.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//121
		"C32.Ñ×ÅÒ ÎÁÐÛ ÑÂ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//122   Ñ÷åò÷èê îáðûâîâ ñâÿçè ìåæäó ÁÊÏ ÁÊÝÏ (ðåàëüíûõ à íå ïî àâàðèè)
		"C33.ÂÐ ÐÓ× ÑÒÎÏ ", "    ",      2,     30,     10, M_FACT|M_RMAX(4)|M_PREC(1),				//123   Òðåáîâàíèå Îáðèåâà ïî ðàçìûêàíèþ ÊÂÎ ÊÂÇ 04.12.19
		"C34.ÁÊÏ Â ÑÂß ÄÂ", "    ",      0,   1000,      3, M_FACT|M_RMAX(4)|M_PREC(1),				//124   Ðåøåíèå ïðîáëåì îáðûâà ñâÿçè, â äâèæåíèè 02.12.19
		"Ñ35.ÊÎÐÐ ÒÅÌÏÅÐ ", "ÃÐÀÄ",  -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),				//125
		"C36.ÁÊÏ ÂÐÅÌ ÑÂß", "    ",      0,   1000,    100, M_FACT|M_RMAX(4)|M_PREC(1),				//126   Ðåøåíèå ïðîáëåì îáðûâà ñâÿçè, â ïðîñòîå 02.12.19
		"C37.ÌÀÑØÒÀÁ ÒÎÊÀ", "    ",      0,      1,      0, M_FACT|M_RMAX(4),						//127
		" Ñ38.ÊÎÐ ÒÎÊÀ U ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//128
		" Ñ39.ÊÎÐ ÒÎÊÀ V ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//129
		" Ñ40.ÊÎÐ ÒÎÊÀ W ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//130
		"Ñ41.ÑÌÅÙ ÒÎÊÀ U ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//131
		"Ñ42.ÑÌÅÙ ÒÎÊÀ V ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//132
		"Ñ43.ÑÌÅÙ ÒÎÊÀ W ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//133
		" Ñ44.ÊÎÐ ÍÀÏÐ R ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//134
		" Ñ45.ÊÎÐ ÍÀÏÐ S ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//135
		" Ñ46.ÊÎÐ ÍÀÏÐ T ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//136
		"Ñ47.ÑÌÅÙ ÍÀÏÐ R ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//137
		"Ñ48.ÑÌÅÙ ÍÀÏÐ S ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//138
		"Ñ49.ÑÌÅÙ ÍÀÏÐ T ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//139
		"Ñ50.ÏÎÑÒ.ÂÐ.ÑÈÍ ", "MÊC ",      0,    100,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//140
		"Ñ51.ÏÎÑÒ.ÂÐ.RMS ", "MÊC ",      0,    100,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//141
		"Ñ52.ÊÎÐÐÅÊÒ ÖÀÏ ", "    ",      0,  65530,   3500, M_FACT|M_RMAX(4),						//142
		"Ñ53.ÑÌÅÙ ÖÀÏ    ", "    ",      0,  65530,    683, M_FACT|M_RMAX(4),						//143 !!! 683
		"C54.ÇÀÙ ÌÀÊÑ U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//144
		"C55.Ó ÌÀÊÑ U 47%", "B   ",    220,    600,    312, M_FACT|M_RMAX(2),						//145 318
		"C56.T ÌÀÊÑ U 47%", "C   ",      1,    200,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//146	20
		"Ñ57.ÓÐÎÂ ÌÀÊÑ U ", "B   ",    220,    335,    265, M_FACT|M_RMAX(2),						//147
		"Ñ58.ÂÐ ÌÀÊÑ U Í ", "C   ",      1,    200,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//148
		"Ñ59.ÂÐÅÌ ÌÀÊÑ U ", "C   ",      1,    250,    220, M_FACT|M_RMAX(2)|M_PREC(1),				//149
		"C60.ÇÀÙ ÌÈÍ U   ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//150
		"Ñ61.ÓÐÎÂ ÌÈÍ U  ", "B   ",     90,    220,    115, M_FACT|M_RMAX(2),						//151
		"Ñ62.ÂÐ ÌÈÍ U Í  ", "C   ",      1,    200,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//152	// PIA 31.01.2020 ÷òî áû íå ìîðãàëà íåèñïð ïðè îáðûâå
		"Ñ63.ÂÐÅÌ ÌÈÍ U  ", "C   ",      1,    250,    220, M_FACT|M_RMAX(2)|M_PREC(1),				//153
		"   C64.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//154
		"   C65.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//155
		"   C66.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//156
		"C67.ÇÀÙ ÓÌÅÍ U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//157
		"Ñ68.ÓÐÎÂ ÓÌÅÍ U ", "Â   ",      0,    110,     60, M_FACT|M_RMAX(2),						//158
		"C69.ÎÁÐ ÔÀÇ ÄÂÈÆ", "    ",     10,    500,    195, M_FACT|M_RMAX(2),						//159
		"Ñ70.ÂÐÅÌ ÓÌÅÍ U ", "C   ",      1,    250,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//160
		"   C71.ÐÅÇÐÂ    ", "    ",      0,  65535,      0, M_FACT|M_RMAX(4),						//161
		"C72.ÇÀÙ ÓÌÅÍ I  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//162
		"C73.ÓÐÎÂ ÓÌÅÍ I ", "%   ",     20,    500,    150, M_FACT|M_RMAX(2)|M_PREC(1),				//163
		"C74.ÂÐÅÌ ÓÌÅÍ I ", "C   ",      1,    100,      7, M_FACT|M_RMAX(1)|M_PREC(1),				//164
		"C75.ÂÐ-ÒÎÊ ÇÀÙ  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//165
		"   C76.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//166
		"   C77.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//167
		"   C78.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//168
		"   C79.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//169
		"   C80.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//170
		"   C81.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//171
		"   C82.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//172
		"   C83.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//173
		"   C84.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//174
		"   C85.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//175
		"   C86.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//176
		"   C87.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//177
		"C88.ÇÀÙÈÒÀ ÎÒ ÊÇ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//178
		"Ñ89.ÂÅÐÕ ÓÐ ÊÇ  ", "    ",      0,  65530,  45000, M_FACT|M_RMAX(4),						//179
		"Ñ90. ÍÈÆÍ ÓÐ ÊÇ ", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//180
		"Ñ91.ÈÍÄÈÊ ÊÀËÈÁÐ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//181
		"C92.ÈÍÄ ÀÂÀ ÓÑÒÐ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//182
		"C93.ÏÅÐÅÃ/ÏÅÐÅÎÕ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//183
		"   C94.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//184
		"   C95.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//185
		"   C96.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//186
		"Ñ97.ÓÐ ÂÊË ÒÅÍÀ ", "ÃÐÀÄ",   -40U,     10,     10, M_FACT|M_SIGN|M_RMAX(2),				//187
		"Ñ98.ÓÐ ÂÛÊË ÒÅÍ ", "ÃÐÀÄ",   -20U,     50,     30, M_FACT|M_SIGN|M_RMAX(2),				//188
		"Ñ99.ÐÅÇÅÐÂ      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//189
		"Ñ100.ÐÅÇÅÐÂ     ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//190
		"Ñ101.ÐÅÇÅÐÂ     ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//191
		"C102.×ÅÐ ÔÀÇ ÄÂÈ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//192
		"Ñ103.ÂÐ ×ÅÐ ÔÀÇ ", "Ñ   ",      1,    600,     15, M_FACT|M_RMAX(2)|M_PREC(1),				//193
		"Ñ104.ÐÀÑ ×ÅÐ ÔÀÇ", "    ",      0,     75,      3, M_FACT|M_RMAX(1),						//194
		"Ñ105.ÍÅÈÑÏ ÌÓ/ÄÓ", "    ",     0,       1,      1, M_FLST|M_SADR(153),						//195
		"Ñ106.ÐÅÇÅÐÂ     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//196
		"Ñ107.ÐÅÇÅÐÂ     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//197
		"C108.ÊÎÐ ÇÀ 30% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//198
		"Ñ109.ÊÎÐ ÇÀ 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//199
		"Ñ110.ÊÎÐ ÇÀ 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//200
		"Ñ111.ÊÎÐ ÇÀ 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//201
		"Ñ112.ÊÎÐ ÇÀ 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//202
		"C113.ÊÎÐ ÎÒ 30% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//203
		"Ñ114.ÊÎÐ ÎÒ 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//204
		"Ñ115.ÊÎÐ ÎÒ 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//205
		"Ñ116.ÊÎÐ ÎÒ 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//206
		"Ñ117.ÊÎÐ ÎÒ 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//207
		"C118.ÐÅÇÅÐÂ     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//208
		"Ñ119.ÊÀË ÒÓ ÎÔÑÅ", "    ",      0,      1,      0, M_FDCOM|M_RMAX(1),				        //209
		"ÒÓ 220 ÂÊË      ", "    ",      0,  65530,    140, M_FACT|M_RMAX(4),						//210
		"ÒÓ 220 ÂÛÊË     ", "    ",      0,  65530,     80, M_FACT|M_RMAX(4),						//211
		"ÒÓ 24 ÂÊË       ", "    ",      0,  65530,     18, M_FACT|M_RMAX(4),						//212
		"ÒÓ 24 ÂÛÊË      ", "    ",      0,  65530,      8, M_FACT|M_RMAX(4),						//213
		"ÒÓ ÎÒÊÐ ÊÎÐ U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//214
		"ÒÓ ÎÒÊÐ ÊÎÐ U24 ", "    ",      0,  65530,     75, M_FACT|M_RMAX(4),						//215
		"ÒÓ ÎÒÊÐ ÑÌÅÙ U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//216
		"ÒÓ ÇÀÊÐ ÊÎÐ U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//217
		"ÒÓ ÇÀÊÐ ÊÎÐ U24 ", "    ",      0,  65530,     79, M_FACT|M_RMAX(4),						//218
		"ÒÓ ÇÀÊÐ ÑÌÅÙ U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//219
		"ÒÓ ÑÒÎÏ Î Ê U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//220
		"ÒÓ ÑÒÎÏ Î Ê U24 ", "    ",      0,  65530,     76, M_FACT|M_RMAX(4),						//221
		"ÒÓ ÑÒÎÏ Î ÑÌÅÙ U", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//222
		"ÒÓ ÑÒÎÏ Ç Ê U220", "    ",      0,  65530,   1570, M_FACT|M_RMAX(4),						//223
		"ÒÓ ÑÒÎÏ Ç Ê U220", "    ",      0,  65530,     78, M_FACT|M_RMAX(4),						//224
		"ÒÓ ÑÒÎÏ Ç Ê U220", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//225
		"ÒÓ ÌÓ   ÊÎÐ U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//226
		"ÒÓ ÌÓ   ÊÎÐ U24 ", "    ",      0,  65530,     79, M_FACT|M_RMAX(4),						//227
		"ÒÓ ÌÓ   ÑÌÅÙ U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//228
		"ÒÓ ÄÓ   ÊÎÐ U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//229
		"ÒÓ ÄÓ   ÊÎÐ U24 ", "    ",      0,  65530,     77, M_FACT|M_RMAX(4),						//230
		"ÒÓ ÄÓ   ÑÌÅÙ U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//231
		"ÒÓ ÑÁÀÂ ÊÎÐ U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//232
		"ÒÓ ÑÁÀÂ ÊÎÐ U24 ", "    ",      0,  65530,     74, M_FACT|M_RMAX(4),						//233
		"ÒÓ ÑÁÀÂ ÑÌÅÙ U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//234
		"Ñ145.ÒÓ ÊÀËÈÁ   ", "    ",      0,      1,      0, M_FDCOM|M_RMAX(1),						//235
		"Ñ146.ÒÓ ÎÒÊÐ    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//236
		"Ñ147.ÒÓ ÇÀÊÐ    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//237
		"Ñ148.ÒÓ ÑÒÎÏÎÒÊÐ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//238
		"Ñ149.ÒÓ ÑÒÎÏÇÀÊÐ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//239
		"Ñ150.ÒÓ ÌÓ      ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//240
		"Ñ151.ÒÓ ÄÓ      ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//241
		"Ñ152.ÒÓ ÑÁÐÎÑÇÀ ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//242
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//243
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//244
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//245
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//246
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//247
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//248
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//249
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//250
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//251
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//252
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//253
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//254
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//255
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//256
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//257
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//258
		"   Ñ119.ÐÅÇÅÐÂ  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//259
		//------------------------------------------------------------------
		"D0.ÇÀÄÀÍÈÅ ÇÀÊÐ ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//0 260
		"D1.ÇÀÄÀÍÈÅ ÎÒÊÐ ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//1 261
		"D2.ÎÁÎÐ ÍÀ ÎÒÊÐ ", "ÎÁ  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//2 262
		"D3.ÎÁÎÐ ÍÀ ÇÀÊÐ ", "ÎÁ  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//3 263
		"  D4.ÐÅÇÅÐÂ     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//4 264
		"D5.ÑÁÐÎÑ ÊÀËÈÁÐ ", "    ",      0,      1,      0, M_COMM|M_SADR(158),						//5 265
		"D6.ÊÎÌÀÍÄ ÓÏÐÀÂË", "    ",      0,     19,      0, M_COMM|M_SADR(160),						//6 266
		" D7.ÑÁÐÎÑ ÇÀÙÈÒ ", "    ",      0,      1,      0, M_COMM|M_SADR(160),						//7 267
		" D8.ÏÎ ÓÌÎË×ÀÍÈÞ", "    ",      0,      1,      0, M_COMM|M_SADR(155),						//8 268
		"   D9.ÐÅÇÅÐÂ    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),						//9 269
		"D10.ÑÁÐÎÑ ÖÈÊËÎÂ", "    ",      0,      1,     0, M_COMM|M_SADR(160),						//10 270
		"D11.ÑÁÐÎÑ ÑÂßÇÈ ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),						//11 271
		"   D12.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//12 272
		"   D13.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//13 273
		"   D14.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//14 274
		"   D15.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//15 275
		"   D16.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//16 276
		"   D17.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//17 277
		"   D18.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//18 278
		"   D19.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//19 279
		//-------------------------------------------------------------------
		"G0.ÐÅÆÈÌ ÒÅÑÒÀ  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),						//0 280
		"G1.ÒÅÑÒ ÑÂÅÒÎÄ  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//1 281
		"G2.ÒÅÑÒ ÄÈÑ ÂÛÕ ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//2 282
		"G3.ÇÍÀ×ÅÍÈÅ ÖÀÏ ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),			//3 283
		"G4.ÑÒÀÐÒ ÄÈÑÏË  ", "    ",      0,      1,      0, M_FDCOM,								//4 284
		"G5.TECT Ñ ÊÀÌÅÐÛ", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),						//5 285
		"G6.ÒÅÑÒ ÊÎÍÒÀÊÒÎ", "    ",      0,      3,      0, M_FACT|M_RMAX(4),						//6 286
		"   G7.ÐÅÇÅÐÂ    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//7 287
		"   G8.ÐÅÇÅÐÂ    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//8 288
		"   G9.ÐÅÇÅÐÂ    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//9 289
		"   G10.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//10 290
		"   G11.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//11 291
		"   G12.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//12 292
		"   G13.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//13 293
		"   G14.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//14 294
		"   G15.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//15 295
		"   G16.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//16 296
		"   G17.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//17 297
		"   G18.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//18 298
		"G19.ÒÅÑÒ ÒÓ ÂÕÎÄ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//19 299
		"G20.ÒÅÑÒ ÒÓ ÂÛÕ.", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//20 300
		"G21.ÀÊÒÂ ÒÅÑÒ ÒÓ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//21 301
		"   G22.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//22 302
		"   G23.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//23 303
		"   G24.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//24 304
		"   G25.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//25 305
		"   G26.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//26 306
		"   G27.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//27 307
		"   G28.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//28 308
		"   G29.ÐÅÇÅÐÂ   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//29 309
		//-------------------------------------------------------------------
		"ÑÎÑÒÎßÍÈÅ ÊÀËÈÁÐ", "    ",      0,      3,      0, M_HIDE,							//0 310
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//1 311
		"ÏÎËÎÆ ÇÀÊÐÛÒÎ 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//2 312
		"ÏÎËÎÆ ÇÀÊÐÛÒÎ 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//3 313
		"ÏÎËÎÆ ÎÒÊÐÛÒÎ 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//4 314
		"ÏÎËÎÆ ÇÀÊÐÛÒÎ 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//5 315
		"    ÏÀÐÎËÜ 1    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//6 316
		"    ÏÀÐÎËÜ 2    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//7 317
		"   ÀÂÀÐÈÈ ÊÇ    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//8 318
		"ÇÀÏÈÑÜ ÌÓÔÒÛ    ", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//9 319
		"Í10.Ñ×ÅÒ×ÈÊ ÖÈÊË", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//10 320
		"ÇÀÏÈÑÜ ÒÅÌÏ ÁÊÏ ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//11 321
		"   2.ÐÅÇÅÐÂ     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//12 322
		"H13.ÒÈÏ ÁÊÏ     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//13 323
		"   H14.ÄÀÒÀ     ", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//14 324
		//"   2.ÐÅÇÅÐÂ     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//15 325
		"  ÒÎÊ ÏÅÐÅÕÎÄÀ  ", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//16 326
		" ÌÎÌÅÍÒ ÒÎÊ 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//17 327
		" ÌÎÌÅÍÒ ÒÎÊ 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//18 328
		" ÌÎÌÅÍÒ ÒÎÊ 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//19 329
		" ÌÎÌÅÍÒ ÒÎÊ 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//20 330
		" ÌÎÌÅÍÒ ÒÎÊ 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//21 331
		" ÌÎÌÅÍÒ ÒÎÊ 0_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//22 332
		" ÌÎÌÅÍÒ ÒÎÊ 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//23 333
		" ÌÎÌÅÍÒ ÒÎÊ 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//24 334
		" ÌÎÌÅÍÒ ÒÎÊ 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//25 335
		" ÌÎÌÅÍÒ ÒÎÊ 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//26 336
		" ÌÎÌÅÍÒ ÒÎÊ 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//27 337
		" ÌÎÌÅÍÒ ÒÎÊ 1_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//28 338
		" ÌÎÌÅÍÒ ÒÎÊ 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//29 339
		" ÌÎÌÅÍÒ ÒÎÊ 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//30 340
		" ÌÎÌÅÍÒ ÒÎÊ 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//31 341
		" ÌÎÌÅÍÒ ÒÎÊ 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//32 342
		" ÌÎÌÅÍÒ ÒÎÊ 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//33 343
		" ÌÎÌÅÍÒ ÒÎÊ 2_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//34 344
		" ÌÎÌÅÍÒ ÒÎÊ 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//35 345
		" ÌÎÌÅÍÒ ÒÎÊ 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//36 346
		" ÌÎÌÅÍÒ ÒÎÊ 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//37 347
		" ÌÎÌÅÍÒ ÒÎÊ 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//38 348
		" ÌÎÌÅÍÒ ÒÎÊ 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//39 349
		" ÌÎÌÅÍÒ ÒÎÊ 3_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//40 350
		"ÌÎÌÅÍÒ ÓÃÎË 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//41 351
		"ÌÎÌÅÍÒ ÓÃÎË 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//42 352
		"ÌÎÌÅÍÒ ÓÃÎË 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//43 353
		"ÌÎÌÅÍÒ ÓÃÎË 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//44 354
		"ÌÎÌÅÍÒ ÓÃÎË 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//45 355
		"ÌÎÌÅÍÒ ÓÃÎË 0_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//46 356
		"ÌÎÌÅÍÒ ÓÃÎË 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//47 357
		"ÌÎÌÅÍÒ ÓÃÎË 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//48 358
		"ÌÎÌÅÍÒ ÓÃÎË 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//49 359
		"ÌÎÌÅÍÒ ÓÃÎË 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//50 360
		"ÌÎÌÅÍÒ ÓÃÎË 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//51 361
		"ÌÎÌÅÍÒ ÓÃÎË 1_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//52 362
		"ÌÎÌÅÍÒ ÓÃÎË 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//53 363
		"ÌÎÌÅÍÒ ÓÃÎË 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//54 364
		"ÌÎÌÅÍÒ ÓÃÎË 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//55 365
		"ÌÎÌÅÍÒ ÓÃÎË 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//56 366
		"ÌÎÌÅÍÒ ÓÃÎË 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//57 367
		"ÌÎÌÅÍÒ ÓÃÎË 2_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//58 368
		"ÌÎÌÅÍÒ ÓÃÎË 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//59 369
		"ÌÎÌÅÍÒ ÓÃÎË 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//60 370
		"ÌÎÌÅÍÒ ÓÃÎË 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//61 371
		"ÌÎÌÅÍÒ ÓÃÎË 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//62 372
		"ÌÎÌÅÍÒ ÓÃÎË 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//63 373
		"ÌÎÌÅÍÒ ÓÃÎË 3_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//64 374
		" ÓÃÎË ÑÈÔÓ 0_0  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//65 375
		" ÓÃÎË ÑÈÔÓ 0_1  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//66 376
		" ÓÃÎË ÑÈÔÓ 0_2  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//67 377
		" ÓÃÎË ÑÈÔÓ 0_3  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//68 378
		" ÓÃÎË ÑÈÔÓ 0_4  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//69 379
		" ÓÃÎË ÑÈÔÓ 0_5  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//70 380
		" ÓÃÎË ÑÈÔÓ 1_0  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//71 381
		" ÓÃÎË ÑÈÔÓ 1_1  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//72 382
		" ÓÃÎË ÑÈÔÓ 1_2  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//73 383
		" ÓÃÎË ÑÈÔÓ 1_3  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//74 384
		" ÓÃÎË ÑÈÔÓ 1_4  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//75 385
		" ÓÃÎË ÑÈÔÓ 1_5  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//76 386
		" ÓÃÎË ÑÈÔÓ 2_0  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//77 387
		" ÓÃÎË ÑÈÔÓ 2_1  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//78 388
		" ÓÃÎË ÑÈÔÓ 2_2  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//79 389
		" ÓÃÎË ÑÈÔÓ 2_3  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//80 390
		" ÓÃÎË ÑÈÔÓ 2_4  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//81 391
		" ÓÃÎË ÑÈÔÓ 2_5  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//82 392
		" ÓÃÎË ÑÈÔÓ 3_0  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//83 393
		" ÓÃÎË ÑÈÔÓ 3_1  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//84 394
		" ÓÃÎË ÑÈÔÓ 3_2  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//85 395
		" ÓÃÎË ÑÈÔÓ 3_3  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//86 396
		" ÓÃÎË ÑÈÔÓ 3_4  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//87 397
		" ÓÃÎË ÑÈÔÓ 3_5  ", "ÃÐÀÄ",      0,    180,      0, M_HIDE|M_RMAX(2),						//88 398
		"ÊÎÌÀÍÄÛ ÒÓ      ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//89 399
		"ÑÐÅÄÍÅÅ ÍÀÏÐ    ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//90 400
		"85.ÒÅÌÏÅÐÀÒ ÁÊÏ ", "ÃÐÀÄ",  -100U,    100,      0, M_HIDE|M_RMAX(2),						//91 401
		"ÑÐÅÄÍÈÉ ÒÎÊ %   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//92 402
		"  ÒÎÊ ÔÀÇÛ U %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//93 403
		"  ÒÎÊ ÔÀÇÛ V %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//94 404
		"  ÒÎÊ ÔÀÇÛ W %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//95 405
		" ÑÐÅÄÍÈÉ ÒÎÊ    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//96 406
		"  ÏÎËÎÆÅÍÈÅ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//97 407
		"  ÏÎËÎÆÅÍÈÅ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//98 408
		"     ÏÎËÍ ÕÎÄ   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//99 409
		"     ÏÎËÍ ÕÎÄ   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//100 410
		" ÒÈÏ ÐÅÂÅÐÑÀ    ", "    ",      0,      2,      2, M_HIDE|M_RMAX(2),						//101 411
		"ÏËÎÕÈÅ ÇÀÄ 2 ÊÃÖ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//102 412
		"ÏËÎÕÈÅ ÇÀÄ 200ÃÖ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//103 413
		"ÏËÎÕÈÅ ÇÀÄ 50ÃÖ1", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//104 414
		"ÏËÎÕÈÅ ÇÀÄ 50ÃÖ2", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//105 415
		"ÏËÎÕÈÅ ÇÀÄ 50ÃÖ3", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//106 416
		"ÏËÎÕÈÅ ÇÀÄ 10 ÃÖ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//107 417
		"ÑÁÐÎÑ ÏËÎÕÈÕ ÇÀÄ", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//108 418
		"ÂÐÅÌß ÏÐÎÖÅÑÑÎÐÍ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//109 419
		"ÍÎÌÅÐ ÑÏÈÑÊÀ ÇÀÄ", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//110 420
		"  ÍÎÌÅÐ ÇÀÄÀ×È  ", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//111 421
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//112 408
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//113 408
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//114 408
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//115 408
		"     ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//116 408
		"ÍÀ× ÀÄÐ ÆÓÐÍ ÑÎÁ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//117 427
		"ÍÀ× ÀÄÐ ÆÓÐÍ ÊÎÌ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//118 428
		"ÍÀ× ÀÄÐ ÆÓÐÍ ÏÀÐ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//119 429
		"ÍÀ× ÀÄÐ ÆÓÐÍ ÑÈÌ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//123 433
		"ÇÀÏÈÑÈ ÆÓÐÍ ÑÎÁ ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//120 430
		"ÇÀÏÈÑÈ ÆÓÐÍ ÊÎÌ ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//121 431
		"ÇÀÏÈÑÈ ÆÓÐÍ ÏÀÐ ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//122 432
		"ÇÀÏÈÑÈ ÆÓÐÍ ÑÈÌ ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//124 434
		"    ÑÅÊÓÍÄÛ     ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),						//125 435
		"ÓÏÐ ÊÎÍÒÀÊÒÎÐÀÌÈ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//126 436
		"  ÊÎÌÀÍÄÛ ÁÓÐ   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//127 437
		" ÑÁÐÎÑ ÆÓÐÍÀËÎÂ ", "    ",      0,  1,          0, MT_DEC|M_RMAX(4),						//128 438
		"Í129.ÈÍÄÈÊ ÁÊÏ  ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//129 439
		"130 ÏÎËÎÆÅÍ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//130 440
		"131. ÇÎÍÀ ÑÌÅÙÅÍ", "    ",      0,  65530,      0, MT_DEC|M_RMAX(4),						//131 441
		"3    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//132 442
		"4    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//133 443
		"5    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//134 444
		"6    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//135 445
		"7    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//136 446
		"8    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//137 447
		"9    ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//138 448
		"10   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//139 449
		"11   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//140 450
		"12   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//141 451
		"13   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//142 452
		"14   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//143 453
		"15   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//144 454
		"16   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//145 455
		"17   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//146 456
		"18   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//147 457
		"19   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//148 458
		"20   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//149 459
		"21   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//150 460
		"22   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//151 461
		"23   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//152 462
		"24   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//153 463
		"25   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//154 464
		"26   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//155 465
		"27   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//156 466
		"28   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//157 467
		"29   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//158 468
		"30   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//159 469
		"31   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//160 470
		"32   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//161 471
		"33   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//162 472
		"34   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//163 473
		"35   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//164 474
		"36   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//165 475
		"37   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//166 476
		"38   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//167 477
		"39   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//168 478
		"40   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//169 479
		"41   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//170 480
		"42   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//171 481
		"43   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//172 482
		"44   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//173 483
		"45   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//174 484
		"46   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//175 485
		"47   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//176 486
		"48   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//177 487
		"49   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//178 488
		"50   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//179 489
		"51   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//180 490
		"52   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//181 491
		"53   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//182 492
		"54   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//183 493
		"55   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//184 494
		"56   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//185 495
		"57   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//186 496
		"58   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//187 497
		"59   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//188 498
		"60   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//189 499
		"60   ÐÅÇÅÐÂ     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
		//------------------------------------------------------------------------------------------------
		"À0.ÑÒÀÒÓÑ ÐÀÁÎÒÛ", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),						//0 500
		"À1.ÄÈÀÃ ÏÐÎÖÅÑÑÀ", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),						//1 501
		"À2.ÄÈÀÃÍÎÑÒ ÑÅÒÈ", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),						//2 502
		"À3.ÄÈÀÃ ÍÀÃÐÓÇÊÈ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),						//3 503
		"À4.ÄÈÀÃÍ ÓÑÒÐ-ÂÀ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),						//4 504
		" À5.ÑÎÑÒ ÂÕÎÄÎÂ ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),						//5 505
		" À6.ÑÎÑÒ ÂÛÕÎÄÎÂ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),						//6 506
		"  À7.ÏÎËÎÆÅÍÈÅ  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7 507
		"   À8.ÌÎÌÅÍÒ    ", "Í*Ì ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//8 508
		"   À9.ÑÊÎÐÎÑÒÜ  ", "ÎÁ/Ì",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),					//9 509
		"À10.ÍÀÏÐ ÔÀÇÛ R ", "Â   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//10 510
		"À11.ÍÀÏÐ ÔÀÇÛ S ", "Â   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//11 511
		"À12.ÍÀÏÐ ÔÀÇÛ T ", "Â   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//12 512
		" À13.ÒÎÊ ÔÀÇÛ U ", "À/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//13 513
		" À14.ÒÎÊ ÔÀÇÛ V ", "À/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//14 514
		" À15.ÒÎÊ ÔÀÇÛ W ", "À/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//15 515
		"À16.ÓÃÎË ÍÀÃÐÓÇ ", "ÃÐÀÄ", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),					//16 516
		"À17.ÑÒÀÒÓÑ ÊÀËÈÁ", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),						//17 517
		"A18.ÏÎËÎÆÅÍÈÅ % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//18 518
		" À19.ÏÎËÍÛÉ ÕÎÄ ", "ÎÁ  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),				//19 519
		"À20.ÒÅÊÓÙÈÉ ÕÎÄ ", "ÎÁ  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//20 520
		"À21.Ñ×ÅÒ ÖÈÊËÎÂ ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//21 521
		"À22.ÒÅÌÏÅÐÀÒÓÐÀ ", "ÃÐÀÄ", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//22 522
		"À23.ÒÅÌÏÅÐ ÁÊÏ  ", "ÃÐÀÄ", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//23 523
		"À24.ÂÅÐÑÈß ÏÎ   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),				//24 524
		"À25.ÂÅÐÑÈß ÏÎÁÊÏ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(2),				//25 525
		"À26.ÏÀÄÅÍ ÍÀÏÐ  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//26 526
		"À27.ÊÎË.ÑÁÎÅÂ ÄÏ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//27 527
		"À28.ÒÅÌÏÅÐ ÝÄÁÊÏ", "ÃÐÀÄ", -300U,    300,      0, M_SHOW|M_SIGN|M_RMAX(2),					//28 528
		"À29.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//29 529
		"À30.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//30 530
		"À31.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//31 531
		"À32.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//32 532
		"À33.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//33 533
		"À34.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//34 534
		"À35.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//35 535
		"À36.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//36 536
		"À37.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//37 537
		"À38.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//38 538
		"À39.ÐÅÇÅÐÂ      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//39 539
		//--------------------------------------------------------------------------------------------------
		"ATS1.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//0 540
		"ATS2.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//1 541
		"ATS3.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//2 542
		"ATS4.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//3 543
		"ATS5.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//4 544
		"ATS6.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//5 545
		"ATS7.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//6 546
		"ATS8.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7 547
		"ATS9.ÐÅÇÅÐÂ     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//8 548
		"ATS10.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//9 549
		"ATS11.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//10 550
		"ATS12.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//11 551
		"ATS13.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//12 552
		"ATS14.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//13 553
		"ATS15.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//14 554
		"ATS16.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//15 555
		"ATS17.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//16 556
		"ATS18.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//17 557
		"ATS19.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//18 558
		"ATS20.ÐÅÇÅÐÂ    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//19 559
		//--------------------------------------------------------------------------------------------------
		"     ÂÐÅÌß      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,							//T
		"      ÄÀÒÀ      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,							//D
		"E0.ÑÒÀÒÓÑ ÐÀÁÎÒÛ", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),						//0
		"E1.ÄÈÀÃÍ ÏÐÎÖÅÑÑ", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),						//1
		"E2.ÄÈÀÃÍÎÑÒ ÑÅÒÈ", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),						//2
		"E3.ÄÈÀÃÍ ÍÀÃÐÓÇÊ", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),						//3
		"E4.ÄÈÀÃÍ ÓÑÒÐ-ÂÀ", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),						//4
		"E5.ÏÎËÎÆÅÍÈÅ %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//5
		"    E6.ÌÎÌÅÍÒ   ", "Í*Ì ",     10,  11000,     10, M_SHOW|M_RMAX(4),						//6
		"E7.ÍÀÏÐßÆ ÔÀÇÛ R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//7
		"E8.ÍÀÏÐßÆ ÔÀÇÛ S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//8
		"E9.ÍÀÏÐßÆ ÔÀÇÛ T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//9
		"E10.ÒÎÊ ÔÀÇÛ U  ", "À/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//10
		"E11.ÒÎÊ ÔÀÇÛ V  ", "À/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//11
		"E12.ÒÎÊ ÔÀÇÛ W  ", "À/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//12
		"E13.ÒÅÌÏÅÐ ÁËÎÊ ", "ÃÐÀÄ",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),				//13
		"E14.ÑÎÑÒ ÂÕÎÄÎÂ ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),						//14
		"E15.ÑÎÑÒ ÂÛÕÎÄÎÂ", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),						//15
		"   E16.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//16
		"   E17.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//17
		"   E18.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//18
		"   E19.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//19
		"   E20.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//20
		"   E21.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//21
		"   E22.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//22
		"   E23.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//23
		"   E24.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//24
		"   E25.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//25
		"   E26.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//26
		"   E27.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//27
		"   E28.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//28
		"   E29.ÐÅÇÅÐÂ   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)						//29
};

const struct MENU_STRING values[] = {
	"    ÇÀÏÈÑÜ      ",	// 0
//----------------
	"  ÍÅ ÎÏÐÅÄÅËÅÍ  ",	// 1
	"      ÑÒÎÏ      ",	// 2
	"     ÀÂÀÐÈß     ",	// 3
	" ÈÄÅÒ ÇÀÊÐÛÒÈÅ  ",	// 4
	" ÈÄÅÒ ÎÒÊÐÛÒÈÅ  ",	// 5
	"   ÈÄÅÒ ÒÅÑÒ    ",	// 6
	"    ÇÀÊÐÛÒÎ     ",	// 7
	"    ÎÒÊÐÛÒÎ     ",	// 8
	"     ÌÓÔÒÀ      ",	// 9
	" ÌÅÑÒÍÎÅ ÓÏÐÀÂË ",	// 10
	"  ÂÊËÞ×ÅÍ ÒÅÍ   ",	// 11
	"BLUETOOTH ÂÊË   ",	// 12
	"ÀÂÀÐÈß ÍÀ ÁËÎÊÅ ",	// 13
	"  ÀÂÀÐÈß ÍÀ ÒÑ  ",	// 14
	"  ÍÅÈÑÏÐÀÂÍÎÑÒÜ ",	// 15
	"ÍÅÈÑÏÐÀÂÍ ÍÀ ÁËÊ",	// 16
	"ÍÅÈÑÏÐÀÂÍ ÍÀ ÒÑ ",	// 17
//--------------------------
	"   ÍÅÒ ÀÂÀÐÈÉ   ",	// 18
	"  ÍÅÒ ÄÂÈÆÅÍÈß  ",	// 19
	"  ×ÅÐ ÔÀÇ ÄÂÈÃ  ",	// 20
	" ÍÅ ÇÀÄÀÍÎ ÇÀÊÐ ",	// 21
	" ÍÅ ÇÀÄÀÍÎ ÎÒÊÐ ",	// 22
	" ÍÅÒ ÊÀËÈÁÐÎÂÊÈ ",	// 23
	"ÓÏËÎÒÍ ÍÅ ÄÎÑÒÈÃ",	// 24
	"     ÌÓÔÒÀ      ",	// 25
	"  ÍÅÈÑÏÐ ÌÓ/ÄÓ  ",	// 26
	"     ÐÅÇÅÐÂ     ",	// 27
	"     ÐÅÇÅÐÂ     ",	// 28
	"     ÐÅÇÅÐÂ     ",	// 29
	"     ÐÅÇÅÐÂ     ",	// 30
	"     ÐÅÇÅÐÂ     ",	// 31
	"     ÐÅÇÅÐÂ     ",	// 32
	"     ÐÅÇÅÐÂ     ",	// 33
	"     ÐÅÇÅÐÂ     ",	// 34
//--------------------------
	"   ÍÅÒ ÀÂÀÐÈÉ   ",	// 35
	"ÌÈÍ ÍÀÏÐ ÔÀÇÛ R ",	// 36
	"ÌÈÍ ÍÀÏÐ ÔÀÇÛ S ",	// 37
	"ÌÈÍ ÍÀÏÐ ÔÀÇÛ T ",	// 38
	"ÌÀÊÑ ÍÀÏÐ ÔÀÇÛ R",	// 39
	"ÌÀÊÑ ÍÀÏÐ ÔÀÇÛ S",	// 40
	"ÌÀÊÑ ÍÀÏÐ ÔÀÇÛ T",	// 41
	"ÍÅÎÏÐ ×ÅÐÅÄ ÔÀÇ ",	// 42
	"ÍÅÁÀËÀÍÑ/ÎÁÐÛÂ U",	// 43
	"ÓÌÅÍ ÍÀÏÐ ÔÀÇÛ R",	// 44
	"ÓÌÅÍ ÍÀÏÐ ÔÀÇÛ S",	// 45
	"ÓÌÅÍ ÍÀÏÐ ÔÀÇÛ T",	// 46
	"ÍÀÏÐ ÔÀÇÛ R 47% ",	// 47
	"ÍÀÏÐ ÔÀÇÛ S 47% ",	// 48
	"ÍÀÏÐ ÔÀÇÛ T 47% ",	// 49
	"  ×ÅÐ ÔÀÇ ÑÅÒÈ  ",	// 50
	"     ÐÅÇÅÐÂ     ",	// 51
//--------------------------
	"   ÍÅÒ ÀÂÀÐÈÉ   ",	// 52
	"  ÎÁÐÛÂ ÔÀÇÛ U  ",	// 53
	"  ÎÁÐÛÂ ÔÀÇÛ V  ",	// 54
	"  ÎÁÐÛÂ ÔÀÇÛ W  ",	// 55
	"ÂÐ-ÒÎÊ ÏÅÐÅÃÐÓÇÊ",	// 56
	"     ÐÅÇÅÐÂ     ",	// 57
	"   ÊÇ ÔÀÇÛ U    ",	// 58
	"   ÊÇ ÔÀÇÛ V    ",	// 59
	"   ÊÇ ÔÀÇÛ W    ",	// 60
	"     ÐÅÇÅÐÂ     ",	// 61
	"     ÐÅÇÅÐÂ     ",	// 62
	" ÌÈÍÈÌÀËÜÍ ÒÎÊ  ",	// 63
	" ÍÅÁÀËÀÍÑ ÒÎÊÀ  ",	// 64
	"     ÐÅÇÅÐÂ     ",	// 65
	"     ÐÅÇÅÐÂ     ",	// 66
	"     ÐÅÇÅÐÂ     ",	// 67
	"     ÐÅÇÅÐÂ     ",	// 68
	//---------------------------------------------------------------------------
	"   ÍÅÒ ÀÂÀÐÈÉ   ",	// 69
	"ÑÁÎÉ ÄÀÒ× ÏÎËÎÆ ",	// 70
	" ÑÁÎÉ ÏÀÌßÒÈ 1  ",	// 71
	" ÑÁÎÉ ÏÀÌßÒÈ 2  ",	// 72
	"   ÑÁÎÉ ×ÀÑÎÂ   ",	// 73
	"ÑÁÎÉ ÄÀÒ× ÒÅÌÏÅÐ",	// 74
	" ÏÅÐÅÃÐÅÂ ÁÊÏ   ",	// 75
	"ÏÅÐÅÎÕËÀÆÄ ÁÊÏ  ",	// 76
	"ÏÅÐÅÃÐÅÂ ÁÊÄ    ",	// 77
	"ÏÅÐÅÎÕËÀÆÄ ÁÊÄ  ",	// 78
	"ÑÁÎÉ ÖÀÏ        ",	// 79
	"ÂÛÊËÞ×ÅÍÈÅ ÁÊÄ  ",	// 80
	"ÊÐÈÒ ÏÅÐÅÃÐÅÂ ÁË",	// 81
	"     ÐÅÇÅÐÂ     ",	// 82
	"     ÐÅÇÅÐÂ     ",	// 83
	"     ÐÅÇÅÐÂ     ",	// 84
	"     ÐÅÇÅÐÂ     ",	// 85
	//---------------------------------------------------------------------------
	"  ÍÅÒ ÑÈÃÍÀËÎÂ  ",	// 86
	"  ÂÕÎÄ ÎÒÊÐÛÒÜ  ",	// 87
	"  ÂÕÎÄ ÇÀÊÐÛÒÜ  ",	// 88
	"   ÂÕÎÄ ÑÒÎÏ    ",	// 89
	"    ÂÕÎÄ ÌÓ     ",	// 90
	"    ÂÕÎÄ ÄÓ     ",	// 91
	"     ÐÅÇÅÐÂ     ",	// 92
	"     ÐÅÇÅÐÂ     ",	// 93
	"     ÐÅÇÅÐÂ     ",	// 94
	"     ÐÅÇÅÐÂ     ",	// 95
	"     ÐÅÇÅÐÂ     ",	// 96
	"     ÐÅÇÅÐÂ     ",	// 97
	"     ÐÅÇÅÐÂ     ",	// 98
	"     ÐÅÇÅÐÂ     ",	// 99
	"     ÐÅÇÅÐÂ     ",	// 100
	"     ÐÅÇÅÐÂ     ",	// 101
	"     ÐÅÇÅÐÂ     ",	// 102
	//---------------------------------------------------------------------------
	"  ÍÅÒ ÑÈÃÍÀËÎÂ  ",	// 103
	"    ÀÂÀÐÈß      ",	// 104
	"    ÇÀÊÐÛÒÎ     ",	// 105
	"    ÎÒÊÐÛÒÎ     ",	// 106
	"     ÌÓÔÒÀ      ",	// 107
	"  ÇÀÊÐÛÂÀÅÒÑß   ",	// 108
	"  ÎÒÊÐÛÂÀÅÒÑß   ",	// 109
	"     ÌÓ/ÄÓ      ",	// 110
	"  ÍÅÈÑÏÐÀÂÍÎÑÒÜ ",	// 111
	"     ÐÅÇÅÐÂ     ",	// 112
	"     ÐÅÇÅÐÂ     ",	// 113
	"     ÐÅÇÅÐÂ     ",	// 114
	"     ÐÅÇÅÐÂ     ",	// 115
	"     ÐÅÇÅÐÂ     ",	// 116
	"     ÐÅÇÅÐÂ     ",	// 117
	"     ÐÅÇÅÐÂ     ",	// 118
	"     ÐÅÇÅÐÂ     ",	// 119
	//---------------------------------------------------------------------------
	" ÍÅÒ ÊÀËÈÁÐÎÂÊÈ ",	// 120
	" ÇÀÄÀÍÎ ÇÀÊÐÛÒÎ ",	// 121
	" ÇÀÄÀÍÎ ÎÒÊÐÛÒÎ ",	// 122
	"ÊÀËÈÁÐ ÂÛÏÎËÍÅÍÀ",	// 123
	//---------------------------------------------------------------------------
	"    ÊËÈÍÎÂÀß    ",	// 124
	"    ØÈÁÅÐÍÀß    ",	// 125
	//---------------------------------------------------------------------------
	"  ÍÅ ÎÏÐÅÄÅËÅÍ  ",	// 126
	" ÁÅÇ ÓÏËÎÒÍÅÍÈß ",	// 127
	"ÓÏËÎÒÍÅÍÈÅ ÇÀÊÐ ",	// 128
	"ÓÏËÎÒÍÅÍÈÅ ÎÒÊÐ ",	// 129
	"ÓÏË ÇÀÊÐ È ÎÒÊÐ ",	// 130
	//---------------------------------------------------------------------------
	"   ÍÎÐÌÀËÜÍÛÉ   ",	// 131
	"    ÎÁÐÀÒÍÛÉ    ",	// 132
	//---------------------------------------------------------------------------
	"ÄÅÉÑÒÂ ÇÍÀ×ÅÍÈß ",	// 133
	"ÏÐÎÖÅÍÒÛ ÎÒ ÍÎÌ ",	// 134
	//---------------------------------------------------------------------------
	"    ÂÛÊËÞ×ÅÍ    ",	// 135
	"  ÂÛÁÎÐ ÐÅÆÈÌÀ  ",	// 136
	"    ÐÅÆÈÌ ÌÓ    ",	// 137
	"    ÐÅÆÈÌ ÄÓ    ",	// 138
	//---------------------------------------------------------------------------
	" ÂÑÅ ÈÍÒÅÐÔÅÉÑÛ ",	// 139
	"ÒÎËÜÊÎ ÄÈÑÊÐÅÒÍ ",	// 140
	"ÒÎËÜÊÎ ÏÎÑËÅÄÎÂ ",	// 141
	//---------------------------------------------------------------------------
	"   ÂÛÊËÞ×ÅÍÀ    ",	// 142
	"    ÂÊËÞ×ÅÍÀ    ",	// 143
	//---------------------------------------------------------------------------
	"      24Â       ",	// 144
	"      220Â      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 ÁÎÄ    ",	// 146
	"    4800 ÁÎÄ    ",	// 147
	"    9600 ÁÎÄ    ",	// 147
	"   19200 ÁÎÄ    ",	// 149
	"   38400 ÁÎÄ    ",	// 150
	"   57600 ÁÎÄ    ",	// 151
	"   115200 ÁÎÄ   ",	// 152
	//---------------------------------------------------------------------------
	"   ÂÛÊËÞ×ÅÍÀ    ",	// 153
	"ÈÍÄÈÊ È ÎÑÒÀÍÎÂ ",	// 154
	//---------------------------------------------------------------------------
	"  ÍÅÒ ÊÎÌÀÍÄÛ   ",	// 155
	"     ÇÀÄÀÒÜ     ",	// 156
	"    ÑÁÐÎÑÈÒÜ    ",	// 157
	//---------------------------------------------------------------------------
	"  ÍÅÒ ÊÎÌÀÍÄÛ   ",	// 158
	"    ÑÁÐÎÑÈÒÜ    ",	// 159
	//---------------------------------------------------------------------------
	"  ÍÅÒ ÊÎÌÀÍÄÛ   ",	// 160
	"      ÑÒÎÏ      ",	// 161
	"    ÇÀÊÐÛÒÜ     ",	// 162
	"    ÎÒÊÐÛÒÜ     ",	// 163
	"  ÇÀÊÐÛÒÜ ÒÅÑÒ  ",	// 164
	"  ÎÒÊÐÛÒÜ ÒÅÑÒ  ",	// 165
	"     ÐÅÇÅÐÂ     ",	// 166
	"     ÐÅÇÅÐÂ     ",	// 167
	"     ÐÅÇÅÐÂ     ",	// 168
	"     ÐÅÇÅÐÂ     ",	// 169
	"     ÐÅÇÅÐÂ     ",	// 170
	"     ÐÅÇÅÐÂ     ",	// 171
	"     ÐÅÇÅÐÂ     ",	// 172
	"     ÐÅÇÅÐÂ     ",	// 173
	"     ÐÅÇÅÐÂ     ",	// 174
	"     ÐÅÇÅÐÂ     ",	// 175
	"     ÐÅÇÅÐÂ     ",	// 176
	"     ÐÅÇÅÐÂ     ",	// 177
	"     ÐÅÇÅÐÂ     ",	// 178
	"     ÐÅÇÅÐÂ     ",	// 179
	//---------------------------------------------------------------------------
	" ÍÅ ÎÏÐÅÄÅËÅÍÎ  ",	// 180
	"ÎÁÐÀÒÍ ÏÎÑËÅÄÎÂ ",	// 181
	"ÏÐßÌÀß ÏÎÑËÅÄÎÂ ",	// 182
	//---------------------------------------------------------------------------
	"    ÎÑÒÀÍÎÂ     ",	// 183
	" ÀÂÒÎÌÀÒÈ×ÅÑÊÈÉ ",	// 184
	"  ÈÃÍÎÐÈÐÎÂÀÍÈÅ ", // 185
	//---------------------------------------------------------------------------
	"    ÂÛÊËÞ×ÅÍ    ",	// 186
	"    ÂÊËÞ×ÅÍ     ",	// 187
	//---------------------------------------------------------------------------
	"ÍÎÐÌ ÐÀÇÎÌÊÍÓÒÛÉ",	// 188
	" ÍÎÐÌ ÇÀÌÊÍÓÒÛÉ ",	// 189
	//---------------------------------------------------------------------------
	" ÑÒÀÒÓÑ ÐÀÁÎÒÛ  ",	// 190
	" ÄÈÀÃÍ ÏÐÎÖÅÑÑÀ ",	// 191
	" ÄÈÀÃÍÎÑÒ ÑÅÒÈ  ",	// 192
	" ÄÈÀÃÍ ÍÀÃÐÓÇÊÈ ",	// 193
	" ÄÈÀÃÍ ÓÑÒÐ-ÂÀ  ",	// 194
	"  ÑÎÑÒ ÂÕÎÄÎÂ   ",	// 195
	"  ÑÎÑÒ ÂÛÕÎÄÎÂ  ",	// 196
	"     ÐÅÇÅÐÂ     ",	// 197
	"     ÌÎÌÅÍÒ     ",	// 198
	"    ÑÊÎÐÎÑÒÜ    ",	// 199
	"  ÑÐÅÄÍÅÅ ÍÀÏÐ  ",	// 200
	"  ÑÐÅÄÍÈÉ ÒÎÊ   ",	// 201
	" ÓÃÎË ÍÀÃÐÓÇÊÈ  ",	// 202
	"     ÐÅÇÅÐÂ     ",	// 203
	"     ÐÅÇÅÐÂ     ",	// 204
	"     ÐÅÇÅÐÂ     ",	// 205
	"     ÐÅÇÅÐÂ     ",	// 206
	"     ÐÅÇÅÐÂ     ",	// 207
	"     ÐÅÇÅÐÂ     ",	// 208
	"     ÐÅÇÅÐÂ     ",	// 209
	"     ÐÅÇÅÐÂ     ",	// 210
	"     ÐÅÇÅÐÂ     ",	// 211
	"     ÐÅÇÅÐÂ     ",	// 212
	"     ÐÅÇÅÐÂ     ",	// 213
	"     ÐÅÇÅÐÂ     ",	// 214
	"     ÐÅÇÅÐÂ     ",	// 215
	"     ÐÅÇÅÐÂ     ",	// 216
	"     ÐÅÇÅÐÂ     ",	// 217
	"     ÐÅÇÅÐÂ     ",	// 218
	"     ÐÅÇÅÐÂ     ",	// 219
	//----------------------------------------------
	"  ÏÎ ÓÑÒÀÂÊÀÌ   ",	// 220
	"ÏÎ ÓÑÒ Ñ ÇÀÄÅÐÆÊ",	// 221
	" ÂÑÅÃÄÀ ÂÊË     ",	// 222
	" ÐÓ×ÍÎÅ ÓÏÐ     ",	// 223
	//-----------------------------------------------
	"  ÁÅÇ ÏÐÎÂÅÐÊÈ  ",	// 224
	" ÍÀ ÍÅ×ÅÒÍÎÑÒÜ  ",	// 225
	"  ÍÀ ×ÅÒÍÎÑÒÜ   ",	// 226
   //-----------------------------------------------
    "ÍÅ ÎÏÐÅÄÅËÅÍ    ",	// 227
	"ÝÏÖ-100 À.25    ",	// 228
	"ÝÏÖ-100 À.50    ",	// 229
	"ÝÏÖ-400 Á.20    ",	// 230
	"ÝÏÖ-400 Á.40    ",	// 231
	"ÝÏÖ-800 Â.40    ",	// 232
	"ÝÏÖ-1000 Â.20   ",	// 233
	"ÝÏÖ-4000 Ã.9    ",	// 234
	"ÝÏÖ-4000 Ã.18   ",	// 235
	"ÝÏÖ-10000 Ä.6   ",	// 236
	"ÝÏÖ-10000 Ä.12  ",	// 237
	"ÝÏÖ-10000 Ä.10  ",	// 238
	"ÝÏÖ-15000 Ä.10  ",	// 239
	"ÝÏÖ-20000 F.40  ",	// 240
	"ÝÏÖ-35000 F.48  ",	// 241
	"ÝÏÖ-50000 F.48  ",	// 242
	"ÝÏÖ-4Ê  Ã.18 Ó2 ",	// 242
	"ÝÏÖ-10Ê Ä.12 Ó2 ",	// 242
	"ÝÏÇÐ-2000       ",	// 242
	"ÝÏÇÐ-4000       "	// 242
};

const struct MENU_STRING AddStr[] = {
	"ÓÑÒÐÎÉÑÒÂ ÇÀÍßÒÎ",	// 0
	"    ÊÎÌÀÍÄÀ     ",	// 1
	"    ÎÒÌÅÍÅÍÀ    ",	// 2
	"  Ï 999.99%     ",	// 3
	//-----------------------------------------------
	"ÝÊÑÏ. ÍÀÑÒÐÎÉÊÀ?",	// 4	0
	"    ÄÀ  ÍÅÒ     ",	// 5
	" ÇÀÄÀÒÜ ÌÎÌÅÍÒ  ",	// 6	1
	"ÊÀËÈÁÐÎÂÊÈ  ÎÊ  ",	// 7
	" ÒÈÏ ÊÀËÈÁÐÎÂÊÈ ",	// 8	2
	" ÐÓ×Í  ÊÎË.ÎÁÎÐ ",	// 9
	"ÏÅÐÅÂÅÄÈ Â ÏÎËÎÆ",	// 10	3
	" ÇÀÊÐÛÒÎ   ÎÊ   ",	// 11
	"ÏÅÐÅÂÅÄÈ Â ÏÎËÎÆ",	// 12	4
	" ÎÒÊÐÛÒÎ   ÎÊ   ",	// 13
	"ÏÅÐÅÂÅÄÈ Â ÊÐÀÉÍ",	// 14	5
	"ÏÎËÎÆÅÍÈÅ   ÎÊ  ",	// 15
	"   ÏÎËÎÆÅÍÈÅ    ",	// 16	6
	"   ÇÀÊÐ  ÎÒÊÐ   ",	// 17
	"ÏÐÎÂÅÐÈÒÜ ÊÀËÈÁ?",	// 18	7
	"    ÄÀ  ÍÅÒ     ", // 19
	"   ÏÓÑÒÈÒÅ Â    ",	// 20	8
	"    ÎÒÊÐÛÒÎ     ", // 21
	"   ÏÎËÎÆÅÍÈÅ    ",	// 22	9	// Çäåñü âûâîäÿòñÿ òåêóùèå îáîðîòû
	"                ", // 23
	"ÑÁÐÎÑ ÊÀËÈÁÐÎÂ? ",	// 24	10
	"    ÄÀ  ÍÅÒ     ", // 25
	"   ÏÓÑÒÈÒÅ Â    ",	// 26	11
	"    ÇÀÊÐÛÒÎ     ", // 27
	" ÓÑÒÐÀÈÂ ÊÀËÈÁ? ",	// 28	12
	"    ÄÀ  ÍÅÒ     ", // 29
	"ÇÀÄÀÉÒÅ ÐÀÁÎ×ÈÅ ",	// 30	13
	"  ÌÎÌÅÍÒÛ   ÎÊ  ", // 31
};

#endif

#endif




