/*======================================================================
хЛЪ ТЮИКЮ:          core_MenuParams.h
юБРНП:
бЕПЯХЪ ТЮИКЮ:
дЮРЮ ХГЛЕМЕМХЪ:
нОХЯЮМХЕ:
хМРЕПТЕИЯМШИ ЛНДСКЭ
======================================================================*/

#ifndef CORE_MENU_PARAMS_
#define CORE_MENU_PARAMS_

#include "core_MenuGlobal.h" 	// тЮИК ЙНМТХЦСПЮЖХХ ОЮПЮЛЕРПНБ 
#include "g_Ram.h" 				// тЮИК ОЮПЮЛЕРПНБ 

#define CREATE_STRUCTS

#define MAX_LEVEL			2 // бКНФЕММНЯРЭ ЛЕМЧ
#define GROUP_COUNT			5 // йНКХВЕЯРБН ЦПСОО

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define PDU_READ_ADR		3
#define PDU_WRITE_ADR		4

#ifdef CREATE_STRUCTS


const struct MENU_PARAM params[] = {
		"   р0.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//0
		"   р1.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//1
		"   р2.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//2
		"   р3.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//3
		"   р4.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//4
		"   р5.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//5
		"   р6.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//6
		"   р7.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//7
		"   р8.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//8
		"   р9.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//9
		"   р10.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//10
		"   р11.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//11
		"   р12.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//12
		"   р13.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//13
		"   р14.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//14
		"   р15.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//15
		"   р16.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//16
		"   р17.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//17
		"   р18.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//18
		"   р19.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//19
		"   р20.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//20
		"   р21.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//21
		"   р22.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//22
		"   р23.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//23
		"   р24.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//24
		"   р25.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//25
		"   р26.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//26
		"   р27.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//27
		"   р28.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//28
		"   р29.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//29
		"   р30.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//30
		"   р31.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//31
		"   р32.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//32
		"   р33.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//33
		"   р34.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//34
		"   р35.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//35
		"   р36.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//36
		"   р37.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//37
		"   р38.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//38
		"   р39.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//39
		//-------------------------------------------------------------------------
		"B0.лнлемр гюйп  ", "м*л ",	0,     32,	2, M_EDIT|M_KMM|M_RMAX(4),					//40
		"B1.лнлемр нрйп  ", "м*л ",	0,     32,	2, M_EDIT|M_KMM|M_RMAX(4),					//41
		"B2.лнл сок гюйп ", "м*л ",	0,     32,	2, M_EDIT|M_KMM|M_RMAX(4),					//42
		"B3.лнл рпнц гюйп", "м*л ", 	0,     32,  	4, M_EDIT|M_KMM|M_RMAX(4),					//43
		"B4.лнл сок нрйп ", "м*л ", 	0,     32,  	2, M_EDIT|M_KMM|M_RMAX(4),					//44
		"B5.лнл рпнц нрйп", "м*л ", 	0,     32,  	4, M_EDIT|M_KMM|M_RMAX(4),					//45
		"B6.рхо гюдбхфйх ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),						//46
		"B7.рхо сокнрмем ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),						//47
		"B8.рхо ьрнйю    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),						//48
		"B9.гнмю гюйпшрн ", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//49
		"B10.гнмю нрйпшрн", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//50
		"B11.гнмю ялеыем ", "на  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),				//51
		"B12.йнд днярсою ", "    ", 	0,  65530,  	0, M_CODE,									//52
		"   B13.бпелъ    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1,							//53
		"   B14.дюрю     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1,							//54
		"B15.йнпп вюянб  ", "я   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),					//55
		"B16.хмдхйюж рнйю", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),						//56
		"B17.пефхл лс/дс ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),						//57
		"B18.хярнв йнл дс", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),						//58
		"B19.акнй гюкхо  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),						//59
		"B20.бпелъ йнлюмд", "я   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),				//60
		"B21.рхо бу яхцм ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),						//61
		"B22.люяй бу яхцм", "    ", 	0,     31,  	0, M_BINE|M_RMAX(2),						//62
		"B23.люяй бшу яхц", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),						//63
		"B24.яйнп ябъгх  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),						//64
		"B25.юдпея ярюмж ", "    ", 	1,     32,  	1, M_EDIT|M_RMAX(1),						//65
		"B26.пефхл ябъгх ", "    ", 	0,      2,  	0, M_LIST|M_SADR(224),						//66
		"B32.бпе япюа лст", "я   ", 	3,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),						//67
		"B28.ляй ймно ыяс", "    ", 	0,     7,  		4, M_BINE|M_RMAX(2),						//68
		"   B29.MOD_FAULT", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//69
		"   B30.RES_ERR  ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//70
		"   B31.пеф 3 яей", "    ", 	0,  	1,  	0, M_EDIT|M_RMAX(4),						//71
		"B32.бп нря дбхф ", "я   ", 	3,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//72
		"B33.осрэ сокнрм ", "на  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),				//73
		"  B34.пефхл рс  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//74
		"B35.дефспм пефхл", "C   ",     0,   6000,      0, M_HIDE|M_RMAX(3),						//75
		"   B36.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//76
		"   B37.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//77
		"   B38.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//78
		"   B39.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//79
		"рс нрйп 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//80
		"рс нрйп 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//81
		"рс нрйп 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//82
		"рс нрйп 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//83
		"рс нрйп йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//84
		"рс нрйп йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//85
		"рс нрйп ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//86
		"рс гюйп 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//87
		"рс гюйп 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//88
		"рс гюйп 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//89
		"рс гюйп 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//90
		"рс гюйп йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//91
		"рс гюйп йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//92
		"рс гюйп ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//93
		"рс ярно 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//94
		"рс ярно 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//95
		"рс ярно 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//96
		"рс ярно 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//97
		"рс ярно йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//98
		"рс ярно йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//99
		"рс ярно ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//100
		"рс лс   220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//101
		"рс лс   220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//102
		"рс лс   24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//103
		"рс лс   24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//104
		"рс лс   йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//105
		"рс лс   йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//106
		"рс лс   ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//107
		"рс яаюб 220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//108
		"рс яаюб 220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//109
		"рс яаюб 24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//110
		"рс яаюб 24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//111
		"рс яаюб йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//112
		"рс яаюб йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//113
		"рс яаюб ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//114
		"бйк рс  220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//115
		"бйк рс  220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//116
		"бйк рс  24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//117
		"бйк рс  24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//118
		"бйк рс  йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//119
		"бйк рс  йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//120
		"бйк рс  ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//121
		"рс дс   220 бйк ", "    ",      0,  65530,    140, M_EDIT|M_RMAX(4),						//122
		"рс дс   220 бшйк", "    ",      0,  65530,     80, M_EDIT|M_RMAX(4),						//123
		"рс дс   24 бйк  ", "    ",      0,  65530,     18, M_EDIT|M_RMAX(4),						//124
		"рс дс   24 бшйк ", "    ",      0,  65530,      8, M_EDIT|M_RMAX(4),						//125
		"рс дс   йнп U220", "    ",      0,  65530,   1100, M_EDIT|M_RMAX(4),						//126
		"рс дс   йнп U24 ", "    ",      0,  65530,     74, M_EDIT|M_RMAX(4),						//127
		"рс дс   ялеы U  ", "    ",      0,  65530,      0, M_EDIT|M_RMAX(4),						//128
		"   B47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//129
		"   B48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//130
		"   B49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//131
		"   B50.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//132
		"   B51.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//133
		"   B52.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//134
		"   B53.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//135
		"   B54.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//136
		"   B55.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//137
		"   B56.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//138
		"   B57.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//139
		//------------------------------------------------------------------
		" я0.йнд днярсою ", "    ",     0,  65530,      0, M_CODE,									//140
		"я1.рхо опхбндю  ", "    ",     0,     20,      0, M_FLST|M_SADR(227),						//141
		"я2.цнд хгцнрнбк ", "    ",     0,     99,     14, M_FACT|M_RMAX(1),						//142
		"я3.гюбнд мнлеп  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),						//143
		"я4.люйя лнлемр  ", "йм*л",    10,   3500,     10, M_FACT|M_RMAX(3)|M_PREC(2),				//144
		"я5.мнлхмюкэм рнй", "A   ",     1,    800,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//145
		"я6.йо педсйрнпю ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),				//146
		"я7.йо акнй-пед  ", "    ",     1,  65530,    217, M_FACT|M_RMAX(4),						//147
		"я8.рнвм онкнфем ", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//148
		"я9.пюяяр веп тюг", "    ",     0,     75,     12, M_FACT|M_RMAX(1),						//149
		"я10.пюяяр лстрш ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),						//150
		"C11.рхо дюрв онк", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//151
		"я12.хмдхй йюкхап", "    ",     0,      1,      1, M_FLST|M_SADR(153),						//152
		"C13.бп яап хмдхй", "C   ",     0,     30,      0, M_FACT|M_RMAX(1),						//153
		"я14.сцк соп яхтс", "цпюд",     0,    180,      0, M_SHOW|M_RMAX(2),						//154
		"я15.сцк мюцпсгйх", "цпюд", -180U,    180,      0, M_SHOW|M_SIGN|M_RMAX(2),					//155
		"я16.яберндхндш  ", "    ",     0,     255,     0, M_BINF|M_RMAX(8),						//156
		"я17.дюрв унккю  ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),						//157
		"C18.он слнквюмхч", "    ",     0,      1,      0, M_FCOMM|M_SADR(155),						//158
		"   я19.пегепб   ", "    ", 	0,  65535,  	1, M_FACT|M_RMAX(4),						//159
		"C20.оепецп дбхц ", "    ", 	0,      1,  	1, M_FLST|M_SADR(153),						//160
		"C21.с люйя U 47%", "B   ",    220,    600,    318, M_FACT|M_RMAX(2),						//161
		"C22.T люйя U 47%", "C   ",      1,    200,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//162
		"я23.йнк.яанеб до", "    ",     0,     50,      0, M_SHOW|M_RMAX(1),						//163
		"я24.спнб яанъ до", "    ",     0,     50,      5, M_FACT|M_RMAX(1),						//164
		"я25.хмремя пюгц ", "    ",     0,    100,     10,  M_FACT|M_RMAX(2),						//165
		"я26.бпелъ оюсгш ", "    ",     6,    500,     50, M_FACT|M_RMAX(2)|M_PREC(2),				//166
		"я27.бпелъ рнплнф", "    ",     0,    500,    100, M_FACT|M_RMAX(2)|M_PREC(2),				//167
		"я28.йнк-бн сдюп ", "    ",     0,     10,      0, M_FACT|M_RMAX(1),						//168
		"я29.спнб люйя U ", "B   ",    220,    335,    285, M_FACT|M_RMAX(2),						//169
		"я30.бпел люйя U ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),				//170
		"я31.спнб лхм U  ", "B   ",     90,    220,    115, M_FACT|M_RMAX(2),						//171
		"я32.бпел лхм U  ", "C   ",      1,    250,    210, M_FACT|M_RMAX(2)|M_PREC(1),				//172
		"я33.спнб меа U  ", "%   ",      3,     25,     10, M_FACT|M_RMAX(1),						//173
		"я34.бпел меа U  ", "C   ",      2,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//174
		"я35.спнб слем U ", "б   ",      0,    110,     60, M_FACT|M_RMAX(2),						//175
		"я36.бпел слем U ", "C   ",      1,    250,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//176
		"C37.гюы слем I  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//177
		"C38.спнб слем I ", "%   ",     20,    500,    200, M_FACT|M_RMAX(2)|M_PREC(1),				//178
		"C39.бпел слем I ", "C   ",      1,    100,     10, M_FACT|M_RMAX(1)|M_PREC(1),				//179
		"C40.бп-рнй гюы  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//180
		"C41.спнб лхм I  ", "%   ",   1050,   1400,   1200, M_FACT|M_RMAX(3)|M_PREC(1),				//181
		"C42.спнб япед I ", "%   ",   1500,   1900,   1700, M_FACT|M_RMAX(3)|M_PREC(1),				//182
		"C43.спнб люйя I ", "%   ",   2000,   2250,   2100, M_FACT|M_RMAX(3)|M_PREC(1),				//183
		"C44.бпел лхм I  ", "C   ",      1,   6000,   1800, M_FACT|M_RMAX(3)|M_PREC(1),				//184
		"C45.бпел япед I ", "C   ",      1,   6000,   1200, M_FACT|M_RMAX(3)|M_PREC(1),				//185
		"C46.бпел люйя I ", "C   ",      1,   6000,    600, M_FACT|M_RMAX(3)|M_PREC(1),				//186
		"я47.бп веп тюг  ", "я   ",      1,    600,     10, M_EDIT|M_RMAX(2)|M_PREC(1),				//187
		"C48.сп оепец дб.", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//188
		"C49.бу оепец дб.", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//189
		"C50.гюы люйя U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//190
		"C51.гюы лхм U   ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//191
		"C52.гюы меаюк U ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//192
		"C53.гюы слем U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//193
		"C54.веп тюг дбхц", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//194
		"я55.бп люйя U м ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//195
		"я56.бп лхм U м  ", "C   ",      1,    200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//196
		"C57.ондбепяхъ он", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//197
		"C58.гюы лхм I   ", "    ",      0,      1,      0, M_FLST|M_SADR(153),						//198
		"C59.сп лхм I    ", "%   ",     20,    500,    300, M_FACT|M_RMAX(2)|M_PREC(1),				//199
		"C60.бпел лхм I  ", "C   ",      1,    600,    300, M_FACT|M_RMAX(2)|M_PREC(1),				//200
		"C61.гюы меа I   ", "    ",      0,      1,      0, M_FLST|M_SADR(153),						//201
		"C62.сп меа I    ", "%   ",      2,     70,     65, M_FACT|M_RMAX(1),						//202
		"C63.бпел меа I  ", "C   ",      2,   1000,     10, M_FACT|M_RMAX(3)|M_PREC(1),				//203
		"C64.гюыхрю нр йг", "    ",      0,      1,      0, M_FLST|M_SADR(153),						//204
		"   C65.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//205 РСР АШКХ ЯРЮПШЕ СПНБМХ йг
		"   C66.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//206
		"   C67.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//207
		"C68.хмд юбю сярп", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//208
		"C69.оепец/оепену", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//209
		" я70.сп оепецп  ", "цпюд",      0,    100,     90, M_FACT|M_SIGN|M_RMAX(2),				//210
		"я71.сп оепенук  ", "цпюд",   -50U,      0,   -37U, M_FACT|M_SIGN|M_RMAX(2),				//211
		"я72.сп бйк ремю ", "цпюд",   -40U,     10,   -10U, M_FACT|M_SIGN|M_RMAX(2),				//212
		"я73.сп бшйк рем ", "цпюд",   -20U,     50,     10, M_FACT|M_SIGN|M_RMAX(2),				//213
		"я74.йнпп релоеп ", "цпюд",  -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),				//214
		"я75.мехяо лс/дс ", "    ",     0,       1,      1, M_FLST|M_SADR(153),						//215
		"я76.рейсы ялеы U", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),				//216
		"я77.рейсы ялеы V", "    ",-32000U,  32000,      0, M_FACT|M_SIGN|M_RMAX(4),				//217
		"я78.рейсы ялеы W", "    ",-32000U,  32000,      0, M_SHOW|M_SIGN|M_RMAX(4),				//218
		" я79.йнп рнйю U ", "    ",      0,  65530,    1600, M_FACT|M_RMAX(4),						//219
		" я80.йнп рнйю V ", "    ",      0,  65530,    1600, M_FACT|M_RMAX(4),						//220
		" я81.йнп рнйю W ", "    ",      0,  65530,    1600, M_FACT|M_RMAX(4),						//221
		"я82.ялеы рнйю U ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//222
		"я83.ялеы рнйю V ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//223
		"я84.ялеы рнйю W ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//224
		" я85.йнп мюоп R ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//225
		" я86.йнп мюоп S ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//226
		" я87.йнп мюоп T ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//227
		"я88.ялеы мюоп R ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//228
		"я89.ялеы мюоп S ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//229
		"я90.ялеы мюоп T ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//230
		"я91.оняр.бп.яхм ", "MйC ",      0,    100,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//231
		"я92.оняр.бп.RMS ", "MйC ",      0,    100,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//232
		"я93.йнппейр жюо ", "    ",      0,  65530,   3400, M_FACT|M_RMAX(4),						//233
		"я94.ялеы жюо    ", "    ",      0,  65530,    683, M_FACT|M_RMAX(4),						//234
		"я95.онкнф гюйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//235
		"я96.онкнф нрйп  ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//236
		"я97.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//237
		"я98.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//238
		"я99.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//239
		"я100.бепу сп йг ", "    ",      0,  65530,  45000, M_FACT|M_RMAX(4),						//240
		"я101.мхфм сп йг ", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//241
		"я102.онкнфем    ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//242
		"C103.онмхф U    ", "    ",      0,  65530,   5050, M_FACT|M_RMAX(4),						//243
		"я104.йнщт 25%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//244
		"я105.йнщт 35%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//245
		"я106.йнщт 50%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//246
		"я107.йнщт 75%   ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//247
		"я108.йнщт 100%  ", "    ",   -10U,     10,      0, M_FACT|M_SIGN|M_RMAX(1),				//248
		"я109.йнп дн 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//249
		"я110.йнп дн 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//250
		"я111.йнп дн 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//251
		"я112.йнп дн 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//252
		"   я113.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//253
		"   я114.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//254
		"   я115.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//255
		"   я116.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//256
		"   я117.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//257
		"   я118.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//258
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//259
		//------------------------------------------------------------------
		"D0.гюдюмхе гюйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//0 260
		"D1.гюдюмхе нрйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//1 261
		"D2.нанп мю нрйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//2 262
		"D3.нанп мю гюйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//3 263
		"  D4.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//4 264
		"D5.яапня йюкхап ", "    ",      0,      1,      0, M_COMM|M_SADR(158),						//5 265
		"D6.йнлюмд сопюбк", "    ",      0,     19,      0, M_COMM|M_SADR(160),						//6 266
		" D7.яапня гюыхр ", "    ",      0,      1,      0, M_COMM|M_SADR(160),						//7 267
		" D8.он слнквюмхч", "    ",      0,      1,      0, M_COMM|M_SADR(155),						//8 268
		"   D9.пегепб    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),						//9 269
		"D10.яапня жхйкнб", "    ",      0,      1,     0, M_COMM|M_SADR(160),						//10 270
		"D11.яапня ябъгх ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),						//11 271
		"   D12.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//12 272
		"   D13.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//13 273
		"   D14.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//14 274
		"   D15.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//15 275
		"   D16.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//16 276
		"   D17.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//17 277
		"   D18.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//18 278
		"   D19.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//19 279
		//-------------------------------------------------------------------
		"G0.пефхл реярю  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),						//0 280
		"G1.реяр ябернд  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//1 281
		"G2.реяр дхя бшу ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//2 282
		"G3.гмювемхе жюо ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),			//3 283
		"G4.ярюпр дхяок  ", "    ",      0,      1,      0, M_FDCOM,								//4 284
		"G5.TECT я йюлепш", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),						//5 285
		"G6.цпсо рхпхяр  ", "    ",      0,      1,      0, M_FDCOM,								//6 286
		"G7.пюгпеь яхтс  ", "    ",      0,      1,      0, M_FDCOM,								//7 287
		"   G8.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//8 288
		"   G9.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//9 289
		"   G10.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//10 290
		"   G11.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//11 291
		"   G12.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//12 292
		"   G13.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//13 293
		"   G14.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//14 294
		"   G15.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//15 295
		"   G16.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//16 296
		"   G17.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//17 297
		"G18.реяр сцнк нр", "    ",      0,    140,      0, M_FDCOM|M_RMAX(2),						//18 298
		"   G19.пегепб   ", "    ",      0,  65530,      0, M_SHOW|M_RMAX(4),						//19 299
		"   G20.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//20 300
		"   G21.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//21 301
		"   G22.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//22 302
		"   G23.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//23 303
		"   G24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//24 304
		"   G25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//25 305
		"   G26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//26 306
		"   G27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//27 307
		"   G28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//28 308
		"   G29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//29 309
		//-------------------------------------------------------------------
		"янярнъмхе йюкхап", "    ",      0,      3,      0, M_HIDE,									//0 310
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//1 311
		"онкнф гюйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//2 312
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//3 313
		"онкнф нрйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//4 314
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//5 315
		"    оюпнкэ 1    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//6 316
		"    оюпнкэ 2    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//7 317
		"   юбюпхх йг    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//8 318
		"   рнкэйн сонп  ", "    ", 	 0,      1,  	 0, M_HIDE|M_RMAX(1),						//9 319
		"м10.явервхй жхйк", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//10 320
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//11 321
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//12 322
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//13 323
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//14 324
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//15 325
		"  рнй оепеундю  ", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//16 326
		" лнлемр рнй 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//17 327
		" лнлемр рнй 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//18 328
		" лнлемр рнй 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//19 329
		" лнлемр рнй 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//20 330
		" лнлемр рнй 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//21 331
		" лнлемр рнй 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//22 332
		" лнлемр рнй 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//23 333
		" лнлемр рнй 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//24 334
		" лнлемр рнй 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//25 335
		" лнлемр рнй 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//26 336
		" лнлемр рнй 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//27 337
		" лнлемр рнй 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//28 338
		" лнлемр рнй 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//29 339
		" лнлемр рнй 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//30 340
		" лнлемр рнй 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//31 341
		" лнлемр рнй 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//32 342
		" лнлемр рнй 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//33 343
		" лнлемр рнй 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//34 344
		" лнлемр рнй 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//35 345
		" лнлемр рнй 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//36 346
		"лнлемр сцнк 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//37 347
		"лнлемр сцнк 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//38 348
		"лнлемр сцнк 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//39 349
		"лнлемр сцнк 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//40 350
		"лнлемр сцнк 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//41 351
		"лнлемр сцнк 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//42 352
		"лнлемр сцнк 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//43 353
		"лнлемр сцнк 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//44 354
		"лнлемр сцнк 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//45 355
		"лнлемр сцнк 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//46 356
		"лнлемр сцнк 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//47 357
		"лнлемр сцнк 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//48 358
		"лнлемр сцнк 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//49 359
		"лнлемр сцнк 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//50 360
		"лнлемр сцнк 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//51 361
		"лнлемр сцнк 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//52 362
		"лнлемр сцнк 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//53 363
		"лнлемр сцнк 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//54 364
		"лнлемр сцнк 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//55 365
		"лнлемр сцнк 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//56 366
		" сцнк яхтс 0_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//57 367
		" сцнк яхтс 0_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//58 368
		" сцнк яхтс 0_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//59 369
		" сцнк яхтс 0_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//60 370
		" сцнк яхтс 0_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//61 371
		" сцнк яхтс 1_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//62 372
		" сцнк яхтс 1_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//63 373
		" сцнк яхтс 1_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//64 374
		" сцнк яхтс 1_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//65 375
		" сцнк яхтс 1_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//65 376
		" сцнк яхтс 2_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//67 377
		" сцнк яхтс 2_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//68 378
		" сцнк яхтс 2_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//69 379
		" сцнк яхтс 2_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//70 380
		" сцнк яхтс 2_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//71 381
		" сцнк яхтс 3_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//72 382
		" сцнк яхтс 3_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//73 383
		" сцнк яхтс 3_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//74 384
		" сцнк яхтс 3_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//75 385
		" сцнк яхтс 3_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//76 386
		"бп бша гюгнпю   ", "C   ",      0,    100,      0, M_HIDE|M_RMAX(2)|M_PREC(1),				//77 387
		"йнлюмдш рс      ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//78 388
		"мюопъф тюгш R   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//79 389
		"мюопъф тюгш S   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//80 390
		"мюопъф тюгш T   ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//81 391
		"япедмее мюоп    ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//82 392
		"меаюк тюг яерх  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//83 393
		"вепед тюг яерх  ", "    ",      0,      2,      0, M_HIDE|M_SADR(180),						//84 394
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_SADR(35),						//85 395
		"яед рнй %       ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//86 396
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_SADR(52),						//87 397
		"  рнй тюгш U %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//88 398
		"  рнй тюгш V %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//89 399
		"  рнй тюгш W %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//90 400
		" япедмхи рнй    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),				//91 401
		"меаюк рнй мюцп  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//92 402
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//93 403
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//94 404
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//95 405
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//96 406
		" рхо пебепяю    ", "    ",      0,      2,      2, M_HIDE|M_SADR(183),						//97 407
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//98 408
		" яняр бунднб    ", "    ",      0,  65530,      0, M_HIDE|M_SADR(86),						//99 409
		" яняр бшунднб   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(103),						//100 410
		"пекеимши пефхл  ", "    ",      0,      1,      0, M_HIDE|M_SADR(186),						//101 411
		" бунд нрйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//102 412
		" бунд гюйпшрэ   ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//103 413
		" бунд ярно      ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//104 414
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//105 415
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//106 416
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//107 417
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//108 418
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//109 419
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//110 420
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//111 421
		" бшунд ярно     ", "    ",      0,      1,      0, M_HIDE|M_SADR(188),						//112 422
		"дхюцм сярп-бю   ", "    ",      0,  65530,      0, M_HIDE|M_SADR(69),						//113 423
		"хмдхй б ярюпре  ", "    ",      0,     29,     18, M_HIDE|M_SADR(190),						//114 424
		"дефспмши пефхл  ", "C   ",      0,   6000,      0, M_HIDE|M_RMAX(3),						//115 425
		"опнжемр хяонкм  ", "%   ",      0,    100,      0, M_HIDE|M_RMAX(2),						//116 426
		"мюв юдп фспм яна", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//117 427
		"мюв юдп фспм йнл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//118 428
		"мюв юдп фспм оюп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//119 429
		"гюохях фспм яна ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//120 430
		"гюохях фспм йнл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//121 431
		"гюохях фспм оюп ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//122 432
		"    лнлемр      ", "м*л ",      0,  11000,      0, M_HIDE|M_RMAX(4),						//123 433
		"    яйнпнярэ    ", "на/л", -3600U,   3600,      0, M_HIDE|M_SIGN|M_RMAX(3),				//124 434
		"    яейсмдш     ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),						//125 435
		"соп йнмрюйрнпюлх", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//126 436
		"  йнлюмдш асп   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//127 437
		" яапня фспмюкнб ", "    ",      0,  1,          0, M_HIDE|M_RMAX(4),						//128 438
		"м129.хмдхй айо  ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//129 439
		"1    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//130 440
		"2    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//131 441
		"3    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//132 442
		"4    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//133 443
		"5    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//134 444
		"6    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//135 445
		"7    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//136 446
		"8    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//137 447
		"9    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//138 448
		"10   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//139 449
		"11   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//140 450
		"12   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//141 451
		"13   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//142 452
		"14   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//143 453
		"15   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//144 454
		"16   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//145 455
		"17   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//146 456
		"18   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//147 457
		"19   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//148 458
		"20   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//149 459
		"21   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//150 460
		"22   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//151 461
		"23   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//152 462
		"24   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//153 463
		"25   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//154 464
		"26   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//155 465
		"27   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//156 466
		"28   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//157 467
		"29   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//158 468
		"30   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//159 469
		"31   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//160 470
		"32   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//161 471
		"33   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//162 472
		"34   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//163 473
		"35   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//164 474
		"36   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//165 475
		"37   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//166 476
		"38   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//167 477
		"39   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//168 478
		"40   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//169 479
		"41   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//170 480
		"42   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//171 481
		"43   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//172 482
		"44   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//173 483
		"45   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//174 484
		"46   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//175 485
		"47   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//176 486
		"48   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//177 487
		"49   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//178 488
		"50   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//179 489
		"51   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//180 490
		"52   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//181 491
		"53   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//182 492
		"54   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//183 493
		"55   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//184 494
		"56   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//185 495
		"57   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//186 496
		"58   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//187 497
		"59   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//188 498
		"60   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//189 499
		//------------------------------------------------------------------------------------------------
		"ю0.ярюрся пюанрш", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),						//0 500
		"ю1.дхюц опнжеяяю", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),						//1 501
		"ю2.дхюцмняр яерх", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),						//2 502
		"ю3.дхюц мюцпсгйх", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),						//3 503
		"ю4.дхюцм сярп-бю", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),						//4 504
		#if BUR_M
		"ю5.пегепб       ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//5 505
		#else
		" ю5.яняр бунднб ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),						//5 505
		#endif
		" ю6.яняр бшунднб", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),						//6 506
		"  ю7.онкнфемхе  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7 507
		"   ю8.лнлемр    ", "м*л ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//8 508
		"   ю9.яйнпнярэ  ", "на/л",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),					//9 509
		"ю10.мюоп тюгш R ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//10 510
		"ю11.мюоп тюгш S ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//11 511
		"ю12.мюоп тюгш T ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//12 512
		" ю13.рнй тюгш U ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//13 513
		" ю14.рнй тюгш V ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//14 514
		" ю15.рнй тюгш W ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//15 515
		"ю16.сцнк мюцпсг ", "цпюд", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),					//16 516
		"ю17.ярюрся йюкха", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),						//17 517
		"A18.онкнфемхе % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//18 518
		" ю19.онкмши унд ", "на  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),				//19 519
		"ю20.рейсыхи унд ", "на  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//20 520
		"ю21.явер жхйкнб ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//21 521
		"ю22.релоепюрспю ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//22 522
		"ю23.релоеп айо  ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//23 523
		"ю24.бепяхъ он   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),				//24 524
		"ю25.бепяхъ онайо", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(2),				//25 525
		"ю26.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//26 526
		"ю27.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//27 527
		"ю28.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//28 528
		"ю29.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//29 529
		"ю30.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//30 530
		"ю31.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//31 531
		"ю32.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//32 532
		"ю33.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//33 533
		"ю34.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//34 534
		"ю35.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//35 535
		"ю36.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//36 536
		"ю37.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//37 537
		"ю38.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//38 538
		"ю39.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//39 539
		//------------------------------------------------------------------------------------------------
		"     бпелъ      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,							//T
		"      дюрю      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,							//D
		"E0.ярюрся пюанрш", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),						//0
		"E1.дхюцм опнжеяя", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),						//1
		"E2.дхюцмняр яерх", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),						//2
		"E3.дхюцм мюцпсгй", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),						//3
		"E4.дхюцм сярп-бю", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),						//4
		"E5.онкнфемхе %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//5
		"    E6.лнлемр   ", "м*л ",     10,  11000,     10, M_SHOW|M_RMAX(4),						//6
		"E7.мюопъф тюгш R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//7
		"E8.мюопъф тюгш S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//8
		"E9.мюопъф тюгш T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//9
		"E10.рнй тюгш U  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//10
		"E11.рнй тюгш V  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//11
		"E12.рнй тюгш W  ", "ю/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//12
		"E13.релоеп акнй ", "цпюд",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),				//13
		"E14.яняр бунднб ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),						//14
		"E15.яняр бшунднб", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),						//15
		"   E16.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//16
		"   E17.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//17
		"   E18.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//18
		"   E19.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//19
		"   E20.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//20
		"   E21.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//21
		"   E22.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//22
		"   E23.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//23
		"   E24.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//24
		"   E25.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//25
		"   E26.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//26
		"   E27.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//27
		"   E28.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//28
		"   E29.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)						//29
};

const struct MENU_STRING values[] = {
	"    гюохяэ      ",	// 0
//----------------
	"  ме нопедекем  ",	// 1
	"      ярно      ",	// 2
	"     юбюпхъ     ",	// 3
	" хдер гюйпшрхе  ",	// 4
	" хдер нрйпшрхе  ",	// 5
	"   хдер реяр    ",	// 6
	"    гюйпшрн     ",	// 7
	"    нрйпшрн     ",	// 8
	"     лстрю      ",	// 9
	" леярмне сопюбк ",	// 10
	"  бйкчвем рем   ",	// 11
	"BLUETOOTH бйк   ",	// 12
	"юбюпхъ мю акнйе ",	// 13
	"  юбюпхъ мю ря  ",	// 14
	"  мехяопюбмнярэ ",	// 15
	"мехяопюбм мю акй",	// 16
	"мехяопюбм мю ря ",	// 17
//--------------------------
	"   мер юбюпхи   ",	// 18
	"  мер дбхфемхъ  ",	// 19
	"  веп тюг дбхц  ",	// 20
	" ме гюдюмн гюйп ",	// 21
	" ме гюдюмн нрйп ",	// 22
	" мер йюкхапнбйх ",	// 23
	"сокнрм ме днярхц",	// 24
	"     лстрю      ",	// 25
	"  мехяоп лс/дс  ",	// 26
	"     пегепб     ",	// 27
	"     пегепб     ",	// 28
	"     пегепб     ",	// 29
	"     пегепб     ",	// 30
	"     пегепб     ",	// 31
	"     пегепб     ",	// 32
	"     пегепб     ",	// 33
	"     пегепб     ",	// 34
//--------------------------
	"   мер юбюпхи   ",	// 35
	"лхм мюоп тюгш R ",	// 36
	"лхм мюоп тюгш S ",	// 37
	"лхм мюоп тюгш T ",	// 38
	"люйя мюоп тюгш R",	// 39
	"люйя мюоп тюгш S",	// 40
	"люйя мюоп тюгш T",	// 41
	"меноп вепед тюг ",	// 42
	"меаюкюмя/напшб U",	// 43
	"слем мюоп тюгш R",	// 44
	"слем мюоп тюгш S",	// 45
	"слем мюоп тюгш T",	// 46
	"мюоп тюгш R 47% ",	// 47
	"мюоп тюгш S 47% ",	// 48
	"мюоп тюгш T 47% ",	// 49
	"  веп тюг яерх  ",	// 50
	"     пегепб     ",	// 51
//--------------------------
	"   мер юбюпхи   ",	// 52
	"  напшб тюгш U  ",	// 53
	"  напшб тюгш V  ",	// 54
	"  напшб тюгш W  ",	// 55
	"бп-рнй оепецпсгй",	// 56
	"     пегепб     ",	// 57
	"   йг тюгш U    ",	// 58
	"   йг тюгш V    ",	// 59
	"   йг тюгш W    ",	// 60
	"     пегепб     ",	// 61
	"     пегепб     ",	// 62
	" лхмхлюкэм рнй  ",	// 63
	" меаюкюмя рнйю  ",	// 64
	"     пегепб     ",	// 65
	"     пегепб     ",	// 66
	"     пегепб     ",	// 67
	"     пегепб     ",	// 68
	//---------------------------------------------------------------------------
	"   мер юбюпхи   ",	// 69
	"яани дюрв онкнф ",	// 70
	" яани оюлърх 1  ",	// 71
	" яани оюлърх 2  ",	// 72
	"   яани вюянб   ",	// 73
	"яани дюрв релоеп",	// 74
	" оепецпеб айо   ",	// 75
	"оепенукюфд айо  ",	// 76
	"оепецпеб айд    ",	// 77
	"оепенукюфд айд  ",	// 78
	"яани жюо        ",	// 79
	"бшйкчвемхе айд  ",	// 80
	"йпхр оепецпеб ак",	// 81
	"     пегепб     ",	// 82
	"     пегепб     ",	// 83
	"     пегепб     ",	// 84
	"     пегепб     ",	// 85
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 86
	"  бунд нрйпшрэ  ",	// 87
	"  бунд гюйпшрэ  ",	// 88
	"   бунд ярно    ",	// 89
	"    бунд лс     ",	// 90
	"    бунд дс     ",	// 91
	"     пегепб     ",	// 92
	"     пегепб     ",	// 93
	"     пегепб     ",	// 94
	"     пегепб     ",	// 95
	"     пегепб     ",	// 96
	"     пегепб     ",	// 97
	"     пегепб     ",	// 98
	"     пегепб     ",	// 99
	"     пегепб     ",	// 100
	"     пегепб     ",	// 101
	"     пегепб     ",	// 102
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 103
	"    юбюпхъ      ",	// 104
	"    гюйпшрн     ",	// 105
	"    нрйпшрн     ",	// 106
	"     лстрю      ",	// 107
	"  гюйпшбюеряъ   ",	// 108
	"  нрйпшбюеряъ   ",	// 109
	"     лс/дс      ",	// 110
	"  мехяопюбмнярэ ",	// 111
	"     пегепб     ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
	//---------------------------------------------------------------------------
	" мер йюкхапнбйх ",	// 120
	" гюдюмн гюйпшрн ",	// 121
	" гюдюмн нрйпшрн ",	// 122
	"йюкхап бшонкмемю",	// 123
	//---------------------------------------------------------------------------
	"    йкхмнбюъ    ",	// 124
	"    ьхаепмюъ    ",	// 125
	//---------------------------------------------------------------------------
	"  ме нопедекем  ",	// 126
	" аег сокнрмемхъ ",	// 127
	"сокнрмемхе гюйп ",	// 128
	"сокнрмемхе нрйп ",	// 129
	"сок гюйп х нрйп ",	// 130
	//---------------------------------------------------------------------------
	"   мнплюкэмши   ",	// 131
	"    напюрмши    ",	// 132
	//---------------------------------------------------------------------------
	"деиярб гмювемхъ ",	// 133
	"опнжемрш нр мнл ",	// 134
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 135
	"  бшанп пефхлю  ",	// 136
	"    пефхл лс    ",	// 137
	"    пефхл дс    ",	// 138
	//---------------------------------------------------------------------------
	" бяе хмрептеияш ",	// 139
	"рнкэйн дхяйперм ",	// 140
	"рнкэйн онякеднб ",	// 141
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 142
	"    бйкчвемю    ",	// 143
	//---------------------------------------------------------------------------
	"      24б       ",	// 144
	"      220б      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 анд    ",	// 146
	"    4800 анд    ",	// 147
	"    9600 анд    ",	// 147
	"   19200 анд    ",	// 149
	"   38400 анд    ",	// 150
	"   57600 анд    ",	// 151
	"   115200 анд   ",	// 152
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 153
	"хмдхй х нярюмнб ",	// 154
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 155
	"     гюдюрэ     ",	// 156
	"    яапняхрэ    ",	// 157
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 158
	"    яапняхрэ    ",	// 159
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 160
	"      ярно      ",	// 161
	"    гюйпшрэ     ",	// 162
	"    нрйпшрэ     ",	// 163
	"  гюйпшрэ реяр  ",	// 164
	"  нрйпшрэ реяр  ",	// 165
	"     пегепб     ",	// 166
	"     пегепб     ",	// 167
	"     пегепб     ",	// 168
	"     пегепб     ",	// 169
	"     пегепб     ",	// 170
	"     пегепб     ",	// 171
	"     пегепб     ",	// 172
	"     пегепб     ",	// 173
	"     пегепб     ",	// 174
	"     пегепб     ",	// 175
	"     пегепб     ",	// 176
	"     пегепб     ",	// 177
	"     пегепб     ",	// 178
	"     пегепб     ",	// 179
	//---------------------------------------------------------------------------
	" ме нопедекемн  ",	// 180
	"напюрм онякеднб ",	// 181
	"опълюъ онякеднб ",	// 182
	//---------------------------------------------------------------------------
	"    нярюмнб     ",	// 183
	" юбрнлюрхвеяйхи ",	// 184
	"  хцмнпхпнбюмхе ", // 185
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 186
	"    бйкчвем     ",	// 187
	//---------------------------------------------------------------------------
	"мнпл пюгнлймсрши",	// 188
	" мнпл гюлймсрши ",	// 189
	//---------------------------------------------------------------------------
	" ярюрся пюанрш  ",	// 190
	" дхюцм опнжеяяю ",	// 191
	" дхюцмняр яерх  ",	// 192
	" дхюцм мюцпсгйх ",	// 193
	" дхюцм сярп-бю  ",	// 194
	"  яняр бунднб   ",	// 195
	"  яняр бшунднб  ",	// 196
	"     пегепб     ",	// 197
	"     лнлемр     ",	// 198
	"    яйнпнярэ    ",	// 199
	"  япедмее мюоп  ",	// 200
	"  япедмхи рнй   ",	// 201
	" сцнк мюцпсгйх  ",	// 202
	"     пегепб     ",	// 203
	"     пегепб     ",	// 204
	"     пегепб     ",	// 205
	"     пегепб     ",	// 206
	"     пегепб     ",	// 207
	"     пегепб     ",	// 208
	"     пегепб     ",	// 209
	"     пегепб     ",	// 210
	"     пегепб     ",	// 211
	"     пегепб     ",	// 212
	"     пегепб     ",	// 213
	"     пегепб     ",	// 214
	"     пегепб     ",	// 215
	"     пегепб     ",	// 216
	"     пегепб     ",	// 217
	"     пегепб     ",	// 218
	"     пегепб     ",	// 219
	//----------------------------------------------
	"  он сярюбйюл   ",	// 220
	"он сяр я гюдепфй",	// 221
	" бяецдю бйк     ",	// 222
	" псвмне соп     ",	// 223
	//-----------------------------------------------
	"  аег опнбепйх  ",	// 224
	" мю мевермнярэ  ",	// 225
	"  мю вермнярэ   ",	// 226
   //-----------------------------------------------
    "ме нопедекем    ",	// 227
	"щож-100 ю.25    ",	// 228
	"щож-100 ю.50    ",	// 229
	"щож-400 а.20    ",	// 230
	"щож-400 а.40    ",	// 231
	"щож-800 б.40    ",	// 232
	"щож-1000 б.20   ",	// 233
	"щож-4000 ц.9    ",	// 234
	"щож-4000 ц.18   ",	// 235
	"щож-10000 д.6   ",	// 236
	"щож-10000 д.12  "	// 237
};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн",	// 0
	"    йнлюмдю     ",	// 1
	"    нрлемемю    ",	// 2
	"  о 999.99%     ",	// 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?",	// 4	0
	"    дю  мер     ",	// 5
	" гюдюрэ лнлемр  ",	// 6	1
	"йюкхапнбйх  нй  ",	// 7
	" рхо йюкхапнбйх ",	// 8	2
	" псвм  йнк.нанп ",	// 9
	"оепебедх б онкнф",	// 10	3
	" гюйпшрн   нй   ",	// 11
	"оепебедх б онкнф",	// 12	4
	" нрйпшрн   нй   ",	// 13
	"оепебедх б йпюим",	// 14	5
	"онкнфемхе   нй  ",	// 15
	"   онкнфемхе    ",	// 16	6
	"   гюйп  нрйп   ",	// 17
	"опнбепхрэ йюкха?",	// 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ",	// 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ",	// 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ",	// 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ",	// 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ",	// 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ",	// 30	13
	"  лнлемрш   нй  ", // 31
};

#endif

#endif




