/*======================================================================
хЛЪ ТЮИКЮ:          core_MenuParams.h
юБРНП:
бЕПЯХЪ ТЮИКЮ:
дЮРЮ ХГЛЕМЕМХЪ:
нОХЯЮМХЕ:
хМРЕПТЕИЯМШИ ЛНДСКЭ
======================================================================*/

#ifndef CORE_MENU_PARAMS_
#define CORE_MENU_PARAMS_

#include "core_MenuGlobal.h" 	// тЮИК ЙНМТХЦСПЮЖХХ ОЮПЮЛЕРПНБ 
#include "g_Ram.h" 				// тЮИК ОЮПЮЛЕРПНБ 

#define CREATE_STRUCTS

#define MAX_LEVEL			2 // бКНФЕММНЯРЭ ЛЕМЧ
#define GROUP_COUNT			5 // йНКХВЕЯРБН ЦПСОО

#define BUSY_STR_ADR		0
#define CMD_CANC_ADR		1
#define PDU_READ_ADR		3
#define PDU_WRITE_ADR		4

#ifdef CREATE_STRUCTS

const struct ADDR_PARAM_ATS48 addr_params_altistar48[] = {
		400, // ПЕЦХЯРП СОПЮБКЕМХЪ
		402, // ПЮЯЬХПЕММШИ ПЕЦХЯРП СОПЮБКЕМХЪ
		458, // ПЕЦХЯРП ЯНЯРНЪМХЪ
		459, // ПЮЯЬХПЕММШИ ПЕЦХЯРП ЯНЯРНЪМХЪ ╧1
		460, // ПЮЯЬХПЕММШИ ПЕЦХЯРП ЯНЯРНЪМХЪ ╧2
		4200,// БПЕЛЪ ПЮГЦНМЮ
		4102,// гЮЫХРЮ НР НАПШБЮ ТЮГ
};

const struct MENU_PARAM params[] = {
		"   р0.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//0
		"   р1.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//1
		"   р2.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_SIGN|M_RMAX(4),					//2
		"   р3.пегепб    ", "    ", 	0,  65535,  	0, MT_DEC|M_RMAX(4),						//3
		"   р4.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//4
		"   р5.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//5
		"   р6.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//6
		"   р7.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//7
		"   р8.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//8
		"   р9.пегепб    ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//9
		"   р10.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//10
		"   р11.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//11
		"   р12.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//12
		"   р13.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//13
		"   р14.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//14
		"   р15.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//15
		"   р16.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//16
		"   р17.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//17
		"   р18.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//18
		"   р19.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//19
		"   р20.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//20
		"   р21.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//21
		"   р22.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//22
		"   р23.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//23
		"   р24.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//24
		"   р25.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//25
		"   р26.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//26
		"   р27.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//27
		"   р28.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//28
		"   р29.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//29
		"   р30.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//30
		"   р31.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//31
		"   р32.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//32
		"   р33.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//33
		"   р34.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//34
		"   р35.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//35
		"   р36.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//36
		"   р37.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//37
		"   р38.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//38
		"   р39.пегепб   ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//39
		//-------------------------------------------------------------------------
		"B0.лнлемр гюйп  ", "м*л ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//40
		"B1.лнлемр нрйп  ", "м*л ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//41
		"B2.лнл сок гюйп ", "м*л ",	0,     60,	2, M_EDIT|M_KMM|M_RMAX(4),							//42
		"B3.лнл рпнц гюйп", "м*л ", 	0,     60,  	4, M_EDIT|M_KMM|M_RMAX(4),					//43
		"B4.лнл сок нрйп ", "м*л ", 	0,     60,  	2, M_EDIT|M_KMM|M_RMAX(4),					//44
		"B5.лнл рпнц нрйп", "м*л ", 	0,     60,  	4, M_EDIT|M_KMM|M_RMAX(4),					//45
		"B6.рхо гюдбхфйх ", "    ", 	0,      1,  	0, M_LIST|M_SADR(124),						//46
		"B7.рхо сокнрмем ", "    ", 	1,      4,  	1, M_LIST|M_SADR(126),						//47
		"B8.рхо ьрнйю    ", "    ", 	0,      1,  	0, M_LIST|M_SADR(131),						//48
		"B9.гнмю гюйпшрн ", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//49
		"B10.гнмю нрйпшрн", "на  ", 	0,   3000,     10, M_EDIT|M_RMAX(3)|M_PREC(1),				//50
		"B11.гнмю ялеыем ", "на  ", 	0,    100,  	0, M_EDIT|M_RMAX(2)|M_PREC(1),				//51
		"B12.йнд днярсою ", "    ", 	0,  65530,  	0, M_CODE,									//52
		"   B13.бпелъ    ", "    ", 	0,  65530,  	0, M_TIME|M_PWP1|M_PWP1,					//53
		"   B14.дюрю     ", "    ", 	0,  65530,  	0, M_DATE|M_PWP1|M_PWP1,					//54
		"B15.йнпп вюянб  ", "я   ", -300U,    300,  	0, M_EDIT|M_SIGN|M_RMAX(2),					//55
		"B16.хмдхйюж рнйю", "    ", 	0,      1,  	0, M_LIST|M_SADR(133),						//56
		"B17.пефхл лс/дс ", "    ", 	0,      3,  	1, M_LIST|M_SADR(135),						//57
		"B18.хярнв йнл дс", "    ", 	0,      2,  	0, M_LIST|M_SADR(139),						//58
		"B19.акнй гюкхо  ", "    ", 	0,      1,  	0, M_LIST|M_SADR(142),						//59
		"B20.бпелъ йнлюмд", "я   ", 	1,    100,  	1, M_EDIT|M_RMAX(2)|M_PREC(1),				//60
		"B21.рхо бу яхцм ", "    ", 	0,      1,  	0, M_LIST|M_SADR(144),						//61
		"B22.люяй бу яхцм", "    ", 	0,    127,     12, M_BINE|M_RMAX(2),						//62
		"B23.люяй бшу яхц", "    ", 	0,  65530,  	0, M_BINE|M_RMAX(7),						//63
		"B24.яйнп ябъгх  ", "    ", 	0,      6,  	3, M_LIST|M_SADR(146),						//64
		"B25.юдпея ярюмж ", "    ", 	1,    247,  	1, M_EDIT|M_RMAX(1),						//65
		"B26.пефхл ябъгх ", "    ", 	0,      2,  	0, M_LIST|M_SADR(224),						//66
		"B27.бпе япюа лст", "я   ", 	2,    100,      3, M_EDIT|M_RMAX(2)|M_PREC(1),				//67
		"B28.лс/дс ырл   ", "    ", 	0,      1,  	0, M_EDIT|M_RMAX(1),						//68
		"B29.лстр ярюпр  ", "    ", 	0,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//69  20.02.2020 охю ДНАЮБХК ПЮГДЕКЕМХЕ ЛСТРШ МЮ ЯРЮПР Х ДБХФЕМХЕ
		"B30.бпел пюгцнмю", "    ", 	0,    100,     30, M_EDIT|M_RMAX(2)|M_PREC(1),				//70  20,02,2020 охю ДНАЮБХК НОПЕДЕКЕМХЕ БПЕЛЕМХ ПЮГЦНМЮ
		"B31.пеф 3 яей   ", "    ", 	0,  	1,  	0, M_EDIT|M_RMAX(4),						//71
		"B32.бп нря дбхф ", "я   ", 	3,    100,     20, M_EDIT|M_RMAX(2)|M_PREC(1),				//72
		"B33.осрэ сокнрм ", "на  ", 	1,   1000,    100, M_EDIT|M_RMAX(3)|M_PREC(1),				//73
		"B34.леярн сярюмн", "    ", 	0,  	2,  	0, M_EDIT|M_RMAX(4),						//74	// охю 0- НАШВМЮЪ , 1 - ЮЦПЕЦЮРМЮЪ, 2 - ОНФЮПЙЮ
		"B35.пеюй мю ярно", "    ", 	0,      1,  	1, M_EDIT|M_RMAX(4),						//75	 SDV жою
		"B36.рхо рнплнфем", "    ", 	0,      2,  	0, M_EDIT|M_RMAX(0),						//76
		"  B37. R кхмхх  ", "ЛЛ2 ", 	0,  65535,  	1, M_EDIT|M_RMAX(4),						//77
		"  B38. L кхмхх  ", "Л   ", 	0,  65535,  	1, M_EDIT|M_RMAX(4),						//78
		"   B39.йнп мюоп ", "    ", -32000,  32000,  	0, M_EDIT|M_RMAX(4),						//79
		"B40.ьюцнбши пефл", "    ", 	0,      1,  	0, M_LIST|M_SADR(186),						//80
		"B41.йнк-бн ьюцнб", "    ", 	1,     12,  	4, M_EDIT|M_RMAX(2),						//81
		"B42.бпелъ оюсгш ", "я   ", 	1,     60,     15, M_EDIT|M_RMAX(3),						//82
		"   B43.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//83
		"   B44.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//84
		"   B45.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//85
		"   B46.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//86
		"   B47.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//87
		"   B48.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//88
		"   B49.пегепб   ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//89
		//------------------------------------------------------------------
		" я0.йнд днярсою ", "    ",     0,  65530,      0, M_CODE,									//90
		"я1.рхо опхбндю  ", "    ",     0,     30,      0, M_FLST|M_SADR(227),						//91
		"я2.цнд хгцнрнбк ", "    ",     0,     99,     16, M_FACT|M_RMAX(1),						//92
		"я3.гюбнд мнлеп  ", "    ",     0,   9999,      0, M_FACT|M_RMAX(3),						//93
		"я4.люйя лнлемр  ", "йм*л",    10,   6000,     10, M_FACT|M_RMAX(3)|M_PREC(2),				//94
		"я5.мнлхмюкэм рнй", "A   ",     1,   1200,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//95
		"я6.йо педсйрнпю ", "    ",     1,  65530,  20000, M_FACT|M_RMAX(4)|M_PREC(2),				//96
		"C7.айо91        ", "    ",     0,      1,      0, M_FACT|M_RMAX(4),						//97
		"C8.рщй_гюы_гюы  ", "    ",     0,  	1,      0, M_FACT|M_RMAX(4),						//98
		"я9.дюрв унккю   ", "    ",     0,     15,      0, M_BINF|M_RMAX(3),						//99
		"C10.ондбепяхъ он", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//100
		"C11.жхйкш опнцнм", "    ",     0,     50,      0, MT_DEC|M_PWP2|M_RMAX(1),					//101
		"   C12.пегепб   ", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//102
		"я13.пюяяр лстрш ", "    ",     0,    100,      2, M_FACT|M_RMAX(2),						//103
		"C14.рхо дюрв онк", "    ",     0,     16,      0, M_FACT|M_RMAX(1),						//104
		"   C15.пегепб   ", "    ",     0,  65535,      0, M_SHOW|M_RMAX(4),						//105
		"C16.он слнквюмхч", "    ",     0,      1,      0, M_FCOMM|M_SADR(155),						//106
		"C17.о ябъг айо  ", "    ",     0,    120,     30, M_FACT|M_RMAX(4),						//107
		"я18.ла оюсг ярп ", "    ", 	0,    100,     30, M_FACT|M_RMAX(2)|M_PREC(1),				//108
		"я19.бпелъ оюсгш ", "    ",     1,    500,      2, M_FACT|M_RMAX(2)|M_PREC(1),				//109
		"я20.бпелъ рнплнф", "    ",     0,    500,     10, M_FACT|M_RMAX(2)|M_PREC(1),				//110
		"я21.бпелъ д рнпл", "    ", 	0,   2000,    100, M_FACT|M_RMAX(2)|M_PREC(2),				//111
		"я22.гнмю рнплнф ", "    ",-32000U,  32000,      0, M_FACT|M_RMAX(4),						//112
		"C24.соп рнпл айо", "    ",      0,  	 1,      0, M_FACT|M_RMAX(4),						//113
		"   C24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//114
		"   C25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//115
		"   C26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//116
		"   C27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//117
		"   C28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//118
		"   C29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//119
		"   C30.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//120
		"   C31.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//121
		"C32.явер напш яб", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//122   яВЕРВХЙ НАПШБНБ ЯБЪГХ ЛЕФДС айо айщо (ПЕЮКЭМШУ Ю МЕ ОН ЮБЮПХХ)
		"C33.бп псв ярно ", "    ",      2,     30,     10, M_FACT|M_RMAX(4)|M_PREC(1),				//123   рПЕАНБЮМХЕ нАПХЕБЮ ОН ПЮГЛШЙЮМХЧ йбн йбг 04.12.19
		"C34.айо б ябъ дб", "    ",      0,   1000,      3, M_FACT|M_RMAX(4)|M_PREC(1),				//124   пЕЬЕМХЕ ОПНАКЕЛ НАПШБЮ ЯБЪГХ, Б ДБХФЕМХХ 02.12.19
		"я35.йнпп релоеп ", "цпюд",  -100U,    100,      0, M_FACT|M_SIGN|M_RMAX(2),				//125
		"C36.айо бпел ябъ", "    ",      0,   1000,    100, M_FACT|M_RMAX(4)|M_PREC(1),				//126   пЕЬЕМХЕ ОПНАКЕЛ НАПШБЮ ЯБЪГХ, Б ОПНЯРНЕ 02.12.19
		"C37.люяьрюа рнйю", "    ",      0,      1,      0, M_FACT|M_RMAX(4),						//127
		" я38.йнп рнйю U ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//128
		" я39.йнп рнйю V ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//129
		" я40.йнп рнйю W ", "    ",      0,  65530,   4000, M_FACT|M_RMAX(4),						//130
		"я41.ялеы рнйю U ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//131
		"я42.ялеы рнйю V ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//132
		"я43.ялеы рнйю W ", "    ",      0,  65530,  32690, M_FACT|M_RMAX(4),						//133
		" я44.йнп мюоп R ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//134
		" я45.йнп мюоп S ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//135
		" я46.йнп мюоп T ", "    ",      0,  65530,   2000, M_FACT|M_RMAX(4),						//136
		"я47.ялеы мюоп R ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//137
		"я48.ялеы мюоп S ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//138
		"я49.ялеы мюоп T ", "    ",      0,  65530,  32760, M_FACT|M_RMAX(4),						//139
		"я50.оняр.бп.яхм ", "MйC ",      0,    100,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//140
		"я51.оняр.бп.RMS ", "MйC ",      0,    100,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//141
		"я52.йнппейр жюо ", "    ",      0,  65530,   3500, M_FACT|M_RMAX(4),						//142
		"я53.ялеы жюо    ", "    ",      0,  65530,    683, M_FACT|M_RMAX(4),						//143 !!! 683
		"C54.гюы люйя U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//144
		"C55.с люйя U 47%", "B   ",    220,    600,    312, M_FACT|M_RMAX(2),						//145 318
		"C56.T люйя U 47%", "C   ",      1,    200,     20, M_FACT|M_RMAX(2)|M_PREC(1),				//146	20
		"я57.спнб люйя U ", "B   ",    220,    335,    265, M_FACT|M_RMAX(2),						//147
		"я58.бп люйя U м ", "C   ",      1,    200,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//148
		"я59.бпел люйя U ", "C   ",      1,    250,    220, M_FACT|M_RMAX(2)|M_PREC(1),				//149
		"C60.гюы лхм U   ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//150
		"я61.спнб лхм U  ", "B   ",     90,    220,    115, M_FACT|M_RMAX(2),						//151
		"я62.бп лхм U м  ", "C   ",      1,    200,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//152	// PIA 31.01.2020 ВРН АШ МЕ ЛНПЦЮКЮ МЕХЯОП ОПХ НАПШБЕ
		"я63.бпел лхм U  ", "C   ",      1,    250,    220, M_FACT|M_RMAX(2)|M_PREC(1),				//153
		"   C64.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//154
		"   C65.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//155
		"   C66.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//156
		"C67.гюы слем U  ", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//157
		"я68.спнб слем U ", "б   ",      0,    110,     60, M_FACT|M_RMAX(2),						//158
		"C69.нап тюг дбхф", "    ",     10,    500,    195, M_FACT|M_RMAX(2),						//159
		"я70.бпел слем U ", "C   ",      1,    250,      1, M_FACT|M_RMAX(2)|M_PREC(1),				//160
		"   C71.пегпб    ", "    ",      0,  65535,      0, M_FACT|M_RMAX(4),						//161
		"C72.гюы слем I  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//162
		"C73.спнб слем I ", "%   ",     20,    500,    150, M_FACT|M_RMAX(2)|M_PREC(1),				//163
		"C74.бпел слем I ", "C   ",      1,    100,      7, M_FACT|M_RMAX(1)|M_PREC(1),				//164
		"C75.бп-рнй гюы  ", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//165
		"   C76.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//166
		"   C77.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//167
		"   C78.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//168
		"   C79.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//169
		"   C80.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//170
		"   C81.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//171
		"   C82.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//172
		"   C83.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//173
		"   C84.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//174
		"   C85.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//175
		"   C86.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//176
		"   C87.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//177
		"C88.гюыхрю нр йг", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//178
		"я89.бепу сп йг  ", "    ",      0,  65530,  45000, M_FACT|M_RMAX(4),						//179
		"я90. мхфм сп йг ", "    ",      0,  65530,  20000, M_FACT|M_RMAX(4),						//180
		"я91.хмдхй йюкхап", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//181
		"C92.хмд юбю сярп", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//182
		"C93.оепец/оепену", "    ",      0,      1,      1, M_FLST|M_SADR(153),						//183
		"   C94.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//184
		"   C95.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//185
		"   C96.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//186
		"я97.сп бйк ремю ", "цпюд",   -40U,     10,     10, M_FACT|M_SIGN|M_RMAX(2),				//187
		"я98.сп бшйк рем ", "цпюд",   -20U,     50,     30, M_FACT|M_SIGN|M_RMAX(2),				//188
		"я99.пегепб      ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//189
		"я100.пегепб     ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//190
		"я101.пегепб     ", "    ",      0,  3,		     0, M_SHOW|M_RMAX(4),						//191
		"C102.веп тюг дбх", "    ", 	 0,      1,  	 1, M_LIST|M_SADR(153),						//192
		"я103.бп веп тюг ", "я   ",      1,    600,     15, M_FACT|M_RMAX(2)|M_PREC(1),				//193
		"я104.пюя веп тюг", "    ",      0,     75,      3, M_FACT|M_RMAX(1),						//194
		"я105.мехяо лс/дс", "    ",     0,       1,      1, M_FLST|M_SADR(153),						//195
		"я106.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//196
		"я107.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//197
		"C108.йнп гю 30% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//198
		"я109.йнп гю 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//199
		"я110.йнп гю 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//200
		"я111.йнп гю 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//201
		"я112.йнп гю 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//202
		"C113.йнп нр 30% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//203
		"я114.йнп нр 40% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//204
		"я115.йнп нр 60% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//205
		"я116.йнп нр 80% ", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//206
		"я117.йнп нр 110%", "    ",   -20U,     20,      0, M_FACT|M_SIGN|M_RMAX(1),				//207
		"C118.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//208
		"я119.йюк рс нтяе", "    ",      0,      1,      0, M_FDCOM|M_RMAX(1),				        //209
		"рс 220 бйк      ", "    ",      0,  65530,    140, M_FACT|M_RMAX(4),						//210
		"рс 220 бшйк     ", "    ",      0,  65530,     80, M_FACT|M_RMAX(4),						//211
		"рс 24 бйк       ", "    ",      0,  65530,     18, M_FACT|M_RMAX(4),						//212
		"рс 24 бшйк      ", "    ",      0,  65530,      8, M_FACT|M_RMAX(4),						//213
		"рс нрйп йнп U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//214
		"рс нрйп йнп U24 ", "    ",      0,  65530,     75, M_FACT|M_RMAX(4),						//215
		"рс нрйп ялеы U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//216
		"рс гюйп йнп U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//217
		"рс гюйп йнп U24 ", "    ",      0,  65530,     79, M_FACT|M_RMAX(4),						//218
		"рс гюйп ялеы U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//219
		"рс ярно н й U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//220
		"рс ярно н й U24 ", "    ",      0,  65530,     76, M_FACT|M_RMAX(4),						//221
		"рс ярно н ялеы U", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//222
		"рс ярно г й U220", "    ",      0,  65530,   1570, M_FACT|M_RMAX(4),						//223
		"рс ярно г й U220", "    ",      0,  65530,     78, M_FACT|M_RMAX(4),						//224
		"рс ярно г й U220", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//225
		"рс лс   йнп U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//226
		"рс лс   йнп U24 ", "    ",      0,  65530,     79, M_FACT|M_RMAX(4),						//227
		"рс лс   ялеы U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//228
		"рс дс   йнп U220", "    ",      0,  65530,   1600, M_FACT|M_RMAX(4),						//229
		"рс дс   йнп U24 ", "    ",      0,  65530,     77, M_FACT|M_RMAX(4),						//230
		"рс дс   ялеы U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//231
		"рс яаюб йнп U220", "    ",      0,  65530,   1500, M_FACT|M_RMAX(4),						//232
		"рс яаюб йнп U24 ", "    ",      0,  65530,     74, M_FACT|M_RMAX(4),						//233
		"рс яаюб ялеы U  ", "    ",      0,  65530,      0, M_FACT|M_RMAX(4),						//234
		"я145.рс йюкха   ", "    ",      0,      1,      0, M_FDCOM|M_RMAX(1),						//235
		"я146.рс нрйп    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//236
		"я147.рс гюйп    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//237
		"я148.рс ярнонрйп", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//238
		"я149.рс ярногюйп", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//239
		"я150.рс лс      ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//240
		"я151.рс дс      ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//241
		"я152.рс яапнягю ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//242
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//243
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//244
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//245
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//246
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//247
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//248
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//249
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//250
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//251
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//252
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//253
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//254
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//255
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//256
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//257
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//258
		"   я119.пегепб  ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//259
		//------------------------------------------------------------------
		"D0.гюдюмхе гюйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//0 260
		"D1.гюдюмхе нрйп ", "    ",      0,      2,      0, M_COMM|M_SADR(155),						//1 261
		"D2.нанп мю нрйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//2 262
		"D3.нанп мю гюйп ", "на  ",      0,   1000,      0, M_DCOM|M_RMAX(3)|M_PREC(1),				//3 263
		"  D4.пегепб     ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//4 264
		"D5.яапня йюкхап ", "    ",      0,      1,      0, M_COMM|M_SADR(158),						//5 265
		"D6.йнлюмд сопюбк", "    ",      0,     19,      0, M_COMM|M_SADR(160),						//6 266
		" D7.яапня гюыхр ", "    ",      0,      1,      0, M_COMM|M_SADR(160),						//7 267
		" D8.он слнквюмхч", "    ",      0,      1,      0, M_COMM|M_SADR(155),						//8 268
		"   D9.пегепб    ", "    ",      0,  65535,  	0, M_SHOW|M_SADR(4),						//9 269
		"D10.яапня жхйкнб", "    ",      0,      1,     0, M_COMM|M_SADR(160),						//10 270
		"D11.яапня ябъгх ", "    ", 	 0,  	 1,  	0, M_COMM|M_SADR(160),						//11 271
		"   D12.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//12 272
		"   D13.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//13 273
		"   D14.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//14 274
		"   D15.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//15 275
		"   D16.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//16 276
		"   D17.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//17 277
		"   D18.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//18 278
		"   D19.пегепб   ", "    ", 	 0,  65535,  	0, M_SHOW|M_RMAX(4),						//19 279
		//-------------------------------------------------------------------
		"G0.пефхл реярю  ", "    ",      0,      1,      0, M_FACT|M_RMAX(1),						//0 280
		"G1.реяр ябернд  ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//1 281
		"G2.реяр дхя бшу ", "    ",      0,  65530,      0, M_BINFC|M_RMAX(4),						//2 282
		"G3.гмювемхе жюо ", "%   ",      0,   1000,      0, M_FDCOM|M_RMAX(3)|M_PREC(1),			//3 283
		"G4.ярюпр дхяок  ", "    ",      0,      1,      0, M_FDCOM,								//4 284
		"G5.TECT я йюлепш", "    ",      0,  65535,      0, M_BINFC|M_RMAX(4),						//5 285
		"G6.реяр йнмрюйрн", "    ",      0,      3,      0, M_FACT|M_RMAX(4),						//6 286
		"   G7.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//7 287
		"   G8.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//8 288
		"   G9.пегепб    ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//9 289
		"   G10.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//10 290
		"   G11.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//11 291
		"   G12.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//12 292
		"   G13.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//13 293
		"   G14.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//14 294
		"   G15.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//15 295
		"   G16.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//16 296
		"   G17.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//17 297
		"   G18.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//18 298
		"G19.реяр рс бунд", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//19 299
		"G20.реяр рс бшу.", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//20 300
		"G21.юйрб реяр рс", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//21 301
		"   G22.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//22 302
		"   G23.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//23 303
		"   G24.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//24 304
		"   G25.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//25 305
		"   G26.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//26 306
		"   G27.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//27 307
		"   G28.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//28 308
		"   G29.пегепб   ", "    ",      0,  65535,      0, M_SHOW|M_RMAX(4),						//29 309
		//-------------------------------------------------------------------
		"янярнъмхе йюкхап", "    ",      0,      3,      0, M_HIDE,							//0 310
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//1 311
		"онкнф гюйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//2 312
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//3 313
		"онкнф нрйпшрн 1 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//4 314
		"онкнф гюйпшрн 2 ", "    ",      0,  65535,      0, M_HIDE|M_RMAX(4),						//5 315
		"    оюпнкэ 1    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//6 316
		"    оюпнкэ 2    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//7 317
		"   юбюпхх йг    ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//8 318
		"гюохяэ лстрш    ", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//9 319
		"м10.явервхй жхйк", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//10 320
		"гюохяэ рело айо ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//11 321
		"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//12 322
		"H13.рхо айо     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//13 323
		"   H14.дюрю     ", "    ", 	 0,  65530,  	 0, M_HIDE|M_RMAX(4),						//14 324
		//"   2.пегепб     ", "    ", 	 0,  65535,  	 0, M_HIDE|M_RMAX(4),						//15 325
		"  рнй оепеундю  ", "%   ",      0,   3000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//16 326
		" лнлемр рнй 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//17 327
		" лнлемр рнй 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//18 328
		" лнлемр рнй 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//19 329
		" лнлемр рнй 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//20 330
		" лнлемр рнй 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//21 331
		" лнлемр рнй 0_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//22 332
		" лнлемр рнй 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//23 333
		" лнлемр рнй 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//24 334
		" лнлемр рнй 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//25 335
		" лнлемр рнй 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//26 336
		" лнлемр рнй 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//27 337
		" лнлемр рнй 1_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//28 338
		" лнлемр рнй 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//29 339
		" лнлемр рнй 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//30 340
		" лнлемр рнй 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//31 341
		" лнлемр рнй 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//32 342
		" лнлемр рнй 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//33 343
		" лнлемр рнй 2_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//34 344
		" лнлемр рнй 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//35 345
		" лнлемр рнй 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//36 346
		" лнлемр рнй 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//37 347
		" лнлемр рнй 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//38 348
		" лнлемр рнй 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//39 349
		" лнлемр рнй 3_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//40 350
		"лнлемр сцнк 0_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//41 351
		"лнлемр сцнк 0_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//42 352
		"лнлемр сцнк 0_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//43 353
		"лнлемр сцнк 0_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//44 354
		"лнлемр сцнк 0_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//45 355
		"лнлемр сцнк 0_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//46 356
		"лнлемр сцнк 1_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//47 357
		"лнлемр сцнк 1_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//48 358
		"лнлемр сцнк 1_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//49 359
		"лнлемр сцнк 1_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//50 360
		"лнлемр сцнк 1_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//51 361
		"лнлемр сцнк 1_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//52 362
		"лнлемр сцнк 2_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//53 363
		"лнлемр сцнк 2_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//54 364
		"лнлемр сцнк 2_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//55 365
		"лнлемр сцнк 2_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//56 366
		"лнлемр сцнк 2_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//57 367
		"лнлемр сцнк 2_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//58 368
		"лнлемр сцнк 3_0 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//59 369
		"лнлемр сцнк 3_1 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//60 370
		"лнлемр сцнк 3_2 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//61 371
		"лнлемр сцнк 3_3 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//62 372
		"лнлемр сцнк 3_4 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//63 373
		"лнлемр сцнк 3_5 ", "%   ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//64 374
		" сцнк яхтс 0_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//65 375
		" сцнк яхтс 0_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//66 376
		" сцнк яхтс 0_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//67 377
		" сцнк яхтс 0_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//68 378
		" сцнк яхтс 0_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//69 379
		" сцнк яхтс 0_5  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//70 380
		" сцнк яхтс 1_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//71 381
		" сцнк яхтс 1_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//72 382
		" сцнк яхтс 1_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//73 383
		" сцнк яхтс 1_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//74 384
		" сцнк яхтс 1_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//75 385
		" сцнк яхтс 1_5  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//76 386
		" сцнк яхтс 2_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//77 387
		" сцнк яхтс 2_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//78 388
		" сцнк яхтс 2_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//79 389
		" сцнк яхтс 2_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//80 390
		" сцнк яхтс 2_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//81 391
		" сцнк яхтс 2_5  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//82 392
		" сцнк яхтс 3_0  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//83 393
		" сцнк яхтс 3_1  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//84 394
		" сцнк яхтс 3_2  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//85 395
		" сцнк яхтс 3_3  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//86 396
		" сцнк яхтс 3_4  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//87 397
		" сцнк яхтс 3_5  ", "цпюд",      0,    180,      0, M_HIDE|M_RMAX(2),						//88 398
		"йнлюмдш рс      ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//89 399
		"япедмее мюоп    ", "B   ",      0,    500,      0, M_HIDE|M_RMAX(2),						//90 400
		"85.релоепюр айо ", "цпюд",  -100U,    100,      0, M_HIDE|M_RMAX(2),						//91 401
		"япедмхи рнй %   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//92 402
		"  рнй тюгш U %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//93 403
		"  рнй тюгш V %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//94 404
		"  рнй тюгш W %  ", "  % ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//95 405
		" япедмхи рнй    ", "A/% ",      0,   8000,      0, M_HIDE|M_RMAX(3)|M_PREC(1),					//96 406
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//97 407
		"  онкнфемхе     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//98 408
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//99 409
		"     онкм унд   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//100 410
		" рхо пебепяю    ", "    ",      0,      2,      2, M_HIDE|M_RMAX(2),						//101 411
		"окнухе гюд 2 йцж", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//102 412
		"окнухе гюд 200цж", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//103 413
		"окнухе гюд 50цж1", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//104 414
		"окнухе гюд 50цж2", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//105 415
		"окнухе гюд 50цж3", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//106 416
		"окнухе гюд 10 цж", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//107 417
		"яапня окнуху гюд", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//108 418
		"бпелъ опнжеяянпм", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//109 419
		"мнлеп яохяйю гюд", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//110 420
		"  мнлеп гюдювх  ", "    ",      0,  65530,      0, MT_DEC|M_NVM|M_RMAX(4),					//111 421
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//112 408
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//113 408
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//114 408
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//115 408
		"     пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//116 408
		"мюв юдп фспм яна", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//117 427
		"мюв юдп фспм йнл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//118 428
		"мюв юдп фспм оюп", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//119 429
		"мюв юдп фспм яхл", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//123 433
		"гюохях фспм яна ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//120 430
		"гюохях фспм йнл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//121 431
		"гюохях фспм оюп ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//122 432
		"гюохях фспм яхл ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//124 434
		"    яейсмдш     ", "    ",      0,  	60,      0, M_HIDE|M_RMAX(1),						//125 435
		"соп йнмрюйрнпюлх", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//126 436
		"  йнлюмдш асп   ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//127 437
		" яапня фспмюкнб ", "    ",      0,  1,          0, MT_DEC|M_RMAX(4),						//128 438
		"м129.хмдхй айо  ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//129 439
		"130 онкнфем     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//130 440
		"131. гнмю ялеыем", "    ",      0,  65530,      0, MT_DEC|M_RMAX(4),						//131 441
		"3    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//132 442
		"4    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//133 443
		"5    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//134 444
		"6    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//135 445
		"7    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//136 446
		"8    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//137 447
		"9    пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//138 448
		"10   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//139 449
		"11   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//140 450
		"12   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//141 451
		"13   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//142 452
		"14   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//143 453
		"15   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//144 454
		"16   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//145 455
		"17   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//146 456
		"18   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//147 457
		"19   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//148 458
		"20   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//149 459
		"21   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//150 460
		"22   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//151 461
		"23   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//152 462
		"24   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//153 463
		"25   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//154 464
		"26   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//155 465
		"27   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//156 466
		"28   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//157 467
		"29   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//158 468
		"30   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//159 469
		"31   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//160 470
		"32   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//161 471
		"33   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//162 472
		"34   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//163 473
		"35   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//164 474
		"36   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//165 475
		"37   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//166 476
		"38   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//167 477
		"39   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//168 478
		"40   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//169 479
		"41   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//170 480
		"42   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//171 481
		"43   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//172 482
		"44   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//173 483
		"45   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//174 484
		"46   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//175 485
		"47   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//176 486
		"48   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//177 487
		"49   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//178 488
		"50   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//179 489
		"51   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//180 490
		"52   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//181 491
		"53   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//182 492
		"54   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//183 493
		"55   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//184 494
		"56   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//185 495
		"57   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//186 496
		"58   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//187 497
		"59   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//188 498
		"60   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),						//189 499
		"60   пегепб     ", "    ",      0,  65530,      0, M_HIDE|M_RMAX(4),
		//------------------------------------------------------------------------------------------------
		"ю0.ярюрся пюанрш", "    ",		0,	65530,		0, M_RUNS|M_SADR(1),						//0 500
		"ю1.дхюц опнжеяяю", "    ",		0,	65530,		0, M_RUNS|M_SADR(18),						//1 501
		"ю2.дхюцмняр яерх", "    ",		0,	65530,		0, M_RUNS|M_SADR(35),						//2 502
		"ю3.дхюц мюцпсгйх", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(52),						//3 503
		"ю4.дхюцм сярп-бю", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(69),						//4 504
		" ю5.яняр бунднб ", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(86),						//5 505
		" ю6.яняр бшунднб", "    ", 	0,  65530,  	0, M_RUNS|M_SADR(103),						//6 506
		"  ю7.онкнфемхе  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7 507
		"   ю8.лнлемр    ", "м*л ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//8 508
		"   ю9.яйнпнярэ  ", "на/л",-3600U,   3600,  	0, M_SHOW|M_SIGN|M_RMAX(3),					//9 509
		"ю10.мюоп тюгш R ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//10 510
		"ю11.мюоп тюгш S ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//11 511
		"ю12.мюоп тюгш T ", "б   ", 	0,    500,  	0, M_SHOW|M_RMAX(2),						//12 512
		" ю13.рнй тюгш U ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//13 513
		" ю14.рнй тюгш V ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//14 514
		" ю15.рнй тюгш W ", "ю/% ", 	0,   8000,  	0, M_SHOW|M_RMAX(3)|M_PREC(1),				//15 515
		"ю16.сцнк мюцпсг ", "цпюд", -180U,    180,  	0, M_SHOW|M_SIGN|M_RMAX(2),					//16 516
		"ю17.ярюрся йюкха", "    ", 	0,      3,  	0, M_STAT|M_SADR(120),						//17 517
		"A18.онкнфемхе % ", "%   ",-1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//18 518
		" ю19.онкмши унд ", "на  ",     0,   3000,      0, M_SHOW|M_RMAX(3)|M_PREC(1),				//19 519
		"ю20.рейсыхи унд ", "на  ",-3000U,   3000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//20 520
		"ю21.явер жхйкнб ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(4),						//21 521
		"ю22.релоепюрспю ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//22 522
		"ю23.релоеп айо  ", "цпюд", -100U,    100,      0, M_SHOW|M_SIGN|M_RMAX(2),					//23 523
		"ю24.бепяхъ он   ", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(3),				//24 524
		"ю25.бепяхъ онайо", "    ", 	0,  65530,  	0, M_SHOW|M_RMAX(3)|M_PREC(2),				//25 525
		"ю26.оюдем мюоп  ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//26 526
		"ю27.йнк.яанеб до", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//27 527
		"ю28.релоеп щдайо", "цпюд", -300U,    300,      0, M_SHOW|M_SIGN|M_RMAX(2),					//28 528
		"ю29.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//29 529
		"ю30.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//30 530
		"ю31.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//31 531
		"ю32.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//32 532
		"ю33.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//33 533
		"ю34.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//34 534
		"ю35.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//35 535
		"ю36.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//36 536
		"ю37.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//37 537
		"ю38.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//38 538
		"ю39.пегепб      ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//39 539
		//--------------------------------------------------------------------------------------------------
		"ATS1.пегепб     ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//0 540
		"ATS2.пегепб     ", "    ", 	0,  65535,  	0, M_EDIT|M_RMAX(4),						//1 541
		"ATS3.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//2 542
		"ATS4.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//3 543
		"ATS5.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//4 544
		"ATS6.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//5 545
		"ATS7.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//6 546
		"ATS8.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//7 547
		"ATS9.пегепб     ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//8 548
		"ATS10.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//9 549
		"ATS11.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//10 550
		"ATS12.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//11 551
		"ATS13.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//12 552
		"ATS14.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//13 553
		"ATS15.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//14 554
		"ATS16.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//15 555
		"ATS17.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//16 556
		"ATS18.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//17 557
		"ATS19.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//18 558
		"ATS20.пегепб    ", "    ", 	0,  65535,  	0, M_SHOW|M_RMAX(4),						//19 559
		//--------------------------------------------------------------------------------------------------
		"     бпелъ      ", "    ",      0,  65535,      0, M_TIME|M_RONLY,							//T
		"      дюрю      ", "    ",      0,  65535,     33, M_DATE|M_RONLY,							//D
		"E0.ярюрся пюанрш", "    ",      0,  65535,      0, M_RUNS|M_SADR(1),						//0
		"E1.дхюцм опнжеяя", "    ",      0,  65535,      0, M_RUNS|M_SADR(18),						//1
		"E2.дхюцмняр яерх", "    ",      0,  65535,      0, M_RUNS|M_SADR(35),						//2
		"E3.дхюцм мюцпсгй", "    ",      0,  65535,      0, M_RUNS|M_SADR(52),						//3
		"E4.дхюцм сярп-бю", "    ",      0,  65530,      0, M_RUNS|M_SADR(69),						//4
		"E5.онкнфемхе %  ", "%   ", -1000U,   2000,      0, M_SHOW|M_SIGN|M_RMAX(3)|M_PREC(1),		//5
		"    E6.лнлемр   ", "м*л ",     10,  11000,     10, M_SHOW|M_RMAX(4),						//6
		"E7.мюопъф тюгш R", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//7
		"E8.мюопъф тюгш S", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//8
		"E9.мюопъф тюгш T", "B   ",      0,    500,      0, M_SHOW|M_RMAX(2),						//9
		"E10.рнй тюгш U  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//10
		"E11.рнй тюгш V  ", "ю/% ", 	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//11
		"E12.рнй тюгш W  ", "ю/% ",  	 0,   8000,  	 0, M_SHOW|M_RMAX(3)|M_PREC(1),				//12
		"E13.релоеп акнй ", "цпюд",   -100U,    100,     0, M_SHOW|M_SIGN|M_RMAX(2),				//13
		"E14.яняр бунднб ", "    ",      0,  65535,      0, M_RUNS|M_SADR(86),						//14
		"E15.яняр бшунднб", "    ",      0,  65535,      0, M_RUNS|M_SADR(103),						//15
		"   E16.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//16
		"   E17.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//17
		"   E18.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//18
		"   E19.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//19
		"   E20.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//20
		"   E21.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//21
		"   E22.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//22
		"   E23.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//23
		"   E24.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//24
		"   E25.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//25
		"   E26.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//26
		"   E27.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//27
		"   E28.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4),						//28
		"   E29.пегепб   ", "    ", 	 0,  65535,  	 0, M_SHOW|M_RMAX(4)						//29
};

const struct MENU_STRING values[] = {
	"    гюохяэ      ",	// 0
//----------------
	"  ме нопедекем  ",	// 1
	"      ярно      ",	// 2
	"     юбюпхъ     ",	// 3
	" хдер гюйпшрхе  ",	// 4
	" хдер нрйпшрхе  ",	// 5
	"   хдер реяр    ",	// 6
	"    гюйпшрн     ",	// 7
	"    нрйпшрн     ",	// 8
	"     лстрю      ",	// 9
	" леярмне сопюбк ",	// 10
	"  бйкчвем рем   ",	// 11
	"BLUETOOTH бйк   ",	// 12
	"юбюпхъ мю акнйе ",	// 13
	"  юбюпхъ мю ря  ",	// 14
	"  мехяопюбмнярэ ",	// 15
	"мехяопюбм мю акй",	// 16
	"мехяопюбм мю ря ",	// 17
//--------------------------
	"   мер юбюпхи   ",	// 18
	"  мер дбхфемхъ  ",	// 19
	"  веп тюг дбхц  ",	// 20
	" ме гюдюмн гюйп ",	// 21
	" ме гюдюмн нрйп ",	// 22
	" мер йюкхапнбйх ",	// 23
	"сокнрм ме днярхц",	// 24
	"     лстрю      ",	// 25
	"  мехяоп лс/дс  ",	// 26
	"     пегепб     ",	// 27
	"     пегепб     ",	// 28
	"     пегепб     ",	// 29
	"     пегепб     ",	// 30
	"     пегепб     ",	// 31
	"     пегепб     ",	// 32
	"     пегепб     ",	// 33
	"     пегепб     ",	// 34
//--------------------------
	"   мер юбюпхи   ",	// 35
	"лхм мюоп тюгш R ",	// 36
	"лхм мюоп тюгш S ",	// 37
	"лхм мюоп тюгш T ",	// 38
	"люйя мюоп тюгш R",	// 39
	"люйя мюоп тюгш S",	// 40
	"люйя мюоп тюгш T",	// 41
	"меноп вепед тюг ",	// 42
	"меаюкюмя/напшб U",	// 43
	"слем мюоп тюгш R",	// 44
	"слем мюоп тюгш S",	// 45
	"слем мюоп тюгш T",	// 46
	"мюоп тюгш R 47% ",	// 47
	"мюоп тюгш S 47% ",	// 48
	"мюоп тюгш T 47% ",	// 49
	"  веп тюг яерх  ",	// 50
	"     пегепб     ",	// 51
//--------------------------
	"   мер юбюпхи   ",	// 52
	"  напшб тюгш U  ",	// 53
	"  напшб тюгш V  ",	// 54
	"  напшб тюгш W  ",	// 55
	"бп-рнй оепецпсгй",	// 56
	"     пегепб     ",	// 57
	"   йг тюгш U    ",	// 58
	"   йг тюгш V    ",	// 59
	"   йг тюгш W    ",	// 60
	"     пегепб     ",	// 61
	"     пегепб     ",	// 62
	" лхмхлюкэм рнй  ",	// 63
	" меаюкюмя рнйю  ",	// 64
	"     пегепб     ",	// 65
	"     пегепб     ",	// 66
	"     пегепб     ",	// 67
	"     пегепб     ",	// 68
	//---------------------------------------------------------------------------
	"   мер юбюпхи   ",	// 69
	"яани дюрв онкнф ",	// 70
	" яани оюлърх 1  ",	// 71
	" яани оюлърх 2  ",	// 72
	"   яани вюянб   ",	// 73
	"яани дюрв релоеп",	// 74
	" оепецпеб айо   ",	// 75
	"оепенукюфд айо  ",	// 76
	"оепецпеб айд    ",	// 77
	"оепенукюфд айд  ",	// 78
	"яани жюо        ",	// 79
	"бшйкчвемхе айд  ",	// 80
	"йпхр оепецпеб ак",	// 81
	"     пегепб     ",	// 82
	"     пегепб     ",	// 83
	"     пегепб     ",	// 84
	"     пегепб     ",	// 85
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 86
	"  бунд нрйпшрэ  ",	// 87
	"  бунд гюйпшрэ  ",	// 88
	"   бунд ярно    ",	// 89
	"    бунд лс     ",	// 90
	"    бунд дс     ",	// 91
	"     пегепб     ",	// 92
	"     пегепб     ",	// 93
	"     пегепб     ",	// 94
	"     пегепб     ",	// 95
	"     пегепб     ",	// 96
	"     пегепб     ",	// 97
	"     пегепб     ",	// 98
	"     пегепб     ",	// 99
	"     пегепб     ",	// 100
	"     пегепб     ",	// 101
	"     пегепб     ",	// 102
	//---------------------------------------------------------------------------
	"  мер яхцмюкнб  ",	// 103
	"    юбюпхъ      ",	// 104
	"    гюйпшрн     ",	// 105
	"    нрйпшрн     ",	// 106
	"     лстрю      ",	// 107
	"  гюйпшбюеряъ   ",	// 108
	"  нрйпшбюеряъ   ",	// 109
	"     лс/дс      ",	// 110
	"  мехяопюбмнярэ ",	// 111
	"     пегепб     ",	// 112
	"     пегепб     ",	// 113
	"     пегепб     ",	// 114
	"     пегепб     ",	// 115
	"     пегепб     ",	// 116
	"     пегепб     ",	// 117
	"     пегепб     ",	// 118
	"     пегепб     ",	// 119
	//---------------------------------------------------------------------------
	" мер йюкхапнбйх ",	// 120
	" гюдюмн гюйпшрн ",	// 121
	" гюдюмн нрйпшрн ",	// 122
	"йюкхап бшонкмемю",	// 123
	//---------------------------------------------------------------------------
	"    йкхмнбюъ    ",	// 124
	"    ьхаепмюъ    ",	// 125
	//---------------------------------------------------------------------------
	"  ме нопедекем  ",	// 126
	" аег сокнрмемхъ ",	// 127
	"сокнрмемхе гюйп ",	// 128
	"сокнрмемхе нрйп ",	// 129
	"сок гюйп х нрйп ",	// 130
	//---------------------------------------------------------------------------
	"   мнплюкэмши   ",	// 131
	"    напюрмши    ",	// 132
	//---------------------------------------------------------------------------
	"деиярб гмювемхъ ",	// 133
	"опнжемрш нр мнл ",	// 134
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 135
	"  бшанп пефхлю  ",	// 136
	"    пефхл лс    ",	// 137
	"    пефхл дс    ",	// 138
	//---------------------------------------------------------------------------
	" бяе хмрептеияш ",	// 139
	"рнкэйн дхяйперм ",	// 140
	"рнкэйн онякеднб ",	// 141
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 142
	"    бйкчвемю    ",	// 143
	//---------------------------------------------------------------------------
	"      24б       ",	// 144
	"      220б      ",	// 145
	//---------------------------------------------------------------------------
	"    2400 анд    ",	// 146
	"    4800 анд    ",	// 147
	"    9600 анд    ",	// 147
	"   19200 анд    ",	// 149
	"   38400 анд    ",	// 150
	"   57600 анд    ",	// 151
	"   115200 анд   ",	// 152
	//---------------------------------------------------------------------------
	"   бшйкчвемю    ",	// 153
	"хмдхй х нярюмнб ",	// 154
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 155
	"     гюдюрэ     ",	// 156
	"    яапняхрэ    ",	// 157
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 158
	"    яапняхрэ    ",	// 159
	//---------------------------------------------------------------------------
	"  мер йнлюмдш   ",	// 160
	"      ярно      ",	// 161
	"    гюйпшрэ     ",	// 162
	"    нрйпшрэ     ",	// 163
	"  гюйпшрэ реяр  ",	// 164
	"  нрйпшрэ реяр  ",	// 165
	"     пегепб     ",	// 166
	"     пегепб     ",	// 167
	"     пегепб     ",	// 168
	"     пегепб     ",	// 169
	"     пегепб     ",	// 170
	"     пегепб     ",	// 171
	"     пегепб     ",	// 172
	"     пегепб     ",	// 173
	"     пегепб     ",	// 174
	"     пегепб     ",	// 175
	"     пегепб     ",	// 176
	"     пегепб     ",	// 177
	"     пегепб     ",	// 178
	"     пегепб     ",	// 179
	//---------------------------------------------------------------------------
	" ме нопедекемн  ",	// 180
	"напюрм онякеднб ",	// 181
	"опълюъ онякеднб ",	// 182
	//---------------------------------------------------------------------------
	"    нярюмнб     ",	// 183
	" юбрнлюрхвеяйхи ",	// 184
	"  хцмнпхпнбюмхе ", // 185
	//---------------------------------------------------------------------------
	"    бшйкчвем    ",	// 186
	"    бйкчвем     ",	// 187
	//---------------------------------------------------------------------------
	"мнпл пюгнлймсрши",	// 188
	" мнпл гюлймсрши ",	// 189
	//---------------------------------------------------------------------------
	" ярюрся пюанрш  ",	// 190
	" дхюцм опнжеяяю ",	// 191
	" дхюцмняр яерх  ",	// 192
	" дхюцм мюцпсгйх ",	// 193
	" дхюцм сярп-бю  ",	// 194
	"  яняр бунднб   ",	// 195
	"  яняр бшунднб  ",	// 196
	"     пегепб     ",	// 197
	"     лнлемр     ",	// 198
	"    яйнпнярэ    ",	// 199
	"  япедмее мюоп  ",	// 200
	"  япедмхи рнй   ",	// 201
	" сцнк мюцпсгйх  ",	// 202
	"     пегепб     ",	// 203
	"     пегепб     ",	// 204
	"     пегепб     ",	// 205
	"     пегепб     ",	// 206
	"     пегепб     ",	// 207
	"     пегепб     ",	// 208
	"     пегепб     ",	// 209
	"     пегепб     ",	// 210
	"     пегепб     ",	// 211
	"     пегепб     ",	// 212
	"     пегепб     ",	// 213
	"     пегепб     ",	// 214
	"     пегепб     ",	// 215
	"     пегепб     ",	// 216
	"     пегепб     ",	// 217
	"     пегепб     ",	// 218
	"     пегепб     ",	// 219
	//----------------------------------------------
	"  он сярюбйюл   ",	// 220
	"он сяр я гюдепфй",	// 221
	" бяецдю бйк     ",	// 222
	" псвмне соп     ",	// 223
	//-----------------------------------------------
	"  аег опнбепйх  ",	// 224
	" мю мевермнярэ  ",	// 225
	"  мю вермнярэ   ",	// 226
   //-----------------------------------------------
    "ме нопедекем    ",	// 227
	"щож-100 ю.25    ",	// 228
	"щож-100 ю.50    ",	// 229
	"щож-400 а.20    ",	// 230
	"щож-400 а.40    ",	// 231
	"щож-800 б.40    ",	// 232
	"щож-1000 б.20   ",	// 233
	"щож-4000 ц.9    ",	// 234
	"щож-4000 ц.18   ",	// 235
	"щож-10000 д.6   ",	// 236
	"щож-10000 д.12  ",	// 237
	"щож-10000 д.10  ",	// 238
	"щож-15000 д.10  ",	// 239
	"щож-20000 F.40  ",	// 240
	"щож-35000 F.48  ",	// 241
	"щож-50000 F.48  ",	// 242
	"щож-4й  ц.18 с2 ",	// 242
	"щож-10й д.12 с2 ",	// 242
	"щогп-2000       ",	// 242
	"щогп-4000       "	// 242
};

const struct MENU_STRING AddStr[] = {
	"сярпниярб гюмърн",	// 0
	"    йнлюмдю     ",	// 1
	"    нрлемемю    ",	// 2
	"  о 999.99%     ",	// 3
	//-----------------------------------------------
	"щйяо. мюярпнийю?",	// 4	0
	"    дю  мер     ",	// 5
	" гюдюрэ лнлемр  ",	// 6	1
	"йюкхапнбйх  нй  ",	// 7
	" рхо йюкхапнбйх ",	// 8	2
	" псвм  йнк.нанп ",	// 9
	"оепебедх б онкнф",	// 10	3
	" гюйпшрн   нй   ",	// 11
	"оепебедх б онкнф",	// 12	4
	" нрйпшрн   нй   ",	// 13
	"оепебедх б йпюим",	// 14	5
	"онкнфемхе   нй  ",	// 15
	"   онкнфемхе    ",	// 16	6
	"   гюйп  нрйп   ",	// 17
	"опнбепхрэ йюкха?",	// 18	7
	"    дю  мер     ", // 19
	"   осярхре б    ",	// 20	8
	"    нрйпшрн     ", // 21
	"   онкнфемхе    ",	// 22	9	// гДЕЯЭ БШБНДЪРЯЪ РЕЙСЫХЕ НАНПНРШ
	"                ", // 23
	"яапня йюкхапнб? ",	// 24	10
	"    дю  мер     ", // 25
	"   осярхре б    ",	// 26	11
	"    гюйпшрн     ", // 27
	" сярпюхб йюкха? ",	// 28	12
	"    дю  мер     ", // 29
	"гюдюире пюанвхе ",	// 30	13
	"  лнлемрш   нй  ", // 31
};

#endif

#endif




