/*======================================================================
Имя файла:          g_Ram.h
Автор:
Версия файла:
Дата изменения:
Описание:
Описание главной структуры
========================================================================*/

#ifndef G_RAM_
#define G_RAM_

#include "config.h"				// Структуры
#include "g_Structs.h"			// Структуры
#include "peref_Clock.h"		// Библиотека для преобразований чисел/строк
#include "core.h"
#include "comm.h"
#include "add_ValueConv.h"
#include "peref_LedsDrv.h"
//#include "core_Protections.h" 	//структура защит
//#include "comm_LocalControl.h"

// Команда управления
typedef enum {
  genNone=0,		// Нет команды
  genStop,		
  genOpen,	
  genClose,		
  genRzvd1,
  genRzvd2,
  genResetProtect,
  genOnDU,	
  genOnMU,		
  genInTest_ON,
  genInTest_OFF,
  genOutTest_ON,
  genOutTest_OFF	
} TCommand;

//-------------------------------------------------------------------------
typedef union _TTek_TechReg
{
	Uns all;
	struct
	{
		Uns Opened:1;		// 0
		Uns Closed:1;		// 1
		Uns Mufta1:1;		// 2
		Uns Rsvd1:4;		// 3-6
		Uns MuDu:1;			// 7
		Uns Opening:1;		// 8
		Uns Closing:1;		// 9
		Uns Stop:1;			// 10
		Uns KVO:1;			// 11
		Uns KVZ:1;			// 12
		Uns Ten:1;			// 13
		Uns Rsvd14:1;		// 14
		Uns Ready:1;		// 15
	} bit;
} TTek_TechReg;

typedef union _TTek_DefReg
{
	Uns all;
	struct
	{	// БУ50
	    /*Uns Rsvd5:1;		// 0
		Uns ShC:1;		// 1	короткое замыкание
		Uns I2t:1;		// 2	времятоковая защита
		Uns Rsvd3:1;		// 3
		Uns Phl:1;		// 4	Резерв
		Uns Rsvd1:5;		// 5-9
		Uns Uv:1;		// 10	пониженное напряжение входной сети
		Uns Th:1;		// 11	Перегрев блока
		Uns Tl:1;		// 12
		Uns Ov:1;		// 13	Повышенное напряжение входной сети
		Uns Rsvd2:1;		// 14
		Uns NoCalib:1;  	// 15*/
		// БУР
		Uns I2t:1;			// 0	времятоковая защита
		Uns ShC:1;			// 1	короткое замыкание
		Uns Drv_T:1;		// 2	перегрев электродвигателя
		Uns Uv:1;			// 3	пониженное напряжение входной сети
		Uns Phl:1;			// 4	Резерв
		Uns NoMove:1;		// 5	Отсутствие движения
		Uns Ov:1;			// 6	Повышенное напряжение входной сети
		Uns Bv:1;			// 7	Обрыв фаз входной сети
		Uns Rsvd:1;			// 8	Резерв
		Uns Th:1;			// 9	Перегрев блока
		Uns Tl:1;			// 10
		Uns Rsvd1:1;		// 11
		Uns PhOrdU:1;		// 12	Неверное чередование фаз сети
		Uns PhOrdDrv:1;		// 13	Неверное чередование фаз двигателя
		Uns DevDef:1;		// 14
		Uns NoCalib:1;		// 15
	} bit;
} TTek_DefReg;

typedef union _TTEK_FaultReg
{
	Uns all;
	struct
	{
		Uns NoCalib:1;		// 0 	Время-токовая защита
		Uns MuDu:1;			// 1 	Короткое замыкание
		Uns Uv:1;			// 2 	Перегрев двигателя
		Uns Ov:1;			// 3 	Пониженеое напряжение фаз сети
		Uns Vsk:1;			// 4 	Обрыв фазы электродвигателя
		Uns Bv:1;			// 5 	Нет движения
		Uns ThErr:1;		// 6 	Перенапряжение на входе
		Uns Tl:1;			// 7 	Критическое снижение напряжения на входе
		Uns DevDef:1;		// 8 	Резерв
		Uns Rsvd1:1;		// 9  	Перегрев блока
		Uns Rsvd2:1;		// 10 	Переохлождение блока
		Uns Rsvd3:1;		// 11 	Резерв
		Uns Rsvd4:1;		// 12   Неверное чередование фаз сети
		Uns Rsvd5:1;		// 13   Чередование фаз двигателя
		Uns Rsvd6:1;		// 14 	Дефект устройства (кроме перегрева и переохлаждения)
		Uns Rsvd7:1;		// 15 	Резерв
	} bit;
} TTEK_FaultReg;

typedef union _TTek_ComReg
{
	Uns all;
	struct
	{
		Uns Stop:1;				// 0
		Uns Open:1;				// 1
		Uns Close:1;				// 2
		Uns Rsvd:2;				// 3-4
		Uns PrtReset:1;				// 5
		Uns Rsvd1:2;				// 6-7
		Uns EnDiscrInTest:1; 	// 8
		Uns DisDiscrInTest:1; 	// 9
		Uns EnDiscrOutTest:1;	// 10
		Uns DisDiscrOutTest:1; 	// 11
		Uns Rsvd2:4;			// 12-15
	} bit;
} TTek_ComReg;

typedef union _TTek_Discrete
{
	Uns all;
	struct
	{
		Uns InOpen:1;			// 0
		Uns InClose:1;			// 1
		Uns InStop:1;			// 2
		Uns InMu:1;				// 3
		Uns InDu:1;				// 4
		Uns OutOpened:1;		// 5
		Uns OutClosed:1;		// 6
		Uns OutMufta:1;			// 7
		Uns OutFault:1;			// 8
		Uns OutOpening:1;		// 9
		Uns OutClosing:1;		// 10
		Uns OutMuDu:1;			// 11
		Uns OutNeispr:1;		// 12
		Uns Rsvd:1;				// 13
		Uns IsDiscrOutActive:1;	// 14
		Uns IsDiscrInActive:1;	// 15
	} bit;
} TTek_Discrete;
//----------------------------------------------------*--------------------------

// ПАРАМЕТРЫ НАСТРОЙКИ
// Группа A (Адрес = 500, Количество = 40) - Диагностика - просмотр
typedef struct _TRamGroupA
{
	TStatusReg      Status;         // 0. 500 Статус работы
	TFltUnion	    Faults;	        // 1-4. 501-504 Аварии
	TInputReg       StateTu;     	// 5. 505 Состояние дискретных входов
	TOutputReg      StateTs;	    // 6. 506 Состояние дискретных выходов
	Uns             Position;       // 7. 507 Положение
	Uns             Torque;         // 8. 508 Момент
	Int             Speed;		    // 9. 509 Скорость
	Uns             Ur;             // 10. 510 Напряжение фазы R
  	Uns             Us;             // 11. 511 Напряжение фазы S
  	Uns             Ut;             // 12. 512 Напряжение фазы T
	Uns             Iu;             // 13. 513 Ток фазы U
	Uns             Iv;             // 14. 514 Ток фазы V
	Uns             Iw;             // 15. 515 Ток фазы W
	Int             AngleUI;        // 16. 516 Угол нагрузки
	TCalibState     CalibState;     // 17. 517 Статус калибровки
	Int             PositionPr;     // 18. 518 Положение %
	Uns             FullWay;        // 19. 519 Полный ход
	Int             CurWay;         // 20. 520 Текущий ход
	Uns             CycleCnt;       // 21. 521 Счетчик циклов
	Int             Temper;         // 22. 522 Температура блока
	Int             TemperBKP;      // 23. 523 Температура блока БКП
	Uns             VersionPO;      // 24. 524 Версия ПО
	Uns             VersionPOBkp;   // 25. 525 Версия ПО БКП
	Uns				VoltageDown;	// 26. 526 Падение напряжения
	Uns				RevErrValue;	// 27. 527 Колво сбоев датчика положения
	Uns 			TemperED;		// 28. 528 температура ЭД для БКП 9.1
	TBCP9Reg		BCP9Reg;		// 29. 529 faults from BCP91
	Uns 			Rsvd[8];	    // 30-39. 530-539 Резерв
} TRamGroupA;

// Группа B (Адрес = 40, Количество = 100) - Параметры пользователя
typedef struct _TRamGroupB
{
	Uns				MoveCloseTorque;	// B0. 40.Момент закрытия
	Uns				MoveOpenTorque;		// B1. 41 Момент открытия
	Uns				BreakCloseTorque;	// B2. 42 Момент уплотнения на закрытие
	Uns				StartCloseTorque; 	// B3. 43 Момент трогания на закрытие
	Uns				BreakOpenTorque;  	// B4. 44 Момент уплотнения на открытие
	Uns				StartOpenTorque;  	// B5. 45 Момент трогания на открытие
	TValveType		ValveType;			// B6. 46 Тип задвижки (клин/шибер)
	TBreakMode      BreakMode;			// B7. 47 Тип уплотнения
	TRodType        RodType;           	// B8. 48 Тип штока
	Uns				CloseZone;			// B9. 49 Зона закрыто
	Uns				OpenZone;			// B10. 50 Зона открыто
	Uns             PositionAcc;        // B11. 51 Зона смещения
	Uns            	MainCode;        	// B12. 52 Код доступа
	TTimeVar 		DevTime;			// B13. 53 Время
	TDateVar 		DevDate;			// B14. 54 Дата
	Int		 		TimeCorrection;		// B15. 55 Корректеровка времени
	TIndicMode  	IIndicMode;         // B16. 56 Режим индикации тока
	TMuDuSetup  	MuDuSetup;          // B17. 57 Настройка режима МУ/ДУ
	TDuSource		DuSource;			// B18. 58 Источник команд ДУ
	Uns         	TuLockSeal;         // B19. 59 Блокировка залипани
	Uns         	TuTime;             // B20. 60 Время команды
	TInputType 		InputType;			// B21. 61 Тип входного сигнала 24/220
	TUInvert	    TuInvert;			// B22. 62 Маска дискретных входов
	TSInvert 		TsInvert;			// B23. 63 Маска дискретных выходов
	TBaudRate       RsBaudRate;         // B24. 64 Скорость связи
	Uns             RsStation;          // B25. 65 Адрес станции
	TParityMode		RsMode;				// B26. 66 Режим связи
	Uns				MuffTimer;			// B27. 67
	Uns				SwitcherMuDuMode;	// B28. режим с использованием переключателя МУ/ДУ на ЩТМ (опрос ТУ в режиме МУ)
	Uns				MuffStartTimer;		// B29. 69 Муфта по старту
	Uns				StartTime;		    // В30. 70 Время разгона
	Uns 			Sec3Mode;			// B31. 71
	Uns				NoMoveTime;			// B32. 72 Время отсутствия движения
	Uns				OverwayZone;		// B33. 73 Максимальный путь уплотнения
	TPlaceType		PlaceType;			// B34. 74 место установки привода (обычн, агрегатная, пожарка)
	Uns				KvoKvzOffOnStop;	// B35. 75 Размыкание КВО и КВЗ при СТОП, 0 - Нет, 1 - Да // SDV ЦПА
 	TStopMethod		StopMethod;			// B36. 76 Выбор типа торможения (Динамика, Противовключение)
 	Uns				ConductorSection;   // B37. 77 Сечение проводника
 	Uns             ConductorLength;	// B38. 78 Длина проводника
 	Int				VoltCorr;			// B39.
 	Uns 			Rsvd[10];			// B40 41 42 43 44 45 46 47 48 49 -49. 77-89
} TRamGroupB;

// Группа C (Адрес = 90, Количество = 120) - Заводские параметры
typedef struct _TRamGroupC
{
	Uns             FactCode;           	// C0. 90 Код доступа
	TDriveType      DriveType;          	// C1. 91 Тип привода
	Uns        		ProductYear;        	// C2. 92 Год изготовления блока
  	Uns             FactoryNumber;      	// C3. 93 Заводской номер блока
  	Uns             MaxTorque;          	// C4. 94 Максимальный момент привода
	Uns             Inom;               	// C5. 95 Номинальный ток
  	Uns             GearRatio;          	// C6. 96 Передаточное число редуктора
  	Uns				BKP91;	    			// С7. 97 Резерв
  	Uns				TekDefRegSwitch;		// С8. 98 Резерв
	THallBlock      HallBlock;          	// C9. 99 Состояние датчиков холла блока
	Uns             SubVersionPO;	    	// C10. 100 Подверсия ПО
	Uns				progonCycles;			// С11. 101 циклы прогона
	Uns				reserv102;				// С12. 102 Резерв
	Uns             MuffZone;           	// C13. 103 Расстояние сброса муфты
	Uns				PosSensPow;				// C14. 104 Тип датчика положения
	Uns				reserv105;				// C15. 105 Резерв
	Uns             SetDefaults;        	// C16. 106 Задание параметров по умолчанию
	Uns				ConnFlagCountBCP;		// C17. 107 временная задержка на определение аварии связь с БКП
	Uns             ModbusPauseStart;       // C18. 108 пауза при старте на модбас и ТС - 09,01,2020 - требование Обриев (и здравый смысл)
	Uns             BrakePause;         	// C19. 109 Пауза перед торможением
	Uns             BrakeTime;          	// C20. 110 Время торможения
	Uns       		StopShnTime;   			// C21. 111 Время торможения динамическим торможением
	Int				BreakZone;				// C22. 112 Число оборотов дв за которое начинаем тормозить
	Uns				BreakControl;			// c23. 113 управление тормозом БКП9.1
	Uns				Rsvd5[8];				// C24-33. 114-123 резерв
	Uns				CounterDisconect;		// C32  122 Счетчик обрывов связи между БКП БКЭП (реальных а не по аварии)
	Uns				TimeBtnStopKVOKVZ;		// C33  123 время разрыва КВО КВЗ при повороте ручки стоп
	Uns				BCPConTimeMove;			// C34  124 Время Выставления аварии нет связи в движении
	Int             CorrTemper;         	// C35. 125 Корректировка температуры блока БКП
	Uns        		BCPConTime;            // C36. 126 Время Выставления аварии нет связи в стопе
	Uns				CurrentMpyType;			// C37. 127 Управление ножкой уселителя сигнала АЦП для ДТ. работает только если тип привода не определен
	Uns             IU_Mpy;             	// C38. 128 Корректировка тока фазы U
	Uns             IV_Mpy;             	// C39. 129 Корректировка тока фазы V
	Uns             IW_Mpy;             	// C40. 130 Корректировка тока фазы W
	Uns             IU_Offset;          	// C41. 131 Смещение тока фазы U
	Uns             IV_Offset;          	// C42. 132 Смещение тока фазы V
	Uns             IW_Offset;          	// C43. 133 Смещение тока фазы W
	Uns             UR_Mpy;             	// C44. 134 Корректировка напряжения фазы R
	Uns             US_Mpy;             	// C45. 135 Корректировка напряжения фазы S
	Uns             UT_Mpy;             	// C46. 136 Корректировка напряжения фазы T
	Uns             UR_Offset;          	// C47. 137 Смещение напряжения фазы R
	Uns             US_Offset;          	// C48. 138 Смещение напряжения фазы S
	Uns             UT_Offset;          	// C49. 139 Смещение напряжения фазы T
	Uns				SinTf;					// C50. 140 ПОСТ.ВРЕМЕНИ ФИЛЬТРОВ СИНУСОВ
	Uns				RmsTf;					// C51. 141 ПОСТ.ВРЕМЕНИ ФИЛЬТРОВ RMS
	Uns				Dac_Mpy;				// C52. 142 Корректировка ЦАП
	Int				Dac_Offset;				// C53. 143 Смещение ЦАП
	TPrtMode        Ov;						// C54. 144 Защита от превышения напряжения
	Uns             OvLevel_max;        	// C55. 145 Уровень превышения напряжения при 47% превышения (320В)
	Uns             OvTime_max;     		// C56. 146 Время превышения напряжения при 47% превышения (1с)
	Uns             OvLevel;    			// C57. 147 Уровень превышения напряжения
	Uns             OvDTime;     			// C58. 148 Время превышения напряжения неисправность
	Uns             OvTime;     		// C59. 149 Время превышения напряжения
	TPrtMode        Uv;			// C60. 150 Защита от превышения напряжения
	Uns             UvLevel;   		// C61. 151 Уровень понижения напряжения
	Uns             UvDTime;    		// C62. 152 Время понижения напряжения
	Uns             UvTime;     		// C63. 153 Время превышения напряжения
  	Uns				reserv154;		// С64. 154 Резерв
  	Uns				reserv155;		// С65. 155 Резерв
  	Uns				reserv156;		// С66. 156 Резерв
	TPrtMode        Bv;        		// C67. 157 Защита от обрыва входных фаз
	Uns             BvLevel;   		// C68. 158 Уровень обрыва входных фаз
	Uns				BvLevelMove;		// C69. 159 Уровень обрыва питающих фаз в движении
	Uns             BvTime;    		// C70. 160 Время обрыва входных фаз
	Uns				Rsvd14;			// C71  161 резерв
	TPrtMode        Phl;           		// C72. 162 Защита от обрыва фаз нагрузки
	Uns             PhlLevel;      		// C73. 163 Уровень обрыва фаз
	Uns             PhlTime;       		// C74. 164 Время определения обрыва фаз
	TPrtMode        I2t;                	// C75. 165 Время-токовая защита
	Uns				Rsvd6[12];		// C76-84. 166-274 Резерв
	TPrtMode        ShC;        		// C88. 178 Защита от короткого замыкания
	Uns				ShC_Up; 		// C89. 179 убрать
	Uns				ShC_Down;		// C90. 180 уброать в H
	TPrtMode        CalibIndic;         	// C91. 181 Индикация калибровки
	TPrtMode        ErrIndic;           	// C92. 182 Индикация аварий устройства
	TPrtMode        TemperTrack;        	// C93. 183 Защита от перегрева/переохлаждения блока
	Int				Rsvd13[3];		// C94 - 96. Резерв
	Int             TenOnValue;         	// C97. 187 Уровень включения ТЕНа
	Int             TenOffValue;        	// C98. 188 Уровень выключения ТЕНа
	Uns 			Rsvd11[3];		// С99-101.  189-191 резерв
	TPrtMode        PhOrd;          	// C102. 192 Защита от неверного чередования фаз двигателя
	Uns				PhOrdTime;		// C103. 193 Время чередования фаз двигателя
	Uns             PhOrdZone;      	// C104. 194 Расстояние чередования фаз двигателя
	TPrtMode        MuDuDef;        	// C105. 195 Защита ошибки входов Му/Ду
	Uns				Rsvd12[2];		// C106-107. 196-197 Резерв
	Int				CorrClose30Trq;		// C108. 198
	Int				CorrClose40Trq;		// C109. 199 Параметр для корректировки индикации малых моментов (меньше 60%)
	Int				CorrClose60Trq;		// C110. 200 Параметр для корректировки индикации больших моментов (больше 60%)		Int		CorrOpen80Trq;		// C116. 206
	Int				CorrClose80Trq;		// C111. 201
	Int				CorrClose110Trq;	// C112. 202
	Int				CorrOpen30Trq;		// C113. 203
