/*======================================================================
Имя файла:          project_Version.h
Автор:                      
Версия файла:      	
Дата изменения:		
Описание:
В данный заголовочный файл будут записываться номер последней ревизии проекта,
дата его последнего изменения и др.
========================================================================*/

#ifndef PROJECT_VERSION_
#define PROJECT_VERSION_

#ifdef __cplusplus
extern "C" {
#endif


#define DEVICE_GROUP				4 			// Группа устройств
#define VERSION						22			// Версия проекта
#define MODULE_VERSION				40			// Версия модулей и спецификации
#define SUBVERSION					02			// Подверсия проекта

// Версия подготовки к выпуску первой партии 4.008.4.0.13 16/12/17


#ifdef __cplusplus
}
#endif // extern "C"

#endif	//PROJECT_VERSION_
