/*======================================================================
Имя файла:          project_Version.h
Автор:                      
Версия файла:      	
Дата изменения:		
Описание:
В данный заголовочный файл будут записываться номер последней ревизии проекта,
дата его последнего изменения и др.
========================================================================*/

#ifndef PROJECT_VERSION_
#define PROJECT_VERSION_

#ifdef __cplusplus
extern "C" {
#endif

// Источник команды управления

#ifdef __cplusplus
}
#endif // extern "C"

#endif	//PROJECT_VERSION_
