/*======================================================================
Èìÿ ôàéëà:          project_Version.h
Àâòîð:                      
Âåðñèÿ ôàéëà:      	
Äàòà èçìåíåíèÿ:		
Îïèñàíèå:
Â äàííûé çàãîëîâî÷íûé ôàéë áóäóò çàïèñûâàòüñÿ íîìåð ïîñëåäíåé ðåâèçèè ïðîåêòà,
äàòà åãî ïîñëåäíåãî èçìåíåíèÿ è äð.
========================================================================*/

#ifndef PROJECT_VERSION_
#define PROJECT_VERSION_

#ifdef __cplusplus
extern "C" {
#endif


#define DEVICE_GROUP				4 			// Ãðóïïà óñòðîéñòâ

#define VERSION						24			// Âåðñèÿ ïðîåêòà

#define MODULE_VERSION				40			// Âåðñèÿ ìîäóëåé è ñïåöèôèêàöèè
#define SUBVERSION					03			// Ïîäâåðñèÿ ïðîåêòà

// Âåðñèÿ ïîäãîòîâêè ê âûïóñêó ïåðâîé ïàðòèè 4.008.4.0.13 16/12/17


#ifdef __cplusplus
}
#endif // extern "C"

#endif	//PROJECT_VERSION_
