; яОЕЖХЮКХГХПНБЮММЮЪ РЮАКХЖЮ ЙНЩТТХЖХЕМРНБ ОНБЕПУМНЯРЕИ
; УЮПЮЙРЕПХГСЧЫЮЪ ЛНЛЕМР юд Б ТСМЙЖХХ МЮОПЪФЕМХЪ, РНЙЮ
; Х СЦКЮ МЮЦПСГЙХ.

; оНДДЕПФХБЮЕРЯЪ ЯНБЛЕЯРМНЕ ХЯОНКЭГНБЮМХЕ Я РХОНЛ ПЮЯВЕРЮ ЛНЛЕМРЮ CUB(3 ОНБЕПУМНЯРХ)
 ;---------------------------------------------------------------------------
 ;   лЮЯЯХБ		|мНЛ. ЛНЛЕМР| iПЕД | рХО   |  рХО	  |лНЫМНЯРЭ|   яХМУП.   |
 ;  ЙНМЯРЮМР	|  ОПХБНДЮ  |	   |ГЮДБХФ.|  юд	  |		   |  ЯЙНПНЯРЭ  |
 ;---------------------------------------------------------------------------
 .def _drive1   ;   100 Nm,  i=52.4,  A-25, юхл-ю63б4,  0.37ЙбР, 1500 НА/ЛХМ|
 .def _drive2	;   100 Nm,  i=52.4,  A-50, юхл-ю63ю2,  0.37ЙбР, 3000 НА/ЛХМ|
 .def _drive3	;   400 Nm,  i=73.7,  а-20, юхл-ю80S4,  0.55ЙбР, 1500 НА/ЛХМ|
 .def _drive4	;   400 Nm,  i=73.7,  а-50, юхл-ю80б2,  1.5ЙбР,  3000 НА/ЛХМ|
 .def _drive5	;   800 Nm,  i=73.7,  б-40, юхл-ю80б2,  1.5ЙбР,  3000 НА/ЛХМ|
 .def _drive6	;  1000 Nm,  i=73.7,  б-20, юхл-ю80б4,  1.5ЙбР,  1500 НА/ЛХМ|
 .def _drive7	;  4000 Nm,  i=167.2, ц-9,  юхл-ю100S4, 2.5ЙбР,  1500 НА/ЛХМ|
 .def _drive8	;  4000 Nm,  i=167.2, ц-18, юхл-ю100S2, 4.0ЙбР,  3000 НА/ЛХМ|
 .def _drive9	; 10000 Nm,  i=252.2, д-6,  юхл-ю100L4, 4.0ЙбР,  1500 НА/ЛХМ|
 .def _drive10	; 10000 Nm,  i=270.2, д-12, юхл-ю100L2, 5.5ЙбР,  3000 НА/ЛХМ|
 .def _drive11	; 10000 Nm,  i=174.2, д-10, дюрщй-350,  11.0ЙбР, 1500 НА/ЛХМ| асп2					|
 .def _drive12	; 15000 Nm	 i=144,   д-10, дюрщй-350,  15.0ЙбР, 1500 НА/ЛХМ|												|
 .def _drive13	; 20000 Nm,  i=144,   F-40, дюрщй-350,  18.5ЙбР, 1500 НА/ЛХМ|
 .def _drive14	;   400 Nm,  i=73.7,  а-40, юхл-ю80L2,  1.1ЙбР,  3000 НА/ЛХМ|
 .def _drive15	;	 ?														|
 .def _drive16	;	 ?														|
 .def _drive17	;	 ?														|
 .def _drive18	;	 ?														|
 .def _drive19	;	 ?														|
 .def _drive20	;	 ?														|
;----------------------------------------------------------------------------

_drive1			;100 Nm,  i=52.4,  A-25, юхл-ю63б4,  0.37ЙбР, 1500 НА/ЛХМ
 .word 1		;1.  лнлемр рнй 0_0
 .word 75		;2.  лнлемр рнй 0_1
 .word 105		;3.  лнлемр рнй 0_2
 .word 130		;4.  лнлемр рнй 0_3
 .word 130		;5.  лнлемр рнй 0_4
 .word 5		;6.  лнлемр рнй 1_0
 .word 50		;7.  лнлемр рнй 1_1
 .word 90		;8.  лнлемр рнй 1_2
 .word 176		;9.  лнлемр рнй 1_3
 .word 175		;10. лнлемр рнй 1_4
 .word 10		;11. лнлемр рнй 2_0
 .word 80		;12. лнлемр рнй 2_1
 .word 140		;13. лнлемр рнй 2_2
 .word 180		;14. лнлемр рнй 2_3
 .word 200		;15. лнлемр рнй 2_4
 .word 15		;16. лнлемр рнй 3_0
 .word 100		;17. лнлемр рнй 3_1
 .word 175		;18. лнлемр рнй 3_2
 .word 240		;19. лнлемр рнй 3_3
 .word 280		;20. лнлемр рнй 3_4
 .word 70		;21. лнлемр сцнк 0_0
 .word 50		;22. лнлемр сцнк 0_1
 .word 40		;23. лнлемр сцнк 0_2
 .word 10		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 70		;26. лнлемр сцнк 1_0
 .word 50		;27. лнлемр сцнк 1_1
 .word 40		;28. лнлемр сцнк 1_2
 .word 20		;29. лнлемр сцнк 1_3
 .word 10		;30. лнлемр сцнк 1_4
 .word 115		;31. лнлемр сцнк 2_0
 .word 70		;32. лнлемр сцнк 2_1
 .word 50		;33. лнлемр сцнк 2_2
 .word 30		;34. лнлемр сцнк 2_3
 .word 15		;35. лнлемр сцнк 2_4
 .word 115		;36. лнлемр сцнк 3_0
 .word 70		;37. лнлемр сцнк 3_1
 .word 50		;38. лнлемр сцнк 3_2
 .word 30		;39. лнлемр сцнк 3_3
 .word 15		;40. лнлемр сцнк 3_4
 .word 90		;41. сцнк яхтс 0_0 
 .word 86		;42. сцнк яхтс 0_1 
 .word 77		;43. сцнк яхтс 0_2
 .word 67		;44. сцнк яхтс 0_3
 .word 58		;45. сцнк яхтс 0_4
 .word 95		;46. сцнк яхтс 1_0
 .word 92		;47. сцнк яхтс 1_1
 .word 86		;48. сцнк яхтс 1_2
 .word 76		;49. сцнк яхтс 1_3
 .word 68		;50. сцнк яхтс 1_4
 .word 98		;51. сцнк яхтс 2_0
 .word 96		;52. сцнк яхтс 2_1
 .word 90		;53. сцнк яхтс 2_2
 .word 84		;54. сцнк яхтс 2_3
 .word 77		;55. сцнк яхтс 2_4
 .word 101		;56. сцнк яхтс 3_0
 .word 99		;57. сцнк яхтс 3_1
 .word 92		;58. сцнк яхтс 3_2
 .word 86		;59. сцнк яхтс 3_3
 .word 79		;60. сцнк яхтс 3_4

_drive2 	;   100 Nm,  i=52.4,  A-50, юхл-ю63ю2,  0.37ЙбР, 3000 НА/ЛХМ|
 .word 13		;1.  лнлемр рнй 0_0
 .word 40		;2.  лнлемр рнй 0_1
 .word 60		;3.  лнлемр рнй 0_2
 .word 80		;4.  лнлемр рнй 0_3
 .word 100		;5.  лнлемр рнй 0_4
 .word 10		;6.  лнлемр рнй 1_0
 .word 50		;7.  лнлемр рнй 1_1
 .word 80		;8.  лнлемр рнй 1_2
 .word 90		;9.  лнлемр рнй 1_3
 .word 100		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 60		;12. лнлемр рнй 2_1
 .word 85		;13. лнлемр рнй 2_2
 .word 120		;14. лнлемр рнй 2_3
 .word 140		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 1		;17. лнлемр рнй 3_1
 .word 90		;18. лнлемр рнй 3_2
 .word 130		;19. лнлемр рнй 3_3
 .word 150		;20. лнлемр рнй 3_4
 .word 50		;21. лнлемр сцнк 0_0
 .word 20		;22. лнлемр сцнк 0_1
 .word 4		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 65		;26. лнлемр сцнк 1_0
 .word 35		;27. лнлемр сцнк 1_1
 .word 16		;28. лнлемр сцнк 1_2
 .word 3		;29. лнлемр сцнк 1_3
 .word 1		;30. лнлемр сцнк 1_4
 .word 87		;31. лнлемр сцнк 2_0
 .word 52		;32. лнлемр сцнк 2_1
 .word 35		;33. лнлемр сцнк 2_2
 .word 14		;34. лнлемр сцнк 2_3
 .word 1		;35. лнлемр сцнк 2_4
 .word 120		;36. лнлемр сцнк 3_0
 .word 90		;37. лнлемр сцнк 3_1
 .word 60		;38. лнлемр сцнк 3_2
 .word 25		;39. лнлемр сцнк 3_3
 .word 1		;40. лнлемр сцнк 3_4
 .word 80		;41. сцнк яхтс 0_0 
 .word 74		;42. сцнк яхтс 0_1 
 .word 63		;43. сцнк яхтс 0_2
 .word 29		;44. сцнк яхтс 0_3
 .word 2		;45. сцнк яхтс 0_4
 .word 87		;46. сцнк яхтс 1_0
 .word 81		;47. сцнк яхтс 1_1
 .word 75		;48. сцнк яхтс 1_2
 .word 55		;49. сцнк яхтс 1_3
 .word 31		;50. сцнк яхтс 1_4
 .word 92		;51. сцнк яхтс 2_0
 .word 86		;52. сцнк яхтс 2_1
 .word 77		;53. сцнк яхтс 2_2
 .word 68		;54. сцнк яхтс 2_3
 .word 47		;55. сцнк яхтс 2_4
 .word 94		;56. сцнк яхтс 3_0
 .word 89		;57. сцнк яхтс 3_1
 .word 82		;58. сцнк яхтс 3_2
 .word 72		;59. сцнк яхтс 3_3
 .word 60		;60. сцнк яхтс 3_4 

_drive3	; 400 Nm,  i=73.7,  а-20, юхл-ю80S4,  0.55ЙбР, 1500 НА/ЛХМ|04.12.12  рНЙ 1.8ю
 .word 5		;1.  лнлемр рнй 0_0
 .word 45		;2.  лнлемр рнй 0_1
 .word 66		;3.  лнлемр рнй 0_2
 .word 100		;4.  лнлемр рнй 0_3
 .word 120		;5.  лнлемр рнй 0_4
 .word 1		;6.  лнлемр рнй 1_0
 .word 50		;7.  лнлемр рнй 1_1
 .word 82		;8.  лнлемр рнй 1_2
 .word 110		;9.  лнлемр рнй 1_3
 .word 125		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 42		;12. лнлемр рнй 2_1
 .word 100		;13. лнлемр рнй 2_2
 .word 130		;14. лнлемр рнй 2_3
 .word 150		;15. лнлемр рнй 2_4
 .word 70		;16. лнлемр рнй 3_0
 .word 80		;17. лнлемр рнй 3_1
 .word 87		;18. лнлемр рнй 3_2
 .word 145		;19. лнлемр рнй 3_3
 .word 160		;20. лнлемр рнй 3_4
 .word 40		;21. лнлемр сцнк 0_0
 .word 37		;22. лнлемр сцнк 0_1
 .word 10		;23. лнлемр сцнк 0_2
 .word 5		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 90		;26. лнлемр сцнк 1_0
 .word 55		;27. лнлемр сцнк 1_1
 .word 30		;28. лнлемр сцнк 1_2
 .word 15		;29. лнлемр сцнк 1_3
 .word 1		;30. лнлемр сцнк 1_4
 .word 150		;31. лнлемр сцнк 2_0
 .word 87		;32. лнлемр сцнк 2_1
 .word 50		;33. лнлемр сцнк 2_2
 .word 30		;34. лнлемр сцнк 2_3
 .word 5		;35. лнлемр сцнк 2_4
 .word 180		;36. лнлемр сцнк 3_0
 .word 137		;37. лнлемр сцнк 3_1
 .word 80		;38. лнлемр сцнк 3_2
 .word 36		;39. лнлемр сцнк 3_3
 .word 1		;40. лнлемр сцнк 3_4
 .word 80		;41. сцнк яхтс 0_0 
 .word 75		;42. сцнк яхтс 0_1 
 .word 73		;43. сцнк яхтс 0_2
 .word 57		;44. сцнк яхтс 0_3
 .word 92		;45. сцнк яхтс 0_4
 .word 92		;46. сцнк яхтс 1_0
 .word 87		;47. сцнк яхтс 1_1
 .word 80		;48. сцнк яхтс 1_2
 .word 67		;49. сцнк яхтс 1_3
 .word 54		;50. сцнк яхтс 1_4
 .word 96		;51. сцнк яхтс 2_0
 .word 93		;52. сцнк яхтс 2_1
 .word 85		;53. сцнк яхтс 2_2
 .word 72		;54. сцнк яхтс 2_3
 .word 63		;55. сцнк яхтс 2_4
 .word 98		;56. сцнк яхтс 3_0
 .word 94		;57. сцнк яхтс 3_1
 .word 90		;58. сцнк яхтс 3_2
 .word 81		;59. сцнк яхтс 3_3
 .word 70		;60. сцнк яхтс 3_4  


_drive4		;   400 Nm,  i=73.7,  а-50, юхл-ю80б2,  1.5ЙбР,  3000 НА/ЛХМ|
 .word 5		;1.  лнлемр рнй 0_0
 .word 45		;2.  лнлемр рнй 0_1
 .word 66		;3.  лнлемр рнй 0_2
 .word 100		;4.  лнлемр рнй 0_3
 .word 120		;5.  лнлемр рнй 0_4
 .word 1		;6.  лнлемр рнй 1_0
 .word 45		;7.  лнлемр рнй 1_1
 .word 75		;8.  лнлемр рнй 1_2
 .word 100		;9.  лнлемр рнй 1_3
 .word 110		;10. лнлемр рнй 1_4
 .word 15		;11. лнлемр рнй 2_0
 .word 62		;12. лнлемр рнй 2_1
 .word 87		;13. лнлемр рнй 2_2
 .word 110		;14. лнлемр рнй 2_3
 .word 125		;15. лнлемр рнй 2_4
 .word 70		;16. лнлемр рнй 3_0
 .word 80		;17. лнлемр рнй 3_1
 .word 87		;18. лнлемр рнй 3_2
 .word 125		;19. лнлемр рнй 3_3
 .word 135		;20. лнлемр рнй 3_4
 .word 40		;21. лнлемр сцнк 0_0
 .word 37		;22. лнлемр сцнк 0_1
 .word 10		;23. лнлемр сцнк 0_2
 .word 5		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 65		;26. лнлемр сцнк 1_0
 .word 45		;27. лнлемр сцнк 1_1
 .word 20		;28. лнлемр сцнк 1_2
 .word 11		;29. лнлемр сцнк 1_3
 .word 1		;30. лнлемр сцнк 1_4
 .word 85		;31. лнлемр сцнк 2_0
 .word 43		;32. лнлемр сцнк 2_1
 .word 25		;33. лнлемр сцнк 2_2
 .word 12		;34. лнлемр сцнк 2_3
 .word 5		;35. лнлемр сцнк 2_4
 .word 95		;36. лнлемр сцнк 3_0
 .word 65		;37. лнлемр сцнк 3_1
 .word 40		;38. лнлемр сцнк 3_2
 .word 24		;39. лнлемр сцнк 3_3
 .word 1		;40. лнлемр сцнк 3_4
 .word 80		;41. сцнк яхтс 0_0 
 .word 75		;42. сцнк яхтс 0_1 
 .word 73		;43. сцнк яхтс 0_2
 .word 57		;44. сцнк яхтс 0_3
 .word 92		;45. сцнк яхтс 0_4
 .word 92		;46. сцнк яхтс 1_0
 .word 87		;47. сцнк яхтс 1_1
 .word 80		;48. сцнк яхтс 1_2
 .word 67		;49. сцнк яхтс 1_3
 .word 54		;50. сцнк яхтс 1_4
 .word 95		;51. сцнк яхтс 2_0
 .word 92		;52. сцнк яхтс 2_1
 .word 83		;53. сцнк яхтс 2_2
 .word 75		;54. сцнк яхтс 2_3
 .word 65		;55. сцнк яхтс 2_4
 .word 98		;56. сцнк яхтс 3_0
 .word 94		;57. сцнк яхтс 3_1
 .word 90		;58. сцнк яхтс 3_2
 .word 81		;59. сцнк яхтс 3_3
 .word 70		;60. сцнк яхтс 3_4   
 
_drive5	;   800 Nm,  i=73.7,  б-40, юхл-ю80б2,  1.5ЙбР,  3000 НА/ЛХМ|  ме цнрнбн - ямхлюрэ гюмнбн 04.12.12
 .word 12		;1.  лнлемр рнй 0_0
 .word 30		;2.  лнлемр рнй 0_1
 .word 60		;3.  лнлемр рнй 0_2
 .word 67		;4.  лнлемр рнй 0_3
 .word 80		;5.  лнлемр рнй 0_4
 .word 10		;6.  лнлемр рнй 1_0
 .word 55		;7.  лнлемр рнй 1_1
 .word 76		;8.  лнлемр рнй 1_2
 .word 95		;9.  лнлемр рнй 1_3
 .word 110		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 58		;12. лнлемр рнй 2_1
 .word 92		;13. лнлемр рнй 2_2
 .word 110		;14. лнлемр рнй 2_3
 .word 125		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 1		;17. лнлемр рнй 3_1
 .word 96		;18. лнлемр рнй 3_2
 .word 125		;19. лнлемр рнй 3_3
 .word 160		;20. лнлемр рнй 3_4
 .word 50		;21. лнлемр сцнк 0_0
 .word 40		;22. лнлемр сцнк 0_1
 .word 11		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 70		;26. лнлемр сцнк 1_0
 .word 66		;27. лнлемр сцнк 1_1
 .word 28		;28. лнлемр сцнк 1_2
 .word 14		;29. лнлемр сцнк 1_3
 .word 9		;30. лнлемр сцнк 1_4
 .word 100		;31. лнлемр сцнк 2_0
 .word 85		;32. лнлемр сцнк 2_1
 .word 45		;33. лнлемр сцнк 2_2
 .word 21		;34. лнлемр сцнк 2_3
 .word 12		;35. лнлемр сцнк 2_4
 .word 150		;36. лнлемр сцнк 3_0
 .word 130		;37. лнлемр сцнк 3_1
 .word 81		;38. лнлемр сцнк 3_2
 .word 38		;39. лнлемр сцнк 3_3
 .word 10		;40. лнлемр сцнк 3_4
 .word 68		;41. сцнк яхтс 0_0 
 .word 50		;42. сцнк яхтс 0_1 
 .word 35		;43. сцнк яхтс 0_2
 .word 20		;44. сцнк яхтс 0_3
 .word 10		;45. сцнк яхтс 0_4
 .word 78		;46. сцнк яхтс 1_0
 .word 63		;47. сцнк яхтс 1_1
 .word 52		;48. сцнк яхтс 1_2
 .word 25		;49. сцнк яхтс 1_3
 .word 10		;50. сцнк яхтс 1_4
 .word 87		;51. сцнк яхтс 2_0
 .word 78		;52. сцнк яхтс 2_1
 .word 70		;53. сцнк яхтс 2_2
 .word 47		;54. сцнк яхтс 2_3
 .word 29		;55. сцнк яхтс 2_4
 .word 88		;56. сцнк яхтс 3_0
 .word 80		;57. сцнк яхтс 3_1 
 .word 71		;58. сцнк яхтс 3_2
 .word 52		;59. сцнк яхтс 3_3
 .word 5		;60. сцнк яхтс 3_4 	

_drive6	;  1000 Nm,  i=73.7,  б-20, юхл-ю80б4,  1.5ЙбР,  1500 НА/ЛХМ|
 .word 12		;1.  лнлемр рнй 0_0
 .word 30		;2.  лнлемр рнй 0_1
 .word 60		;3.  лнлемр рнй 0_2
 .word 67		;4.  лнлемр рнй 0_3
 .word 80		;5.  лнлемр рнй 0_4
 .word 10		;6.  лнлемр рнй 1_0
 .word 55		;7.  лнлемр рнй 1_1
 .word 76		;8.  лнлемр рнй 1_2
 .word 95		;9.  лнлемр рнй 1_3
 .word 110		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 58		;12. лнлемр рнй 2_1
 .word 92		;13. лнлемр рнй 2_2
 .word 110		;14. лнлемр рнй 2_3
 .word 125		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 1		;17. лнлемр рнй 3_1
 .word 96		;18. лнлемр рнй 3_2
 .word 125		;19. лнлемр рнй 3_3
 .word 160		;20. лнлемр рнй 3_4
 .word 50		;21. лнлемр сцнк 0_0
 .word 40		;22. лнлемр сцнк 0_1
 .word 11		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 70		;26. лнлемр сцнк 1_0
 .word 66		;27. лнлемр сцнк 1_1
 .word 28		;28. лнлемр сцнк 1_2
 .word 14		;29. лнлемр сцнк 1_3
 .word 9		;30. лнлемр сцнк 1_4
 .word 100		;31. лнлемр сцнк 2_0
 .word 85		;32. лнлемр сцнк 2_1
 .word 45		;33. лнлемр сцнк 2_2
 .word 21		;34. лнлемр сцнк 2_3
 .word 12		;35. лнлемр сцнк 2_4
 .word 150		;36. лнлемр сцнк 3_0
 .word 130		;37. лнлемр сцнк 3_1
 .word 81		;38. лнлемр сцнк 3_2
 .word 38		;39. лнлемр сцнк 3_3
 .word 10		;40. лнлемр сцнк 3_4
 .word 80		;41. сцнк яхтс 0_0 
 .word 75		;42. сцнк яхтс 0_1 
 .word 64		;43. сцнк яхтс 0_2
 .word 43		;44. сцнк яхтс 0_3
 .word 35		;45. сцнк яхтс 0_4
 .word 87		;46. сцнк яхтс 1_0
 .word 82		;47. сцнк яхтс 1_1
 .word 76		;48. сцнк яхтс 1_2
 .word 61		;49. сцнк яхтс 1_3
 .word 45		;50. сцнк яхтс 1_4
 .word 94		;51. сцнк яхтс 2_0
 .word 86		;52. сцнк яхтс 2_1
 .word 78		;53. сцнк яхтс 2_2
 .word 67		;54. сцнк яхтс 2_3
 .word 60		;55. сцнк яхтс 2_4
 .word 94		;56. сцнк яхтс 3_0
 .word 92		;57. сцнк яхтс 3_1 
 .word 87		;58. сцнк яхтс 3_2
 .word 78		;59. сцнк яхтс 3_3
 .word 69		;60. сцнк яхтс 3_4 	


_drive7			;  4000 Nm,  i=167.2, ц-9,  юхл-ю100S4, 2.5ЙбР,  1500 НА/ЛХМ 5,5A
 .word 8		;1.  лнлемр рнй 0_0
 .word 35		;2.  лнлемр рнй 0_1
 .word 52		;3.  лнлемр рнй 0_2
 .word 68		;4.  лнлемр рнй 0_3
 .word 80		;5.  лнлемр рнй 0_4
 .word 1		;6.  лнлемр рнй 1_0
 .word 1		;7.  лнлемр рнй 1_1
 .word 38		;8.  лнлемр рнй 1_2
 .word 70		;9.  лнлемр рнй 1_3
 .word 102		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 1		;12. лнлемр рнй 2_1
 .word 60		;13. лнлемр рнй 2_2
 .word 80		;14. лнлемр рнй 2_3
 .word 102		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 1		;17. лнлемр рнй 3_1
 .word 70		;18. лнлемр рнй 3_2
 .word 90		;19. лнлемр рнй 3_3
 .word 110		;20. лнлемр рнй 3_4
 .word 61		;21. лнлемр сцнк 0_0
 .word 61		;22. лнлемр сцнк 0_1
 .word 14		;23. лнлемр сцнк 0_2
 .word 7		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 86		;26. лнлемр сцнк 1_0
 .word 43		;27. лнлемр сцнк 1_1
 .word 19		;28. лнлемр сцнк 1_2
 .word 14		;29. лнлемр сцнк 1_3
 .word 3		;30. лнлемр сцнк 1_4
 .word 111		;31. лнлемр сцнк 2_0
 .word 80		;32. лнлемр сцнк 2_1
 .word 42		;33. лнлемр сцнк 2_2
 .word 20		;34. лнлемр сцнк 2_3
 .word 1		;35. лнлемр сцнк 2_4
 .word 115		;36. лнлемр сцнк 3_0
 .word 85		;37. лнлемр сцнк 3_1
 .word 50		;38. лнлемр сцнк 3_2
 .word 25		;39. лнлемр сцнк 3_3
 .word 1		;40. лнлемр сцнк 3_4
 .word 82		;41. сцнк яхтс 0_0 
 .word 77		;42. сцнк яхтс 0_1 
 .word 64		;43. сцнк яхтс 0_2
 .word 57		;44. сцнк яхтс 0_3
 .word 27		;45. сцнк яхтс 0_4
 .word 88		;46. сцнк яхтс 1_0
 .word 85		;47. сцнк яхтс 1_1
 .word 78		;48. сцнк яхтс 1_2
 .word 66		;49. сцнк яхтс 1_3
 .word 55		;50. сцнк яхтс 1_4
 .word 92		;51. сцнк яхтс 2_0
 .word 89		;52. сцнк яхтс 2_1
 .word 82		;53. сцнк яхтс 2_2
 .word 72		;54. сцнк яхтс 2_3
 .word 65		;55. сцнк яхтс 2_4
 .word 94		;56. сцнк яхтс 3_0
 .word 90		;57. сцнк яхтс 3_1
 .word 86		;58. сцнк яхтс 3_2
 .word 79		;59. сцнк яхтс 3_3
 .word 71		;60. сцнк яхтс 3_4 

_drive8		    ; 4000 Nm,  i=167.2, ц-18,  юхл-ю100S4, 4ЙбР,  3000 НА/ЛХМ 11A 
 .word 27		;1.  лнлемр рнй 0_0
 .word 45		;2.  лнлемр рнй 0_1
 .word 65		;3.  лнлемр рнй 0_2
 .word 70		;4.  лнлемр рнй 0_3
 .word 70		;5.  лнлемр рнй 0_4
 .word 25		;6.  лнлемр рнй 1_0
 .word 54		;7.  лнлемр рнй 1_1
 .word 70		;8.  лнлемр рнй 1_2
 .word 84		;9.  лнлемр рнй 1_3
 .word 100		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 50		;12. лнлемр рнй 2_1
 .word 69		;13. лнлемр рнй 2_2
 .word 90		;14. лнлемр рнй 2_3
 .word 110		;15. лнлемр рнй 2_4
 .word 10		;16. лнлемр рнй 3_0
 .word 60		;17. лнлемр рнй 3_1
 .word 85		;18. лнлемр рнй 3_2
 .word 100		;19. лнлемр рнй 3_3
 .word 120		;20. лнлемр рнй 3_4
 .word 36		;21. лнлемр сцнк 0_0
 .word 20		;22. лнлемр сцнк 0_1
 .word 13		;23. лнлемр сцнк 0_2
 .word 9		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 67		;26. лнлемр сцнк 1_0
 .word 37		;27. лнлемр сцнк 1_1
 .word 17		;28. лнлемр сцнк 1_2
 .word 10		;29. лнлемр сцнк 1_3
 .word 1		;30. лнлемр сцнк 1_4
 .word 100		;31. лнлемр сцнк 2_0
 .word 70		;32. лнлемр сцнк 2_1
 .word 35		;33. лнлемр сцнк 2_2
 .word 8		;34. лнлемр сцнк 2_3
 .word 2		;35. лнлемр сцнк 2_4
 .word 110		;36. лнлемр сцнк 3_0
 .word 90		;37. лнлемр сцнк 3_1
 .word 47		;38. лнлемр сцнк 3_2
 .word 8		;39. лнлемр сцнк 3_3
 .word 5		;40. лнлемр сцнк 3_4
 .word 76		;41. сцнк яхтс 0_0 
 .word 70		;42. сцнк яхтс 0_1 
 .word 61		;43. сцнк яхтс 0_2
 .word 40		;44. сцнк яхтс 0_3
 .word 20		;45. сцнк яхтс 0_4
 .word 80		;46. сцнк яхтс 1_0
 .word 77		;47. сцнк яхтс 1_1
 .word 69		;48. сцнк яхтс 1_2
 .word 55		;49. сцнк яхтс 1_3
 .word 25		;50. сцнк яхтс 1_4
 .word 82		;51. сцнк яхтс 2_0
 .word 78		;52. сцнк яхтс 2_1
 .word 70		;53. сцнк яхтс 2_2
 .word 57		;54. сцнк яхтс 2_3
 .word 36		;55. сцнк яхтс 2_4
 .word 84		;56. сцнк яхтс 3_0
 .word 80		;57. сцнк яхтс 3_1
 .word 75		;58. сцнк яхтс 3_2
 .word 65		;59. сцнк яхтс 3_3
 .word 55		;60. сцнк яхтс 3_4 

_drive9		; 10000 Nm, ipp = 100%  i=252.2, д-6,  юхл-ю100L4, 4.0ЙбР,  1500 НА/ЛХМ|
 .word 11		;1.  лнлемр рнй 0_0
 .word 32		;2.  лнлемр рнй 0_1
 .word 46		;3.  лнлемр рнй 0_2
 .word 58		;4.  лнлемр рнй 0_3
 .word 67		;5.  лнлемр рнй 0_4
 .word 1		;6.  лнлемр рнй 1_0
 .word 36		;7.  лнлемр рнй 1_1
 .word 58		;8.  лнлемр рнй 1_2
 .word 75		;9.  лнлемр рнй 1_3
 .word 84		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 29		;12. лнлемр рнй 2_1
 .word 70		;13. лнлемр рнй 2_2
 .word 86		;14. лнлемр рнй 2_3
 .word 110		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 1		;17. лнлемр рнй 3_1
 .word 77		;18. лнлемр рнй 3_2
 .word 90		;19. лнлемр рнй 3_3
 .word 130		;20. лнлемр рнй 3_4
 .word 30		;21. лнлемр сцнк 0_0
 .word 23		;22. лнлемр сцнк 0_1
 .word 12		;23. лнлемр сцнк 0_2
 .word 6		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 45		;26. лнлемр сцнк 1_0
 .word 40		;27. лнлемр сцнк 1_1
 .word 23		;28. лнлемр сцнк 1_2
 .word 11		;29. лнлемр сцнк 1_3
 .word 3		;30. лнлемр сцнк 1_4
 .word 70		;31. лнлемр сцнк 2_0
 .word 67		;32. лнлемр сцнк 2_1
 .word 38		;33. лнлемр сцнк 2_2
 .word 24		;34. лнлемр сцнк 2_3
 .word 6		;35. лнлемр сцнк 2_4
 .word 120		;36. лнлемр сцнк 3_0
 .word 110		;37. лнлемр сцнк 3_1
 .word 70		;38. лнлемр сцнк 3_2
 .word 37		;39. лнлемр сцнк 3_3
 .word 8		;40. лнлемр сцнк 3_4
 .word 82		;41. сцнк яхтс 0_0 
 .word 75		;42. сцнк яхтс 0_1 
 .word 65		;43. сцнк яхтс 0_2
 .word 41		;44. сцнк яхтс 0_3
 .word 40		;45. сцнк яхтс 0_4
 .word 88		;46. сцнк яхтс 1_0
 .word 82		;47. сцнк яхтс 1_1
 .word 74		;48. сцнк яхтс 1_2
 .word 60		;49. сцнк яхтс 1_3
 .word 43		;50. сцнк яхтс 1_4
 .word 91		;51. сцнк яхтс 2_0
 .word 86		;52. сцнк яхтс 2_1
 .word 76		;53. сцнк яхтс 2_2
 .word 68		;54. сцнк яхтс 2_3
 .word 57		;55. сцнк яхтс 2_4
 .word 94		;56. сцнк яхтс 3_0
 .word 90		;57. сцнк яхтс 3_1 91
 .word 85		;58. сцнк яхтс 3_2
 .word 75		;59. сцнк яхтс 3_3
 .word 65		;60. сцнк яхтс 3_4	 

_drive10 		; 10000 Nm,  i=270.2, д-12, юхл-ю100L2, 5.5ЙбР,  3000 НА/ЛХМ|
 .word 8		;1.  лнлемр рнй 0_0
 .word 25		;2.  лнлемр рнй 0_1
 .word 35		;3.  лнлемр рнй 0_2
 .word 40		;4.  лнлемр рнй 0_3
 .word 50		;5.  лнлемр рнй 0_4
 .word 8		;6.  лнлемр рнй 1_0
 .word 28		;7.  лнлемр рнй 1_1
 .word 55		;8.  лнлемр рнй 1_2
 .word 65		;9.  лнлемр рнй 1_3
 .word 85		;10. лнлемр рнй 1_4
 .word 1		;11. лнлемр рнй 2_0
 .word 37		;12. лнлемр рнй 2_1
 .word 60		;13. лнлемр рнй 2_2
 .word 80		;14. лнлемр рнй 2_3
 .word 115		;15. лнлемр рнй 2_4
 .word 1		;16. лнлемр рнй 3_0
 .word 45		;17. лнлемр рнй 3_1
 .word 74		;18. лнлемр рнй 3_2
 .word 94		;19. лнлемр рнй 3_3
 .word 120		;20. лнлемр рнй 3_4
 .word 25		;21. лнлемр сцнк 0_0
 .word 15		;22. лнлемр сцнк 0_1
 .word 4		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 0		;25. лнлемр сцнк 0_4
 .word 40		;26. лнлемр сцнк 1_0
 .word 20		;27. лнлемр сцнк 1_1
 .word 10		;28. лнлемр сцнк 1_2
 .word 3		;29. лнлемр сцнк 1_3
 .word 0		;30. лнлемр сцнк 1_4
 .word 62		;31. лнлемр сцнк 2_0
 .word 32		;32. лнлемр сцнк 2_1
 .word 20		;33. лнлемр сцнк 2_2
 .word 1		;34. лнлемр сцнк 2_3
 .word 1		;35. лнлемр сцнк 2_4
 .word 70		;36. лнлемр сцнк 3_0
 .word 43		;37. лнлемр сцнк 3_1
 .word 25		;38. лнлемр сцнк 3_2
 .word 2		;39. лнлемр сцнк 3_3
 .word 1		;40. лнлемр сцнк 3_4
 .word 83		;41. сцнк яхтс 0_0 
 .word 73		;42. сцнк яхтс 0_1 
 .word 60		;43. сцнк яхтс 0_2
 .word 50		;44. сцнк яхтс 0_3
 .word 50		;45. сцнк яхтс 0_4
 .word 89		;46. сцнк яхтс 1_0
 .word 83		;47. сцнк яхтс 1_1
 .word 72		;48. сцнк яхтс 1_2
 .word 50		;49. сцнк яхтс 1_3
 .word 30		;50. сцнк яхтс 1_4
 .word 90		;51. сцнк яхтс 2_0
 .word 86		;52. сцнк яхтс 2_1
 .word 79		;53. сцнк яхтс 2_2
 .word 68		;54. сцнк яхтс 2_3
 .word 48		;55. сцнк яхтс 2_4
 .word 98		;56. сцнк яхтс 3_0
 .word 91		;57. сцнк яхтс 3_1
 .word 82		;58. сцнк яхтс 3_2
 .word 70		;59. сцнк яхтс 3_3
 .word 52		;60. сцнк яхтс 3_4	

_drive11 		; 10000 Nm,  i=174.2, д-10, дюрщй-350,  11.0ЙбР, 1500 НА/ЛХМ| асп2 ме ямърн!!!
 .word 8		;1.  лнлемр рнй 0_0
 .word 25		;2.  лнлемр рнй 0_1
 .word 35		;3.  лнлемр рнй 0_2
 .word 40		;4.  лнлемр рнй 0_3
 .word 50		;5.  лнлемр рнй 0_4
 .word 8		;6.  лнлемр рнй 1_0
 .word 28		;7.  лнлемр рнй 1_1
 .word 55		;8.  лнлемр рнй 1_2
 .word 65		;9.  лнлемр рнй 1_3
 .word 85		;10. лнлемр рнй 1_4
 .word 16		;11. лнлемр рнй 2_0
 .word 48		;12. лнлемр рнй 2_1
 .word 68		;13. лнлемр рнй 2_2
 .word 87		;14. лнлемр рнй 2_3
 .word 125		;15. лнлемр рнй 2_4
 .word 0		;16. лнлемр рнй 3_0
 .word 40		;17. лнлемр рнй 3_1
 .word 74		;18. лнлемр рнй 3_2
 .word 94		;19. лнлемр рнй 3_3
 .word 130		;20. лнлемр рнй 3_4
 .word 25		;21. лнлемр сцнк 0_0
 .word 15		;22. лнлемр сцнк 0_1
 .word 4		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 0		;25. лнлемр сцнк 0_4
 .word 40		;26. лнлемр сцнк 1_0
 .word 20		;27. лнлемр сцнк 1_1
 .word 10		;28. лнлемр сцнк 1_2
 .word 3		;29. лнлемр сцнк 1_3
 .word 0		;30. лнлемр сцнк 1_4
 .word 55		;31. лнлемр сцнк 2_0
 .word 30		;32. лнлемр сцнк 2_1
 .word 15		;33. лнлемр сцнк 2_2
 .word 8		;34. лнлемр сцнк 2_3
 .word 0		;35. лнлемр сцнк 2_4
 .word 70		;36. лнлемр сцнк 3_0
 .word 43		;37. лнлемр сцнк 3_1
 .word 26		;38. лнлемр сцнк 3_2
 .word 13		;39. лнлемр сцнк 3_3
 .word 2		;40. лнлемр сцнк 3_4
 .word 83		;41. сцнк яхтс 0_0
 .word 73		;42. сцнк яхтс 0_1
 .word 60		;43. сцнк яхтс 0_2
 .word 50		;44. сцнк яхтс 0_3
 .word 50		;45. сцнк яхтс 0_4
 .word 89		;46. сцнк яхтс 1_0
 .word 83		;47. сцнк яхтс 1_1
 .word 72		;48. сцнк яхтс 1_2
 .word 50		;49. сцнк яхтс 1_3
 .word 30		;50. сцнк яхтс 1_4
 .word 90		;51. сцнк яхтс 2_0
 .word 86		;52. сцнк яхтс 2_1
 .word 79		;53. сцнк яхтс 2_2
 .word 68		;54. сцнк яхтс 2_3
 .word 48		;55. сцнк яхтс 2_4
 .word 98		;56. сцнк яхтс 3_0
 .word 91		;57. сцнк яхтс 3_1
 .word 82		;58. сцнк яхтс 3_2
 .word 70		;59. сцнк яхтс 3_3
 .word 52		;60. сцнк яхтс 3_4

_drive12 		; 15000 Nm	 i=144,   д-10, дюрщй-350,  15.0ЙбР, 1500 НА/ЛХМ| асп2 МЕР 160 190 Х 250б!!!
 .word 13		;1.  лнлемр рнй 0_0
 .word 53		;2.  лнлемр рнй 0_1
 .word 80		;3.  лнлемр рнй 0_2
 .word 100		;4.  лнлемр рнй 0_3
 .word 120		;5.  лнлемр рнй 0_4
 .word 13		;6.  лнлемр рнй 1_0
 .word 53		;7.  лнлемр рнй 1_1
 .word 80		;8.  лнлемр рнй 1_2
 .word 100		;9.  лнлемр рнй 1_3
 .word 120		;10. лнлемр рнй 1_4
 .word 13		;11. лнлемр рнй 2_0
 .word 53		;12. лнлемр рнй 2_1
 .word 80		;13. лнлемр рнй 2_2
 .word 100		;14. лнлемр рнй 2_3
 .word 120		;15. лнлемр рнй 2_4
 .word 13		;16. лнлемр рнй 3_0
 .word 53		;17. лнлемр рнй 3_1
 .word 80		;18. лнлемр рнй 3_2
 .word 100		;19. лнлемр рнй 3_3
 .word 120		;20. лнлемр рнй 3_4
 .word 86		;21. лнлемр сцнк 0_0
 .word 43		;22. лнлемр сцнк 0_1
 .word 23		;23. лнлемр сцнк 0_2
 .word 1		;24. лнлемр сцнк 0_3
 .word 1		;25. лнлемр сцнк 0_4
 .word 86		;26. лнлемр сцнк 1_0
 .word 43		;27. лнлемр сцнк 1_1
 .word 23		;28. лнлемр сцнк 1_2
 .word 3		;29. лнлемр сцнк 1_3
 .word 1		;30. лнлемр сцнк 1_4
 .word 86		;31. лнлемр сцнк 2_0
 .word 43		;32. лнлемр сцнк 2_1
 .word 23		;33. лнлемр сцнк 2_2
 .word 4		;34. лнлемр сцнк 2_3
 .word 1		;35. лнлемр сцнк 2_4
 .word 86		;36. лнлемр сцнк 3_0
 .word 43		;37. лнлемр сцнк 3_1
 .word 26		;38. лнлемр сцнк 3_2
 .word 13		;39. лнлемр сцнк 3_3
 .word 2		;40. лнлемр сцнк 3_4
 .word 97		;41. сцнк яхтс 0_0
 .word 91		;42. сцнк яхтс 0_1
 .word 80		;43. сцнк яхтс 0_2
 .word 75		;44. сцнк яхтс 0_3
 .word 71		;45. сцнк яхтс 0_4
 .word 97		;46. сцнк яхтс 1_0
 .word 91		;47. сцнк яхтс 1_1
 .word 80		;48. сцнк яхтс 1_2
 .word 75		;49. сцнк яхтс 1_3
 .word 71		;50. сцнк яхтс 1_4
 .word 97		;51. сцнк яхтс 2_0
 .word 91		;52. сцнк яхтс 2_1
 .word 80		;53. сцнк яхтс 2_2
 .word 75		;54. сцнк яхтс 2_3
 .word 71		;55. сцнк яхтс 2_4
 .word 98		;56. сцнк яхтс 3_0
 .word 91		;57. сцнк яхтс 3_1
 .word 82		;58. сцнк яхтс 3_2
 .word 75		;59. сцнк яхтс 3_3
 .word 71		;60. сцнк яхтс 3_4

_drive13 		; 20000 Nm,  i=144,   F-40, дюрщй-350,  18.5ЙбР, 1500 НА/ЛХМ| асп2 ме ямърн!!!
 .word 1		;1.  лнлемр рнй 0_0 +
 .word 27		;2.  лнлемр рнй 0_1 +
 .word 40		;3.  лнлемр рнй 0_2 +
 .word 70		;4.  лнлемр рнй 0_3 +
 .word 80		;5.  лнлемр рнй 0_4 +
 .word 1		;6.  лнлемр рнй 1_0 +
 .word 30		;7.  лнлемр рнй 1_1 +
 .word 55		;8.  лнлемр рнй 1_2 +
 .word 80		;9.  лнлемр рнй 1_3 +
 .word 105		;10. лнлемр рнй 1_4 +
 .word 1		;11. лнлемр рнй 2_0 +
 .word 60		;12. лнлемр рнй 2_1 +
 .word 85		;13. лнлемр рнй 2_2 +
 .word 110		;14. лнлемр рнй 2_3 +
 .word 130		;15. лнлемр рнй 2_4 +
 .word 5		;16. лнлемр рнй 3_0 +
 .word 60		;17. лнлемр рнй 3_1 +
 .word 85		;18. лнлемр рнй 3_2 +
 .word 110		;19. лнлемр рнй 3_3 +
 .word 130		;20. лнлемр рнй 3_4 +
 .word 55		;21. лнлемр сцнк 0_0 +
 .word 30		;22. лнлемр сцнк 0_1 +
 .word 10		;23. лнлемр сцнк 0_2 +
 .word 3		;24. лнлемр сцнк 0_3 +
 .word 0		;25. лнлемр сцнк 0_4 +
 .word 80		;26. лнлемр сцнк 1_0 +
 .word 40		;27. лнлемр сцнк 1_1 +
 .word 15		;28. лнлемр сцнк 1_2 +
 .word 1		;29. лнлемр сцнк 1_3 +
 .word 1		;30. лнлемр сцнк 1_4 +
 .word 105		;31. лнлемр сцнк 2_0 +
 .word 60		;32. лнлемр сцнк 2_1 +
 .word 30		;33. лнлемр сцнк 2_2 +
 .word 15		;34. лнлемр сцнк 2_3 +
 .word 1		;35. лнлемр сцнк 2_4 +
 .word 110		;36. лнлемр сцнк 3_0 +
 .word 60		;37. лнлемр сцнк 3_1 +
 .word 30		;38. лнлемр сцнк 3_2 +
 .word 15		;39. лнлемр сцнк 3_3 +
 .word 3		;40. лнлемр сцнк 3_4 +
 .word 87		;41. сцнк яхтс 0_0 +
 .word 83		;42. сцнк яхтс 0_1 +
 .word 76		;43. сцнк яхтс 0_2 +
 .word 65		;44. сцнк яхтс 0_3 +
 .word 60		;45. сцнк яхтс 0_4 +
 .word 93		;46. сцнк яхтс 1_0 +
 .word 89		;47. сцнк яхтс 1_1 +
 .word 82		;48. сцнк яхтс 1_2 +
 .word 71		;49. сцнк яхтс 1_3 +
 .word 66		;50. сцнк яхтс 1_4 +
 .word 96		;51. сцнк яхтс 2_0 +
 .word 92		;52. сцнк яхтс 2_1 +
 .word 85		;53. сцнк яхтс 2_2 +
 .word 74		;54. сцнк яхтс 2_3 +
 .word 69		;55. сцнк яхтс 2_4 +
 .word 99		;56. сцнк яхтс 3_0 +
 .word 96		;57. сцнк яхтс 3_1 +
 .word 89		;58. сцнк яхтс 3_2 +
 .word 83		;59. сцнк яхтс 3_3 +
 .word 78		;60. сцнк яхтс 3_4 +

_drive14	    ; ДСАКЭ 50000
 .word 1		;1.  лнлемр рнй 0_0 +
 .word 27		;2.  лнлемр рнй 0_1 +
 .word 40		;3.  лнлемр рнй 0_2 +
 .word 60		;4.  лнлемр рнй 0_3 +
 .word 85		;5.  лнлемр рнй 0_4 +
 .word 6		;6.  лнлемр рнй 1_0 +
 .word 29		;7.  лнлемр рнй 1_1 +
 .word 52		;8.  лнлемр рнй 1_2 +
 .word 82		;9.  лнлемр рнй 1_3 +
 .word 105		;10. лнлемр рнй 1_4 +
 .word 12		;11. лнлемр рнй 2_0 +
 .word 38		;12. лнлемр рнй 2_1 +
 .word 60		;13. лнлемр рнй 2_2 +
 .word 87		;14. лнлемр рнй 2_3 +
 .word 117		;15. лнлемр рнй 2_4 +
 .word 17		;16. лнлемр рнй 3_0 +
 .word 59		;17. лнлемр рнй 3_1 +
 .word 77		;18. лнлемр рнй 3_2 +
 .word 98		;19. лнлемр рнй 3_3 +
 .word 125		;20. лнлемр рнй 3_4 +
 .word 70		;21. лнлемр сцнк 0_0 +
 .word 30		;22. лнлемр сцнк 0_1 +
 .word 10		;23. лнлемр сцнк 0_2 +
 .word 3		;24. лнлемр сцнк 0_3 +
 .word 1		;25. лнлемр сцнк 0_4 +
 .word 90		;26. лнлемр сцнк 1_0 +
 .word 52		;27. лнлемр сцнк 1_1 +
 .word 22 		;28. лнлемр сцнк 1_2 +
 .word 10		;29. лнлемр сцнк 1_3 +
 .word 6		;30. лнлемр сцнк 1_4 +
 .word 110		;31. лнлемр сцнк 2_0 +
 .word 60		;32. лнлемр сцнк 2_1 +
 .word 30		;33. лнлемр сцнк 2_2 +
 .word 24		;34. лнлемр сцнк 2_3 +
 .word 9		;35. лнлемр сцнк 2_4 +
 .word 120		;36. лнлемр сцнк 3_0 +
 .word 70		;37. лнлемр сцнк 3_1 +
 .word 42		;38. лнлемр сцнк 3_2 +
 .word 28		;39. лнлемр сцнк 3_3 +
 .word 11		;40. лнлемр сцнк 3_4 +
 .word 87		;41. сцнк яхтс 0_0 +
 .word 83		;42. сцнк яхтс 0_1 +
 .word 76		;43. сцнк яхтс 0_2 +
 .word 65		;44. сцнк яхтс 0_3 +
 .word 60		;45. сцнк яхтс 0_4 +
 .word 93		;46. сцнк яхтс 1_0 +
 .word 89		;47. сцнк яхтс 1_1 +
 .word 82		;48. сцнк яхтс 1_2 +
 .word 71		;49. сцнк яхтс 1_3 +
 .word 66		;50. сцнк яхтс 1_4 +
 .word 96		;51. сцнк яхтс 2_0 +
 .word 92		;52. сцнк яхтс 2_1 +
 .word 85		;53. сцнк яхтс 2_2 +
 .word 74		;54. сцнк яхтс 2_3 +
 .word 69		;55. сцнк яхтс 2_4 +
 .word 99		;56. сцнк яхтс 3_0 +
 .word 96		;57. сцнк яхтс 3_1 +
 .word 89		;58. сцнк яхтс 3_2 +
 .word 83		;59. сцнк яхтс 3_3 +
 .word 78		;60. сцнк яхтс 3_4 +

_drive15		; 50000 Nm,  i=156,   F-48, дюрм-45-1-Л40,  45ЙбР, 1500 НА/ЛХМ|
 .word 1		;1.  лнлемр рнй 0_0 +
 .word 27		;2.  лнлемр рнй 0_1 +
 .word 40		;3.  лнлемр рнй 0_2 +
 .word 60		;4.  лнлемр рнй 0_3 +
 .word 85		;5.  лнлемр рнй 0_4 +
 .word 6		;6.  лнлемр рнй 1_0 +
 .word 29		;7.  лнлемр рнй 1_1 +
 .word 52		;8.  лнлемр рнй 1_2 +
 .word 82		;9.  лнлемр рнй 1_3 +
 .word 105		;10. лнлемр рнй 1_4 +
 .word 1		;11. лнлемр рнй 2_0 +
 .word 32		;12. лнлемр рнй 2_1 +
 .word 56		;13. лнлемр рнй 2_2 +
 .word 84		;14. лнлемр рнй 2_3 +
 .word 110		;15. лнлемр рнй 2_4 +
 .word 10		;16. лнлемр рнй 3_0 +
 .word 40		;17. лнлемр рнй 3_1 +
 .word 62		;18. лнлемр рнй 3_2 +
 .word 95		;19. лнлемр рнй 3_3 +
 .word 120		;20. лнлемр рнй 3_4 +
 .word 70		;21. лнлемр сцнк 0_0 +
 .word 30		;22. лнлемр сцнк 0_1 +
 .word 10		;23. лнлемр сцнк 0_2 +
 .word 3		;24. лнлемр сцнк 0_3 +
 .word 1		;25. лнлемр сцнк 0_4 +
 .word 90		;26. лнлемр сцнк 1_0 +
 .word 52		;27. лнлемр сцнк 1_1 +
 .word 22 		;28. лнлемр сцнк 1_2 +
 .word 10		;29. лнлемр сцнк 1_3 +
 .word 6		;30. лнлемр сцнк 1_4 +
 .word 110		;31. лнлемр сцнк 2_0 +
 .word 68		;32. лнлемр сцнк 2_1 +
 .word 34		;33. лнлемр сцнк 2_2 +
 .word 18		;34. лнлемр сцнк 2_3 +
 .word 6		;35. лнлемр сцнк 2_4 +
 .word 120		;36. лнлемр сцнк 3_0 +
 .word 75		;37. лнлемр сцнк 3_1 +
 .word 40		;38. лнлемр сцнк 3_2 +
 .word 25		;39. лнлемр сцнк 3_3 +
 .word 11		;40. лнлемр сцнк 3_4 +
 .word 87		;41. сцнк яхтс 0_0 +
 .word 83		;42. сцнк яхтс 0_1 +
 .word 76		;43. сцнк яхтс 0_2 +
 .word 65		;44. сцнк яхтс 0_3 +
 .word 60		;45. сцнк яхтс 0_4 +
 .word 93		;46. сцнк яхтс 1_0 +
 .word 89		;47. сцнк яхтс 1_1 +
 .word 82		;48. сцнк яхтс 1_2 +
 .word 71		;49. сцнк яхтс 1_3 +
 .word 66		;50. сцнк яхтс 1_4 +
 .word 96		;51. сцнк яхтс 2_0 +
 .word 92		;52. сцнк яхтс 2_1 +
 .word 85		;53. сцнк яхтс 2_2 +
 .word 74		;54. сцнк яхтс 2_3 +
 .word 69		;55. сцнк яхтс 2_4 +
 .word 99		;56. сцнк яхтс 3_0 +
 .word 96		;57. сцнк яхтс 3_1 +
 .word 89		;58. сцнк яхтс 3_2 +
 .word 83		;59. сцнк яхтс 3_3 +
 .word 78		;60. сцнк яхтс 3_4 +
_drive16

_drive17	
_drive18	
_drive19	
_drive20	
